TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DeviceSupport/source/f28003x_gpio.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__eallow")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___eallow")

    1247                      .dwattr $C$DW$69, DW_AT_TI_begin_line(0x194)
    1248                      .dwattr $C$DW$69, DW_AT_TI_begin_column(0x01)
    1249                      .dwattr $C$DW$69, DW_AT_TI_max_frame_size(-2)
    1250                      .dwpsn  file "../DeviceSupport/source/f28003x_gpio.c",line 405,column 1,is_stmt,address _GPIO_ReadPin
    1251              
    1252                      .dwfde $C$DW$CIE, _GPIO_ReadPin
    1253              $C$DW$70        .dwtag  DW_TAG_formal_parameter
    1254                      .dwattr $C$DW$70, DW_AT_name("gpioNumber")
    1255                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_gpioNumber")
    1256                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1257                      .dwattr $C$DW$70, DW_AT_location[DW_OP_reg0]
    1258              
    1259              
    1260              ;***************************************************************
    1261              ;* FNAME: _GPIO_ReadPin                 FR SIZE:   0           *
    1262              ;*                                                             *
    1263              ;* FUNCTION ENVIRONMENT                                        *
    1264              ;*                                                             *
    1265              ;* FUNCTION PROPERTIES                                         *
    1266              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1267              ;***************************************************************
    1268              
    1269              _GPIO_ReadPin:
    1270              ;* T     assigned to _gpioNumber
    1271              $C$DW$71        .dwtag  DW_TAG_variable
    1272                      .dwattr $C$DW$71, DW_AT_name("gpioNumber")
    1273                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_gpioNumber")
    1274                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$165)
    1275                      .dwattr $C$DW$71, DW_AT_location[DW_OP_reg22]
    1276              
    1277                      .dwcfi  cfa_offset, -2
    1278                      .dwcfi  save_reg_to_mem, 26, 0
    1279 00000000 2DA9          MOV       T,AL                  ; [CPU_ALU] |405| 
    1280                      .dwpsn  file "../DeviceSupport/source/f28003x_gpio.c",line 410,column 5,is_stmt,isa 0
    1281 00000001 93AC          MOV       AH,T                  ; [CPU_ALU] |410| 
    1282 00000002 2901          CLRC      SXM                   ; [CPU_ALU] 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   25

    1283 00000003 8F00!         MOVL      XAR4,#_GpioDataRegs   ; [CPU_ARAU] |410| 
         00000004 0000 
    1284 00000005 FFD4          LSR       AH,5                  ; [CPU_ALU] |410| 
    1285 00000006 FF91          LSL       AH,2                  ; [CPU_ALU] |410| 
    1286 00000007 5603          MOV       ACC,AH << 1           ; [CPU_ALU] |410| 
         00000008 01A8 
    1287 00000009 5601          ADDL      XAR4,ACC              ; [CPU_ALU] |410| 
         0000000a 00A4 
    1288 0000000b CCAC          AND       AL,T,#0x001f          ; [CPU_ALU] |410| 
         0000000c 001F 
    1289 0000000d 2DA9          MOV       T,AL                  ; [CPU_ALU] |410| 
    1290 0000000e 06C4          MOVL      ACC,*+XAR4[0]         ; [CPU_ALU] |410| 
    1291 0000000f 5622          LSRL      ACC,T                 ; [CPU_ALU] |410| 
    1292 00000010 1EA6          MOVL      XAR6,ACC              ; [CPU_ALU] |410| 
    1293 00000011 92A6          MOV       AL,AR6                ; [CPU_ALU] |410| 
    1294 00000012 9001          ANDB      AL,#0x01              ; [CPU_ALU] |410| 
    1295              $C$DW$72        .dwtag  DW_TAG_TI_branch
    1296                      .dwattr $C$DW$72, DW_AT_low_pc(0x00)
    1297                      .dwattr $C$DW$72, DW_AT_TI_return
    1298              
    1299 00000013 0006          LRETR     ; [CPU_FPU] 
    1300                      ; return occurs ; [] 
    1301                      .dwattr $C$DW$69, DW_AT_TI_end_file("../DeviceSupport/source/f28003x_gpio.c")
    1302                      .dwattr $C$DW$69, DW_AT_TI_end_line(0x19d)
    1303                      .dwattr $C$DW$69, DW_AT_TI_end_column(0x01)
    1304                      .dwendentry
    1305                      .dwendtag $C$DW$69
    1306              
    1307              ;**************************************************************
    1308              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1309              ;**************************************************************
    1310                      .global _InputXbarRegs
    1311                      .global _GpioDataRegs
    1312                      .global _GpioCtrlRegs
    1313              
    1314              ;***************************************************************
    1315              ;* TYPE INFORMATION                                            *
    1316              ;***************************************************************
    1317              
    1318              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1319                      .dwattr $C$DW$T$20, DW_AT_name("GPAAMSEL_BITS")
    1320                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1321              $C$DW$73        .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$73, DW_AT_name("rsvd1")
    1324                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd1")
    1325                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0f)
    1326                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1327                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1329              
    1330              $C$DW$74        .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1332                      .dwattr $C$DW$74, DW_AT_name("rsvd2")
    1333                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   26

    1334                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e)
    1335                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1336                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1338              
    1339              $C$DW$75        .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1341                      .dwattr $C$DW$75, DW_AT_name("rsvd3")
    1342                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd3")
    1343                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0d)
    1344                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1345                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$76        .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$76, DW_AT_name("rsvd4")
    1351                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd4")
    1352                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c)
    1353                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1354                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357              $C$DW$77        .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$77, DW_AT_name("rsvd5")
    1360                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd5")
    1361                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0b)
    1362                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1363                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1364                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1365              
    1366              $C$DW$78        .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$78, DW_AT_name("rsvd6")
    1369                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd6")
    1370                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0a)
    1371                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1372                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$79        .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$79, DW_AT_name("rsvd7")
    1378                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd7")
    1379                      .dwattr $C$DW$79, DW_AT_bit_offset(0x09)
    1380                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1381                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1383              
    1384              $C$DW$80        .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$80, DW_AT_name("rsvd8")
    1387                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd8")
    1388                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   27

    1389                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1390                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1392              
    1393              $C$DW$81        .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$81, DW_AT_name("rsvd9")
    1396                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd9")
    1397                      .dwattr $C$DW$81, DW_AT_bit_offset(0x07)
    1398                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1399                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$82        .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$82, DW_AT_name("rsvd10")
    1405                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd10")
    1406                      .dwattr $C$DW$82, DW_AT_bit_offset(0x06)
    1407                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1408                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$83        .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$83, DW_AT_name("rsvd11")
    1414                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd11")
    1415                      .dwattr $C$DW$83, DW_AT_bit_offset(0x05)
    1416                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1417                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420              $C$DW$84        .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$84, DW_AT_name("rsvd12")
    1423                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd12")
    1424                      .dwattr $C$DW$84, DW_AT_bit_offset(0x04)
    1425                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1426                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429              $C$DW$85        .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1431                      .dwattr $C$DW$85, DW_AT_name("rsvd13")
    1432                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd13")
    1433                      .dwattr $C$DW$85, DW_AT_bit_offset(0x03)
    1434                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1435                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1437              
    1438              $C$DW$86        .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$86, DW_AT_name("rsvd14")
    1441                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd14")
    1442                      .dwattr $C$DW$86, DW_AT_bit_offset(0x02)
    1443                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   28

    1444                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1446              
    1447              $C$DW$87        .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1449                      .dwattr $C$DW$87, DW_AT_name("rsvd15")
    1450                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd15")
    1451                      .dwattr $C$DW$87, DW_AT_bit_offset(0x01)
    1452                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1453                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1455              
    1456              $C$DW$88        .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1458                      .dwattr $C$DW$88, DW_AT_name("rsvd16")
    1459                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd16")
    1460                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00)
    1461                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1462                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1464              
    1465              $C$DW$89        .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$89, DW_AT_name("rsvd17")
    1468                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd17")
    1469                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0f)
    1470                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1471                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1472                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1473              
    1474              $C$DW$90        .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1476                      .dwattr $C$DW$90, DW_AT_name("rsvd18")
    1477                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd18")
    1478                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0e)
    1479                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1480                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1481                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483              $C$DW$91        .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1485                      .dwattr $C$DW$91, DW_AT_name("rsvd19")
    1486                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd19")
    1487                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0d)
    1488                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1489                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1490                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1491              
    1492              $C$DW$92        .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1494                      .dwattr $C$DW$92, DW_AT_name("rsvd20")
    1495                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd20")
    1496                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0c)
    1497                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1498                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   29

    1499                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1500              
    1501              $C$DW$93        .dwtag  DW_TAG_member
    1502                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1503                      .dwattr $C$DW$93, DW_AT_name("GPIO20")
    1504                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO20")
    1505                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0b)
    1506                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1507                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1508                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$94        .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$94, DW_AT_name("GPIO21")
    1513                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO21")
    1514                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0a)
    1515                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1516                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1517                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1518              
    1519              $C$DW$95        .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1521                      .dwattr $C$DW$95, DW_AT_name("rsvd21")
    1522                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd21")
    1523                      .dwattr $C$DW$95, DW_AT_bit_offset(0x09)
    1524                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1525                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1526                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1527              
    1528              $C$DW$96        .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1530                      .dwattr $C$DW$96, DW_AT_name("rsvd22")
    1531                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd22")
    1532                      .dwattr $C$DW$96, DW_AT_bit_offset(0x08)
    1533                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1534                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1535                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1536              
    1537              $C$DW$97        .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1539                      .dwattr $C$DW$97, DW_AT_name("rsvd23")
    1540                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd23")
    1541                      .dwattr $C$DW$97, DW_AT_bit_offset(0x07)
    1542                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1543                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1544                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1545              
    1546              $C$DW$98        .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1548                      .dwattr $C$DW$98, DW_AT_name("rsvd24")
    1549                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd24")
    1550                      .dwattr $C$DW$98, DW_AT_bit_offset(0x06)
    1551                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1552                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1553                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   30

    1554              
    1555              $C$DW$99        .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$99, DW_AT_name("rsvd25")
    1558                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd25")
    1559                      .dwattr $C$DW$99, DW_AT_bit_offset(0x05)
    1560                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1561                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1562                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$100       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$100, DW_AT_name("rsvd26")
    1567                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd26")
    1568                      .dwattr $C$DW$100, DW_AT_bit_offset(0x04)
    1569                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1570                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1571                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$101       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$101, DW_AT_name("rsvd27")
    1576                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd27")
    1577                      .dwattr $C$DW$101, DW_AT_bit_offset(0x03)
    1578                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1579                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1580                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582              $C$DW$102       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$102, DW_AT_name("rsvd28")
    1585                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd28")
    1586                      .dwattr $C$DW$102, DW_AT_bit_offset(0x02)
    1587                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1589                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$103       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$103, DW_AT_name("rsvd29")
    1594                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd29")
    1595                      .dwattr $C$DW$103, DW_AT_bit_offset(0x01)
    1596                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1597                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1598                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$104       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$104, DW_AT_name("rsvd30")
    1603                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd30")
    1604                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1605                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1607                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1608              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   31

    1609                      .dwendtag $C$DW$T$20
    1610              
    1611              
    1612              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1613                      .dwattr $C$DW$T$22, DW_AT_name("GPAAMSEL_REG")
    1614                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1615              $C$DW$105       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$21)
    1617                      .dwattr $C$DW$105, DW_AT_name("all")
    1618                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_all")
    1619                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1620                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1621              
    1622              $C$DW$106       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1624                      .dwattr $C$DW$106, DW_AT_name("bit")
    1625                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_bit")
    1626                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1628              
    1629                      .dwendtag $C$DW$T$22
    1630              
    1631              
    1632              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1633                      .dwattr $C$DW$T$23, DW_AT_name("GPACLEAR_BITS")
    1634                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1635              $C$DW$107       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1637                      .dwattr $C$DW$107, DW_AT_name("GPIO0")
    1638                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO0")
    1639                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0f)
    1640                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644              $C$DW$108       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$108, DW_AT_name("GPIO1")
    1647                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO1")
    1648                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0e)
    1649                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1650                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$109       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$109, DW_AT_name("GPIO2")
    1656                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO2")
    1657                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0d)
    1658                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1659                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$110       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   32

    1664                      .dwattr $C$DW$110, DW_AT_name("GPIO3")
    1665                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO3")
    1666                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0c)
    1667                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1668                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671              $C$DW$111       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$111, DW_AT_name("GPIO4")
    1674                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO4")
    1675                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0b)
    1676                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1677                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1679              
    1680              $C$DW$112       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1682                      .dwattr $C$DW$112, DW_AT_name("GPIO5")
    1683                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO5")
    1684                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0a)
    1685                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1686                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$113       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1691                      .dwattr $C$DW$113, DW_AT_name("GPIO6")
    1692                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO6")
    1693                      .dwattr $C$DW$113, DW_AT_bit_offset(0x09)
    1694                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1695                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1697              
    1698              $C$DW$114       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1700                      .dwattr $C$DW$114, DW_AT_name("GPIO7")
    1701                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO7")
    1702                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08)
    1703                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1704                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1706              
    1707              $C$DW$115       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1709                      .dwattr $C$DW$115, DW_AT_name("GPIO8")
    1710                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO8")
    1711                      .dwattr $C$DW$115, DW_AT_bit_offset(0x07)
    1712                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1713                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716              $C$DW$116       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$116, DW_AT_name("GPIO9")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   33

    1719                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO9")
    1720                      .dwattr $C$DW$116, DW_AT_bit_offset(0x06)
    1721                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1722                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1724              
    1725              $C$DW$117       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$117, DW_AT_name("GPIO10")
    1728                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO10")
    1729                      .dwattr $C$DW$117, DW_AT_bit_offset(0x05)
    1730                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1731                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1733              
    1734              $C$DW$118       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1736                      .dwattr $C$DW$118, DW_AT_name("GPIO11")
    1737                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO11")
    1738                      .dwattr $C$DW$118, DW_AT_bit_offset(0x04)
    1739                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1740                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1742              
    1743              $C$DW$119       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$119, DW_AT_name("GPIO12")
    1746                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO12")
    1747                      .dwattr $C$DW$119, DW_AT_bit_offset(0x03)
    1748                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$120       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$120, DW_AT_name("GPIO13")
    1755                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO13")
    1756                      .dwattr $C$DW$120, DW_AT_bit_offset(0x02)
    1757                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1758                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1759                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761              $C$DW$121       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$121, DW_AT_name("GPIO14")
    1764                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO14")
    1765                      .dwattr $C$DW$121, DW_AT_bit_offset(0x01)
    1766                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1767                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1769              
    1770              $C$DW$122       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$122, DW_AT_name("GPIO15")
    1773                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO15")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   34

    1774                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    1775                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1776                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$123       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$123, DW_AT_name("GPIO16")
    1782                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO16")
    1783                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0f)
    1784                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1785                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1786                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$124       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$124, DW_AT_name("GPIO17")
    1791                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO17")
    1792                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e)
    1793                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1794                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1795                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797              $C$DW$125       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1799                      .dwattr $C$DW$125, DW_AT_name("GPIO18")
    1800                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO18")
    1801                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0d)
    1802                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1803                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1804                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1805              
    1806              $C$DW$126       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1808                      .dwattr $C$DW$126, DW_AT_name("GPIO19")
    1809                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO19")
    1810                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0c)
    1811                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1812                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1813                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1814              
    1815              $C$DW$127       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$127, DW_AT_name("GPIO20")
    1818                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO20")
    1819                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0b)
    1820                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1821                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1822                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1823              
    1824              $C$DW$128       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1826                      .dwattr $C$DW$128, DW_AT_name("GPIO21")
    1827                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO21")
    1828                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   35

    1829                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1830                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1831                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1832              
    1833              $C$DW$129       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1835                      .dwattr $C$DW$129, DW_AT_name("GPIO22")
    1836                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO22")
    1837                      .dwattr $C$DW$129, DW_AT_bit_offset(0x09)
    1838                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1839                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1840                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1841              
    1842              $C$DW$130       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$130, DW_AT_name("GPIO23")
    1845                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO23")
    1846                      .dwattr $C$DW$130, DW_AT_bit_offset(0x08)
    1847                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1848                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1849                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$131       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$131, DW_AT_name("GPIO24")
    1854                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO24")
    1855                      .dwattr $C$DW$131, DW_AT_bit_offset(0x07)
    1856                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1857                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1858                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$132       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1862                      .dwattr $C$DW$132, DW_AT_name("GPIO25")
    1863                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO25")
    1864                      .dwattr $C$DW$132, DW_AT_bit_offset(0x06)
    1865                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1866                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1867                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1868              
    1869              $C$DW$133       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1871                      .dwattr $C$DW$133, DW_AT_name("GPIO26")
    1872                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO26")
    1873                      .dwattr $C$DW$133, DW_AT_bit_offset(0x05)
    1874                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1875                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1876                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1877              
    1878              $C$DW$134       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1880                      .dwattr $C$DW$134, DW_AT_name("GPIO27")
    1881                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO27")
    1882                      .dwattr $C$DW$134, DW_AT_bit_offset(0x04)
    1883                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   36

    1884                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1885                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1886              
    1887              $C$DW$135       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1889                      .dwattr $C$DW$135, DW_AT_name("GPIO28")
    1890                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO28")
    1891                      .dwattr $C$DW$135, DW_AT_bit_offset(0x03)
    1892                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1893                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1894                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1895              
    1896              $C$DW$136       .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1898                      .dwattr $C$DW$136, DW_AT_name("GPIO29")
    1899                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO29")
    1900                      .dwattr $C$DW$136, DW_AT_bit_offset(0x02)
    1901                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1902                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1903                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1904              
    1905              $C$DW$137       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1907                      .dwattr $C$DW$137, DW_AT_name("GPIO30")
    1908                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO30")
    1909                      .dwattr $C$DW$137, DW_AT_bit_offset(0x01)
    1910                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1911                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1912                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1913              
    1914              $C$DW$138       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1916                      .dwattr $C$DW$138, DW_AT_name("GPIO31")
    1917                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO31")
    1918                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    1919                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1920                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1921                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1922              
    1923                      .dwendtag $C$DW$T$23
    1924              
    1925              
    1926              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1927                      .dwattr $C$DW$T$24, DW_AT_name("GPACLEAR_REG")
    1928                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1929              $C$DW$139       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    1931                      .dwattr $C$DW$139, DW_AT_name("all")
    1932                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_all")
    1933                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1935              
    1936              $C$DW$140       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$23)
    1938                      .dwattr $C$DW$140, DW_AT_name("bit")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   37

    1939                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_bit")
    1940                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1941                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1942              
    1943                      .dwendtag $C$DW$T$24
    1944              
    1945              
    1946              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1947                      .dwattr $C$DW$T$25, DW_AT_name("GPACR_BITS")
    1948                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1949              $C$DW$141       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1951                      .dwattr $C$DW$141, DW_AT_name("GPIO0")
    1952                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO0")
    1953                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0f)
    1954                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1955                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1957              
    1958              $C$DW$142       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$142, DW_AT_name("GPIO1")
    1961                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO1")
    1962                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0e)
    1963                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1964                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967              $C$DW$143       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$143, DW_AT_name("GPIO2")
    1970                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO2")
    1971                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0d)
    1972                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1973                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1974                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1975              
    1976              $C$DW$144       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$144, DW_AT_name("GPIO3")
    1979                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO3")
    1980                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0c)
    1981                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1982                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$145       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$145, DW_AT_name("GPIO4")
    1988                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO4")
    1989                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0b)
    1990                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1991                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1993              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   38

    1994              $C$DW$146       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1996                      .dwattr $C$DW$146, DW_AT_name("GPIO5")
    1997                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO5")
    1998                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0a)
    1999                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2000                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003              $C$DW$147       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$147, DW_AT_name("GPIO6")
    2006                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO6")
    2007                      .dwattr $C$DW$147, DW_AT_bit_offset(0x09)
    2008                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2009                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$148       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2014                      .dwattr $C$DW$148, DW_AT_name("GPIO7")
    2015                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO7")
    2016                      .dwattr $C$DW$148, DW_AT_bit_offset(0x08)
    2017                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2018                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$149       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2023                      .dwattr $C$DW$149, DW_AT_name("GPIO8")
    2024                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO8")
    2025                      .dwattr $C$DW$149, DW_AT_bit_offset(0x07)
    2026                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2027                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2029              
    2030              $C$DW$150       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$150, DW_AT_name("GPIO9")
    2033                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO9")
    2034                      .dwattr $C$DW$150, DW_AT_bit_offset(0x06)
    2035                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2036                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2038              
    2039              $C$DW$151       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2041                      .dwattr $C$DW$151, DW_AT_name("GPIO10")
    2042                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO10")
    2043                      .dwattr $C$DW$151, DW_AT_bit_offset(0x05)
    2044                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2045                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2047              
    2048              $C$DW$152       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   39

    2049                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2050                      .dwattr $C$DW$152, DW_AT_name("GPIO11")
    2051                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO11")
    2052                      .dwattr $C$DW$152, DW_AT_bit_offset(0x04)
    2053                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2054                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2056              
    2057              $C$DW$153       .dwtag  DW_TAG_member
    2058                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2059                      .dwattr $C$DW$153, DW_AT_name("GPIO12")
    2060                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO12")
    2061                      .dwattr $C$DW$153, DW_AT_bit_offset(0x03)
    2062                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2063                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2064                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2065              
    2066              $C$DW$154       .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2068                      .dwattr $C$DW$154, DW_AT_name("GPIO13")
    2069                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO13")
    2070                      .dwattr $C$DW$154, DW_AT_bit_offset(0x02)
    2071                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2072                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2074              
    2075              $C$DW$155       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2077                      .dwattr $C$DW$155, DW_AT_name("GPIO14")
    2078                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO14")
    2079                      .dwattr $C$DW$155, DW_AT_bit_offset(0x01)
    2080                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2081                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2083              
    2084              $C$DW$156       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$156, DW_AT_name("GPIO15")
    2087                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO15")
    2088                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    2089                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2090                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2091                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2092              
    2093              $C$DW$157       .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2095                      .dwattr $C$DW$157, DW_AT_name("GPIO16")
    2096                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO16")
    2097                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0f)
    2098                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2099                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2100                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2101              
    2102              $C$DW$158       .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   40

    2104                      .dwattr $C$DW$158, DW_AT_name("GPIO17")
    2105                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO17")
    2106                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e)
    2107                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2108                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2109                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2110              
    2111              $C$DW$159       .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2113                      .dwattr $C$DW$159, DW_AT_name("GPIO18")
    2114                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO18")
    2115                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0d)
    2116                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2117                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2118                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2119              
    2120              $C$DW$160       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2122                      .dwattr $C$DW$160, DW_AT_name("GPIO19")
    2123                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO19")
    2124                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0c)
    2125                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2126                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2127                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129              $C$DW$161       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$161, DW_AT_name("GPIO20")
    2132                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO20")
    2133                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0b)
    2134                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2135                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2136                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2137              
    2138              $C$DW$162       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2140                      .dwattr $C$DW$162, DW_AT_name("GPIO21")
    2141                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO21")
    2142                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0a)
    2143                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2144                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2145                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2146              
    2147              $C$DW$163       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2149                      .dwattr $C$DW$163, DW_AT_name("GPIO22")
    2150                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO22")
    2151                      .dwattr $C$DW$163, DW_AT_bit_offset(0x09)
    2152                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2153                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2154                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2155              
    2156              $C$DW$164       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2158                      .dwattr $C$DW$164, DW_AT_name("GPIO23")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   41

    2159                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO23")
    2160                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08)
    2161                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2162                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2163                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2164              
    2165              $C$DW$165       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2167                      .dwattr $C$DW$165, DW_AT_name("GPIO24")
    2168                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO24")
    2169                      .dwattr $C$DW$165, DW_AT_bit_offset(0x07)
    2170                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2171                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2172                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2173              
    2174              $C$DW$166       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2176                      .dwattr $C$DW$166, DW_AT_name("GPIO25")
    2177                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO25")
    2178                      .dwattr $C$DW$166, DW_AT_bit_offset(0x06)
    2179                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2180                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2181                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2182              
    2183              $C$DW$167       .dwtag  DW_TAG_member
    2184                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2185                      .dwattr $C$DW$167, DW_AT_name("GPIO26")
    2186                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO26")
    2187                      .dwattr $C$DW$167, DW_AT_bit_offset(0x05)
    2188                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2189                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2190                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2191              
    2192              $C$DW$168       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2194                      .dwattr $C$DW$168, DW_AT_name("GPIO27")
    2195                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO27")
    2196                      .dwattr $C$DW$168, DW_AT_bit_offset(0x04)
    2197                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2198                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2199                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2200              
    2201              $C$DW$169       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2203                      .dwattr $C$DW$169, DW_AT_name("GPIO28")
    2204                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO28")
    2205                      .dwattr $C$DW$169, DW_AT_bit_offset(0x03)
    2206                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2207                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2208                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2209              
    2210              $C$DW$170       .dwtag  DW_TAG_member
    2211                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2212                      .dwattr $C$DW$170, DW_AT_name("GPIO29")
    2213                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO29")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   42

    2214                      .dwattr $C$DW$170, DW_AT_bit_offset(0x02)
    2215                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2216                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2217                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2218              
    2219              $C$DW$171       .dwtag  DW_TAG_member
    2220                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2221                      .dwattr $C$DW$171, DW_AT_name("GPIO30")
    2222                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO30")
    2223                      .dwattr $C$DW$171, DW_AT_bit_offset(0x01)
    2224                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2225                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2226                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2227              
    2228              $C$DW$172       .dwtag  DW_TAG_member
    2229                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2230                      .dwattr $C$DW$172, DW_AT_name("GPIO31")
    2231                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO31")
    2232                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00)
    2233                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2234                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2235                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2236              
    2237                      .dwendtag $C$DW$T$25
    2238              
    2239              
    2240              $C$DW$T$26      .dwtag  DW_TAG_union_type
    2241                      .dwattr $C$DW$T$26, DW_AT_name("GPACR_REG")
    2242                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2243              $C$DW$173       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    2245                      .dwattr $C$DW$173, DW_AT_name("all")
    2246                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_all")
    2247                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2249              
    2250              $C$DW$174       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$25)
    2252                      .dwattr $C$DW$174, DW_AT_name("bit")
    2253                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_bit")
    2254                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2256              
    2257                      .dwendtag $C$DW$T$26
    2258              
    2259              
    2260              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2261                      .dwattr $C$DW$T$27, DW_AT_name("GPACSEL1_BITS")
    2262                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    2263              $C$DW$175       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2265                      .dwattr $C$DW$175, DW_AT_name("GPIO0")
    2266                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO0")
    2267                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0c)
    2268                      .dwattr $C$DW$175, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   43

    2269                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2270                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2271              
    2272              $C$DW$176       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2274                      .dwattr $C$DW$176, DW_AT_name("GPIO1")
    2275                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIO1")
    2276                      .dwattr $C$DW$176, DW_AT_bit_offset(0x08)
    2277                      .dwattr $C$DW$176, DW_AT_bit_size(0x04)
    2278                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2279                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2280              
    2281              $C$DW$177       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2283                      .dwattr $C$DW$177, DW_AT_name("GPIO2")
    2284                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO2")
    2285                      .dwattr $C$DW$177, DW_AT_bit_offset(0x04)
    2286                      .dwattr $C$DW$177, DW_AT_bit_size(0x04)
    2287                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2288                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2289              
    2290              $C$DW$178       .dwtag  DW_TAG_member
    2291                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2292                      .dwattr $C$DW$178, DW_AT_name("GPIO3")
    2293                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO3")
    2294                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00)
    2295                      .dwattr $C$DW$178, DW_AT_bit_size(0x04)
    2296                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2297                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2298              
    2299              $C$DW$179       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2301                      .dwattr $C$DW$179, DW_AT_name("GPIO4")
    2302                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO4")
    2303                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0c)
    2304                      .dwattr $C$DW$179, DW_AT_bit_size(0x04)
    2305                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2306                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2307              
    2308              $C$DW$180       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2310                      .dwattr $C$DW$180, DW_AT_name("GPIO5")
    2311                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO5")
    2312                      .dwattr $C$DW$180, DW_AT_bit_offset(0x08)
    2313                      .dwattr $C$DW$180, DW_AT_bit_size(0x04)
    2314                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2315                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2316              
    2317              $C$DW$181       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2319                      .dwattr $C$DW$181, DW_AT_name("GPIO6")
    2320                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIO6")
    2321                      .dwattr $C$DW$181, DW_AT_bit_offset(0x04)
    2322                      .dwattr $C$DW$181, DW_AT_bit_size(0x04)
    2323                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   44

    2324                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2325              
    2326              $C$DW$182       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2328                      .dwattr $C$DW$182, DW_AT_name("GPIO7")
    2329                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIO7")
    2330                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    2331                      .dwattr $C$DW$182, DW_AT_bit_size(0x04)
    2332                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2333                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2334              
    2335                      .dwendtag $C$DW$T$27
    2336              
    2337              
    2338              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2339                      .dwattr $C$DW$T$28, DW_AT_name("GPACSEL1_REG")
    2340                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2341              $C$DW$183       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    2343                      .dwattr $C$DW$183, DW_AT_name("all")
    2344                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    2345                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2346                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2347              
    2348              $C$DW$184       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$27)
    2350                      .dwattr $C$DW$184, DW_AT_name("bit")
    2351                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    2352                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2353                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2354              
    2355                      .dwendtag $C$DW$T$28
    2356              
    2357              
    2358              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2359                      .dwattr $C$DW$T$29, DW_AT_name("GPACSEL2_BITS")
    2360                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2361              $C$DW$185       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2363                      .dwattr $C$DW$185, DW_AT_name("GPIO8")
    2364                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIO8")
    2365                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0c)
    2366                      .dwattr $C$DW$185, DW_AT_bit_size(0x04)
    2367                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2368                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2369              
    2370              $C$DW$186       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2372                      .dwattr $C$DW$186, DW_AT_name("GPIO9")
    2373                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIO9")
    2374                      .dwattr $C$DW$186, DW_AT_bit_offset(0x08)
    2375                      .dwattr $C$DW$186, DW_AT_bit_size(0x04)
    2376                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2378              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   45

    2379              $C$DW$187       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2381                      .dwattr $C$DW$187, DW_AT_name("GPIO10")
    2382                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GPIO10")
    2383                      .dwattr $C$DW$187, DW_AT_bit_offset(0x04)
    2384                      .dwattr $C$DW$187, DW_AT_bit_size(0x04)
    2385                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2387              
    2388              $C$DW$188       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2390                      .dwattr $C$DW$188, DW_AT_name("GPIO11")
    2391                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GPIO11")
    2392                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    2393                      .dwattr $C$DW$188, DW_AT_bit_size(0x04)
    2394                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2395                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2396              
    2397              $C$DW$189       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2399                      .dwattr $C$DW$189, DW_AT_name("GPIO12")
    2400                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GPIO12")
    2401                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0c)
    2402                      .dwattr $C$DW$189, DW_AT_bit_size(0x04)
    2403                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2404                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2405              
    2406              $C$DW$190       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2408                      .dwattr $C$DW$190, DW_AT_name("GPIO13")
    2409                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GPIO13")
    2410                      .dwattr $C$DW$190, DW_AT_bit_offset(0x08)
    2411                      .dwattr $C$DW$190, DW_AT_bit_size(0x04)
    2412                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2413                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2414              
    2415              $C$DW$191       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2417                      .dwattr $C$DW$191, DW_AT_name("GPIO14")
    2418                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIO14")
    2419                      .dwattr $C$DW$191, DW_AT_bit_offset(0x04)
    2420                      .dwattr $C$DW$191, DW_AT_bit_size(0x04)
    2421                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2422                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2423              
    2424              $C$DW$192       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2426                      .dwattr $C$DW$192, DW_AT_name("GPIO15")
    2427                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPIO15")
    2428                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    2429                      .dwattr $C$DW$192, DW_AT_bit_size(0x04)
    2430                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2431                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2432              
    2433                      .dwendtag $C$DW$T$29
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   46

    2434              
    2435              
    2436              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2437                      .dwattr $C$DW$T$30, DW_AT_name("GPACSEL2_REG")
    2438                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2439              $C$DW$193       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$21)
    2441                      .dwattr $C$DW$193, DW_AT_name("all")
    2442                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_all")
    2443                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2444                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2445              
    2446              $C$DW$194       .dwtag  DW_TAG_member
    2447                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$29)
    2448                      .dwattr $C$DW$194, DW_AT_name("bit")
    2449                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_bit")
    2450                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2451                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2452              
    2453                      .dwendtag $C$DW$T$30
    2454              
    2455              
    2456              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2457                      .dwattr $C$DW$T$31, DW_AT_name("GPACSEL3_BITS")
    2458                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2459              $C$DW$195       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2461                      .dwattr $C$DW$195, DW_AT_name("GPIO16")
    2462                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPIO16")
    2463                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0c)
    2464                      .dwattr $C$DW$195, DW_AT_bit_size(0x04)
    2465                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2466                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2467              
    2468              $C$DW$196       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2470                      .dwattr $C$DW$196, DW_AT_name("GPIO17")
    2471                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIO17")
    2472                      .dwattr $C$DW$196, DW_AT_bit_offset(0x08)
    2473                      .dwattr $C$DW$196, DW_AT_bit_size(0x04)
    2474                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2475                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2476              
    2477              $C$DW$197       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2479                      .dwattr $C$DW$197, DW_AT_name("GPIO18")
    2480                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIO18")
    2481                      .dwattr $C$DW$197, DW_AT_bit_offset(0x04)
    2482                      .dwattr $C$DW$197, DW_AT_bit_size(0x04)
    2483                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2484                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2485              
    2486              $C$DW$198       .dwtag  DW_TAG_member
    2487                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2488                      .dwattr $C$DW$198, DW_AT_name("GPIO19")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   47

    2489                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GPIO19")
    2490                      .dwattr $C$DW$198, DW_AT_bit_offset(0x00)
    2491                      .dwattr $C$DW$198, DW_AT_bit_size(0x04)
    2492                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2493                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2494              
    2495              $C$DW$199       .dwtag  DW_TAG_member
    2496                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2497                      .dwattr $C$DW$199, DW_AT_name("GPIO20")
    2498                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPIO20")
    2499                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0c)
    2500                      .dwattr $C$DW$199, DW_AT_bit_size(0x04)
    2501                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2502                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2503              
    2504              $C$DW$200       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2506                      .dwattr $C$DW$200, DW_AT_name("GPIO21")
    2507                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPIO21")
    2508                      .dwattr $C$DW$200, DW_AT_bit_offset(0x08)
    2509                      .dwattr $C$DW$200, DW_AT_bit_size(0x04)
    2510                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2511                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2512              
    2513              $C$DW$201       .dwtag  DW_TAG_member
    2514                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2515                      .dwattr $C$DW$201, DW_AT_name("GPIO22")
    2516                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_GPIO22")
    2517                      .dwattr $C$DW$201, DW_AT_bit_offset(0x04)
    2518                      .dwattr $C$DW$201, DW_AT_bit_size(0x04)
    2519                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2520                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2521              
    2522              $C$DW$202       .dwtag  DW_TAG_member
    2523                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2524                      .dwattr $C$DW$202, DW_AT_name("GPIO23")
    2525                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPIO23")
    2526                      .dwattr $C$DW$202, DW_AT_bit_offset(0x00)
    2527                      .dwattr $C$DW$202, DW_AT_bit_size(0x04)
    2528                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2529                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2530              
    2531                      .dwendtag $C$DW$T$31
    2532              
    2533              
    2534              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2535                      .dwattr $C$DW$T$32, DW_AT_name("GPACSEL3_REG")
    2536                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2537              $C$DW$203       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    2539                      .dwattr $C$DW$203, DW_AT_name("all")
    2540                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_all")
    2541                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2543              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{45823D24-0CE8-4078-A7E7-91C86E509358} PAGE   48

    2544              $C$DW$204       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$31)
    2546                      .dwattr $C$DW$204, DW_AT_name("bit")
    2547                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_bit")
    2548                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2549                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2550              
    2551                      .dwendtag $C$DW$T$32
    2552              
    2553              
    2554              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2555                      .dwattr $C$DW$T$33, DW_AT_name("GPACSEL4_BITS")
    2556                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2557              $C$DW$205       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2559                      .dwattr $C$DW$205, DW_AT_name("GPIO24")
    2560                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_GPIO24")
    2561                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0c)
    2562                      .dwattr $C$DW$205, DW_AT_bit_size(0x04)
    2563                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2564                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2565              
    2566              $C$DW$206       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2568                      .dwattr $C$DW$206, DW_AT_name("GPIO25")
    2569                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPIO25")
    2570                      .dwattr $C$DW$206, DW_AT_bit_offset(0x08)
    2571                      .dwattr $C$DW$206, DW_AT_bit_size(0x04)
    2572                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2573                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2574              
    2575              $C$DW$207       .dwtag  DW_TAG_member
    2576                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
