TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DeviceSupport/source/f28003x_dma.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__eallow")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___eallow")

C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   87

    4555                      .dwattr $C$DW$363, DW_AT_location[DW_OP_reg12]
    4556              
    4557              $C$DW$364       .dwtag  DW_TAG_formal_parameter
    4558                      .dwattr $C$DW$364, DW_AT_name("DMA_Source")
    4559                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_DMA_Source")
    4560                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$131)
    4561                      .dwattr $C$DW$364, DW_AT_location[DW_OP_reg14]
    4562              
    4563              
    4564              ;***************************************************************
    4565              ;* FNAME: _DMACH1AddrConfig             FR SIZE:   0           *
    4566              ;*                                                             *
    4567              ;* FUNCTION ENVIRONMENT                                        *
    4568              ;*                                                             *
    4569              ;* FUNCTION PROPERTIES                                         *
    4570              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    4571              ;***************************************************************
    4572              
    4573              _DMACH1AddrConfig:
    4574              ;* AR4   assigned to _DMA_Dest
    4575              $C$DW$365       .dwtag  DW_TAG_variable
    4576                      .dwattr $C$DW$365, DW_AT_name("DMA_Dest")
    4577                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_DMA_Dest")
    4578                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$143)
    4579                      .dwattr $C$DW$365, DW_AT_location[DW_OP_reg12]
    4580              
    4581              ;* AR5   assigned to _DMA_Source
    4582              $C$DW$366       .dwtag  DW_TAG_variable
    4583                      .dwattr $C$DW$366, DW_AT_name("DMA_Source")
    4584                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_DMA_Source")
    4585                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$143)
    4586                      .dwattr $C$DW$366, DW_AT_location[DW_OP_reg14]
    4587              
    4588                      .dwcfi  cfa_offset, -2
    4589                      .dwcfi  save_reg_to_mem, 26, 0
    4590                      .dwpsn  file "../DeviceSupport/source/f28003x_dma.c",line 75,column 5,is_stmt,isa 0
    4591 00000000 7622          EALLOW    ; [CPU_ALU] |75| 
    4592 00000001 761F!         MOVW      DP,#_DmaRegs+48       ; [CPU_ARAU] 
         00000002 0000 
    4593                      .dwpsn  file "../DeviceSupport/source/f28003x_dma.c",line 80,column 5,is_stmt,isa 0
    4594 00000003 A030!         MOVL      @$BLOCKED(_DmaRegs)+48,XAR5 ; [CPU_ALU] |80| 
    4595                      .dwpsn  file "../DeviceSupport/source/f28003x_dma.c",line 83,column 5,is_stmt,isa 0
    4596 00000004 A032!         MOVL      @$BLOCKED(_DmaRegs)+50,XAR5 ; [CPU_ALU] |83| 
    4597                      .dwpsn  file "../DeviceSupport/source/f28003x_dma.c",line 88,column 5,is_stmt,isa 0
    4598 00000005 A838!         MOVL      @$BLOCKED(_DmaRegs)+56,XAR4 ; [CPU_ALU] |88| 
    4599                      .dwpsn  file "../DeviceSupport/source/f28003x_dma.c",line 91,column 5,is_stmt,isa 0
    4600 00000006 A83A!         MOVL      @$BLOCKED(_DmaRegs)+58,XAR4 ; [CPU_ALU] |91| 
    4601                      .dwpsn  file "../DeviceSupport/source/f28003x_dma.c",line 93,column 5,is_stmt,isa 0
    4602 00000007 761A          EDIS      ; [CPU_ALU] |93| 
    4603              $C$DW$367       .dwtag  DW_TAG_TI_branch
    4604                      .dwattr $C$DW$367, DW_AT_low_pc(0x00)
    4605                      .dwattr $C$DW$367, DW_AT_TI_return
    4606              
    4607 00000008 0006          LRETR     ; [CPU_ALU] 
    4608                      ; return occurs ; [] 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   88

    4609                      .dwattr $C$DW$362, DW_AT_TI_end_file("../DeviceSupport/source/f28003x_dma.c")
    4610                      .dwattr $C$DW$362, DW_AT_TI_end_line(0x5e)
    4611                      .dwattr $C$DW$362, DW_AT_TI_end_column(0x01)
    4612                      .dwendentry
    4613                      .dwendtag $C$DW$362
    4614              
    4615              ;**************************************************************
    4616              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4617              ;**************************************************************
    4618                      .global _PieCtrlRegs
    4619                      .global _DmaClaSrcSelRegs
    4620                      .global _DmaRegs
    4621              
    4622              ;***************************************************************
    4623              ;* TYPE INFORMATION                                            *
    4624              ;***************************************************************
    4625              
    4626              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4627                      .dwattr $C$DW$T$20, DW_AT_name("BURST_COUNT_BITS")
    4628                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    4629              $C$DW$368       .dwtag  DW_TAG_member
    4630                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    4631                      .dwattr $C$DW$368, DW_AT_name("BURSTCOUNT")
    4632                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_BURSTCOUNT")
    4633                      .dwattr $C$DW$368, DW_AT_bit_offset(0x0b)
    4634                      .dwattr $C$DW$368, DW_AT_bit_size(0x05)
    4635                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4636                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4637              
    4638              $C$DW$369       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    4640                      .dwattr $C$DW$369, DW_AT_name("rsvd1")
    4641                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd1")
    4642                      .dwattr $C$DW$369, DW_AT_bit_offset(0x00)
    4643                      .dwattr $C$DW$369, DW_AT_bit_size(0x0b)
    4644                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4645                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4646              
    4647                      .dwendtag $C$DW$T$20
    4648              
    4649              
    4650              $C$DW$T$21      .dwtag  DW_TAG_union_type
    4651                      .dwattr $C$DW$T$21, DW_AT_name("BURST_COUNT_REG")
    4652                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    4653              $C$DW$370       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    4655                      .dwattr $C$DW$370, DW_AT_name("all")
    4656                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_all")
    4657                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4658                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4659              
    4660              $C$DW$371       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    4662                      .dwattr $C$DW$371, DW_AT_name("bit")
    4663                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   89

    4664                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4665                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4666              
    4667                      .dwendtag $C$DW$T$21
    4668              
    4669              
    4670              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4671                      .dwattr $C$DW$T$22, DW_AT_name("BURST_SIZE_BITS")
    4672                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    4673              $C$DW$372       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    4675                      .dwattr $C$DW$372, DW_AT_name("BURSTSIZE")
    4676                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_BURSTSIZE")
    4677                      .dwattr $C$DW$372, DW_AT_bit_offset(0x0b)
    4678                      .dwattr $C$DW$372, DW_AT_bit_size(0x05)
    4679                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4680                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4681              
    4682              $C$DW$373       .dwtag  DW_TAG_member
    4683                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
    4684                      .dwattr $C$DW$373, DW_AT_name("rsvd1")
    4685                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd1")
    4686                      .dwattr $C$DW$373, DW_AT_bit_offset(0x00)
    4687                      .dwattr $C$DW$373, DW_AT_bit_size(0x0b)
    4688                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4689                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4690              
    4691                      .dwendtag $C$DW$T$22
    4692              
    4693              
    4694              $C$DW$T$23      .dwtag  DW_TAG_union_type
    4695                      .dwattr $C$DW$T$23, DW_AT_name("BURST_SIZE_REG")
    4696                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    4697              $C$DW$374       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    4699                      .dwattr $C$DW$374, DW_AT_name("all")
    4700                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_all")
    4701                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4702                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4703              
    4704              $C$DW$375       .dwtag  DW_TAG_member
    4705                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$22)
    4706                      .dwattr $C$DW$375, DW_AT_name("bit")
    4707                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_bit")
    4708                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4709                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4710              
    4711                      .dwendtag $C$DW$T$23
    4712              
    4713              
    4714              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4715                      .dwattr $C$DW$T$26, DW_AT_name("CH_REGS")
    4716                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
    4717              $C$DW$376       .dwtag  DW_TAG_member
    4718                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   90

    4719                      .dwattr $C$DW$376, DW_AT_name("MODE")
    4720                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_MODE")
    4721                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4722                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4723              
    4724              $C$DW$377       .dwtag  DW_TAG_member
    4725                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$34)
    4726                      .dwattr $C$DW$377, DW_AT_name("CONTROL")
    4727                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_CONTROL")
    4728                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4729                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4730              
    4731              $C$DW$378       .dwtag  DW_TAG_member
    4732                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    4733                      .dwattr $C$DW$378, DW_AT_name("BURST_SIZE")
    4734                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_BURST_SIZE")
    4735                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4736                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4737              
    4738              $C$DW$379       .dwtag  DW_TAG_member
    4739                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$21)
    4740                      .dwattr $C$DW$379, DW_AT_name("BURST_COUNT")
    4741                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_BURST_COUNT")
    4742                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4743                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4744              
    4745              $C$DW$380       .dwtag  DW_TAG_member
    4746                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$24)
    4747                      .dwattr $C$DW$380, DW_AT_name("SRC_BURST_STEP")
    4748                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_SRC_BURST_STEP")
    4749                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4750                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4751              
    4752              $C$DW$381       .dwtag  DW_TAG_member
    4753                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$24)
    4754                      .dwattr $C$DW$381, DW_AT_name("DST_BURST_STEP")
    4755                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_DST_BURST_STEP")
    4756                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4757                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4758              
    4759              $C$DW$382       .dwtag  DW_TAG_member
    4760                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    4761                      .dwattr $C$DW$382, DW_AT_name("TRANSFER_SIZE")
    4762                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_TRANSFER_SIZE")
    4763                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4764                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4765              
    4766              $C$DW$383       .dwtag  DW_TAG_member
    4767                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    4768                      .dwattr $C$DW$383, DW_AT_name("TRANSFER_COUNT")
    4769                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_TRANSFER_COUNT")
    4770                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4771                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4772              
    4773              $C$DW$384       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   91

    4774                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$24)
    4775                      .dwattr $C$DW$384, DW_AT_name("SRC_TRANSFER_STEP")
    4776                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_SRC_TRANSFER_STEP")
    4777                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4778                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4779              
    4780              $C$DW$385       .dwtag  DW_TAG_member
    4781                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$24)
    4782                      .dwattr $C$DW$385, DW_AT_name("DST_TRANSFER_STEP")
    4783                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_DST_TRANSFER_STEP")
    4784                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4785                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4786              
    4787              $C$DW$386       .dwtag  DW_TAG_member
    4788                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    4789                      .dwattr $C$DW$386, DW_AT_name("SRC_WRAP_SIZE")
    4790                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_SRC_WRAP_SIZE")
    4791                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4792                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4793              
    4794              $C$DW$387       .dwtag  DW_TAG_member
    4795                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    4796                      .dwattr $C$DW$387, DW_AT_name("SRC_WRAP_COUNT")
    4797                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_SRC_WRAP_COUNT")
    4798                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4799                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4800              
    4801              $C$DW$388       .dwtag  DW_TAG_member
    4802                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$24)
    4803                      .dwattr $C$DW$388, DW_AT_name("SRC_WRAP_STEP")
    4804                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_SRC_WRAP_STEP")
    4805                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4806                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4807              
    4808              $C$DW$389       .dwtag  DW_TAG_member
    4809                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    4810                      .dwattr $C$DW$389, DW_AT_name("DST_WRAP_SIZE")
    4811                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_DST_WRAP_SIZE")
    4812                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4813                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4814              
    4815              $C$DW$390       .dwtag  DW_TAG_member
    4816                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
    4817                      .dwattr $C$DW$390, DW_AT_name("DST_WRAP_COUNT")
    4818                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_DST_WRAP_COUNT")
    4819                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4820                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4821              
    4822              $C$DW$391       .dwtag  DW_TAG_member
    4823                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$24)
    4824                      .dwattr $C$DW$391, DW_AT_name("DST_WRAP_STEP")
    4825                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_DST_WRAP_STEP")
    4826                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4827                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4828              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   92

    4829              $C$DW$392       .dwtag  DW_TAG_member
    4830                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$25)
    4831                      .dwattr $C$DW$392, DW_AT_name("SRC_BEG_ADDR_SHADOW")
    4832                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_SRC_BEG_ADDR_SHADOW")
    4833                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4834                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4835              
    4836              $C$DW$393       .dwtag  DW_TAG_member
    4837                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$25)
    4838                      .dwattr $C$DW$393, DW_AT_name("SRC_ADDR_SHADOW")
    4839                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_SRC_ADDR_SHADOW")
    4840                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4841                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4842              
    4843              $C$DW$394       .dwtag  DW_TAG_member
    4844                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$25)
    4845                      .dwattr $C$DW$394, DW_AT_name("SRC_BEG_ADDR_ACTIVE")
    4846                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_SRC_BEG_ADDR_ACTIVE")
    4847                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4848                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4849              
    4850              $C$DW$395       .dwtag  DW_TAG_member
    4851                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$25)
    4852                      .dwattr $C$DW$395, DW_AT_name("SRC_ADDR_ACTIVE")
    4853                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_SRC_ADDR_ACTIVE")
    4854                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4855                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4856              
    4857              $C$DW$396       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$25)
    4859                      .dwattr $C$DW$396, DW_AT_name("DST_BEG_ADDR_SHADOW")
    4860                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_DST_BEG_ADDR_SHADOW")
    4861                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4862                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4863              
    4864              $C$DW$397       .dwtag  DW_TAG_member
    4865                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$25)
    4866                      .dwattr $C$DW$397, DW_AT_name("DST_ADDR_SHADOW")
    4867                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_DST_ADDR_SHADOW")
    4868                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4869                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4870              
    4871              $C$DW$398       .dwtag  DW_TAG_member
    4872                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$25)
    4873                      .dwattr $C$DW$398, DW_AT_name("DST_BEG_ADDR_ACTIVE")
    4874                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_DST_BEG_ADDR_ACTIVE")
    4875                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4876                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4877              
    4878              $C$DW$399       .dwtag  DW_TAG_member
    4879                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$25)
    4880                      .dwattr $C$DW$399, DW_AT_name("DST_ADDR_ACTIVE")
    4881                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_DST_ADDR_ACTIVE")
    4882                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4883                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   93

    4884              
    4885                      .dwendtag $C$DW$T$26
    4886              
    4887              
    4888              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4889                      .dwattr $C$DW$T$27, DW_AT_name("CLA1TASKSRCSEL1_BITS")
    4890                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    4891              $C$DW$400       .dwtag  DW_TAG_member
    4892                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    4893                      .dwattr $C$DW$400, DW_AT_name("TASK1")
    4894                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_TASK1")
    4895                      .dwattr $C$DW$400, DW_AT_bit_offset(0x08)
    4896                      .dwattr $C$DW$400, DW_AT_bit_size(0x08)
    4897                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4898                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4899              
    4900              $C$DW$401       .dwtag  DW_TAG_member
    4901                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    4902                      .dwattr $C$DW$401, DW_AT_name("TASK2")
    4903                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_TASK2")
    4904                      .dwattr $C$DW$401, DW_AT_bit_offset(0x00)
    4905                      .dwattr $C$DW$401, DW_AT_bit_size(0x08)
    4906                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4907                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4908              
    4909              $C$DW$402       .dwtag  DW_TAG_member
    4910                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    4911                      .dwattr $C$DW$402, DW_AT_name("TASK3")
    4912                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_TASK3")
    4913                      .dwattr $C$DW$402, DW_AT_bit_offset(0x08)
    4914                      .dwattr $C$DW$402, DW_AT_bit_size(0x08)
    4915                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4916                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4917              
    4918              $C$DW$403       .dwtag  DW_TAG_member
    4919                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    4920                      .dwattr $C$DW$403, DW_AT_name("TASK4")
    4921                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_TASK4")
    4922                      .dwattr $C$DW$403, DW_AT_bit_offset(0x00)
    4923                      .dwattr $C$DW$403, DW_AT_bit_size(0x08)
    4924                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4925                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4926              
    4927                      .dwendtag $C$DW$T$27
    4928              
    4929              
    4930              $C$DW$T$28      .dwtag  DW_TAG_union_type
    4931                      .dwattr $C$DW$T$28, DW_AT_name("CLA1TASKSRCSEL1_REG")
    4932                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    4933              $C$DW$404       .dwtag  DW_TAG_member
    4934                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$25)
    4935                      .dwattr $C$DW$404, DW_AT_name("all")
    4936                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_all")
    4937                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4938                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   94

    4939              
    4940              $C$DW$405       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$27)
    4942                      .dwattr $C$DW$405, DW_AT_name("bit")
    4943                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_bit")
    4944                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4945                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4946              
    4947                      .dwendtag $C$DW$T$28
    4948              
    4949              
    4950              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4951                      .dwattr $C$DW$T$29, DW_AT_name("CLA1TASKSRCSEL2_BITS")
    4952                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    4953              $C$DW$406       .dwtag  DW_TAG_member
    4954                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    4955                      .dwattr $C$DW$406, DW_AT_name("TASK5")
    4956                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_TASK5")
    4957                      .dwattr $C$DW$406, DW_AT_bit_offset(0x08)
    4958                      .dwattr $C$DW$406, DW_AT_bit_size(0x08)
    4959                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4960                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4961              
    4962              $C$DW$407       .dwtag  DW_TAG_member
    4963                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    4964                      .dwattr $C$DW$407, DW_AT_name("TASK6")
    4965                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_TASK6")
    4966                      .dwattr $C$DW$407, DW_AT_bit_offset(0x00)
    4967                      .dwattr $C$DW$407, DW_AT_bit_size(0x08)
    4968                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4969                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4970              
    4971              $C$DW$408       .dwtag  DW_TAG_member
    4972                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    4973                      .dwattr $C$DW$408, DW_AT_name("TASK7")
    4974                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_TASK7")
    4975                      .dwattr $C$DW$408, DW_AT_bit_offset(0x08)
    4976                      .dwattr $C$DW$408, DW_AT_bit_size(0x08)
    4977                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4978                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4979              
    4980              $C$DW$409       .dwtag  DW_TAG_member
    4981                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    4982                      .dwattr $C$DW$409, DW_AT_name("TASK8")
    4983                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_TASK8")
    4984                      .dwattr $C$DW$409, DW_AT_bit_offset(0x00)
    4985                      .dwattr $C$DW$409, DW_AT_bit_size(0x08)
    4986                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4987                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4988              
    4989                      .dwendtag $C$DW$T$29
    4990              
    4991              
    4992              $C$DW$T$30      .dwtag  DW_TAG_union_type
    4993                      .dwattr $C$DW$T$30, DW_AT_name("CLA1TASKSRCSEL2_REG")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   95

    4994                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    4995              $C$DW$410       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$25)
    4997                      .dwattr $C$DW$410, DW_AT_name("all")
    4998                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_all")
    4999                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5000                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5001              
    5002              $C$DW$411       .dwtag  DW_TAG_member
    5003                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$29)
    5004                      .dwattr $C$DW$411, DW_AT_name("bit")
    5005                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_bit")
    5006                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5007                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5008              
    5009                      .dwendtag $C$DW$T$30
    5010              
    5011              
    5012              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5013                      .dwattr $C$DW$T$31, DW_AT_name("CLA1TASKSRCSELLOCK_BITS")
    5014                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    5015              $C$DW$412       .dwtag  DW_TAG_member
    5016                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    5017                      .dwattr $C$DW$412, DW_AT_name("CLA1TASKSRCSEL1")
    5018                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_CLA1TASKSRCSEL1")
    5019                      .dwattr $C$DW$412, DW_AT_bit_offset(0x0f)
    5020                      .dwattr $C$DW$412, DW_AT_bit_size(0x01)
    5021                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5022                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5023              
    5024              $C$DW$413       .dwtag  DW_TAG_member
    5025                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    5026                      .dwattr $C$DW$413, DW_AT_name("CLA1TASKSRCSEL2")
    5027                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_CLA1TASKSRCSEL2")
    5028                      .dwattr $C$DW$413, DW_AT_bit_offset(0x0e)
    5029                      .dwattr $C$DW$413, DW_AT_bit_size(0x01)
    5030                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5031                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5032              
    5033              $C$DW$414       .dwtag  DW_TAG_member
    5034                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    5035                      .dwattr $C$DW$414, DW_AT_name("rsvd1")
    5036                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_rsvd1")
    5037                      .dwattr $C$DW$414, DW_AT_bit_offset(0x00)
    5038                      .dwattr $C$DW$414, DW_AT_bit_size(0x0e)
    5039                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5040                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5041              
    5042              $C$DW$415       .dwtag  DW_TAG_member
    5043                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    5044                      .dwattr $C$DW$415, DW_AT_name("rsvd2")
    5045                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_rsvd2")
    5046                      .dwattr $C$DW$415, DW_AT_bit_offset(0x00)
    5047                      .dwattr $C$DW$415, DW_AT_bit_size(0x10)
    5048                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   96

    5049                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5050              
    5051                      .dwendtag $C$DW$T$31
    5052              
    5053              
    5054              $C$DW$T$32      .dwtag  DW_TAG_union_type
    5055                      .dwattr $C$DW$T$32, DW_AT_name("CLA1TASKSRCSELLOCK_REG")
    5056                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    5057              $C$DW$416       .dwtag  DW_TAG_member
    5058                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$25)
    5059                      .dwattr $C$DW$416, DW_AT_name("all")
    5060                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_all")
    5061                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5062                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5063              
    5064              $C$DW$417       .dwtag  DW_TAG_member
    5065                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$31)
    5066                      .dwattr $C$DW$417, DW_AT_name("bit")
    5067                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_bit")
    5068                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5069                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5070              
    5071                      .dwendtag $C$DW$T$32
    5072              
    5073              
    5074              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5075                      .dwattr $C$DW$T$33, DW_AT_name("CONTROL_BITS")
    5076                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5077              $C$DW$418       .dwtag  DW_TAG_member
    5078                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$19)
    5079                      .dwattr $C$DW$418, DW_AT_name("RUN")
    5080                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_RUN")
    5081                      .dwattr $C$DW$418, DW_AT_bit_offset(0x0f)
    5082                      .dwattr $C$DW$418, DW_AT_bit_size(0x01)
    5083                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5084                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5085              
    5086              $C$DW$419       .dwtag  DW_TAG_member
    5087                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$19)
    5088                      .dwattr $C$DW$419, DW_AT_name("HALT")
    5089                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_HALT")
    5090                      .dwattr $C$DW$419, DW_AT_bit_offset(0x0e)
    5091                      .dwattr $C$DW$419, DW_AT_bit_size(0x01)
    5092                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5093                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5094              
    5095              $C$DW$420       .dwtag  DW_TAG_member
    5096                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
    5097                      .dwattr $C$DW$420, DW_AT_name("SOFTRESET")
    5098                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_SOFTRESET")
    5099                      .dwattr $C$DW$420, DW_AT_bit_offset(0x0d)
    5100                      .dwattr $C$DW$420, DW_AT_bit_size(0x01)
    5101                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5102                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5103              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   97

    5104              $C$DW$421       .dwtag  DW_TAG_member
    5105                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$19)
    5106                      .dwattr $C$DW$421, DW_AT_name("PERINTFRC")
    5107                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_PERINTFRC")
    5108                      .dwattr $C$DW$421, DW_AT_bit_offset(0x0c)
    5109                      .dwattr $C$DW$421, DW_AT_bit_size(0x01)
    5110                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5111                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5112              
    5113              $C$DW$422       .dwtag  DW_TAG_member
    5114                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$19)
    5115                      .dwattr $C$DW$422, DW_AT_name("PERINTCLR")
    5116                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_PERINTCLR")
    5117                      .dwattr $C$DW$422, DW_AT_bit_offset(0x0b)
    5118                      .dwattr $C$DW$422, DW_AT_bit_size(0x01)
    5119                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5120                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5121              
    5122              $C$DW$423       .dwtag  DW_TAG_member
    5123                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$19)
    5124                      .dwattr $C$DW$423, DW_AT_name("rsvd1")
    5125                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_rsvd1")
    5126                      .dwattr $C$DW$423, DW_AT_bit_offset(0x0a)
    5127                      .dwattr $C$DW$423, DW_AT_bit_size(0x01)
    5128                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5129                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5130              
    5131              $C$DW$424       .dwtag  DW_TAG_member
    5132                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
    5133                      .dwattr $C$DW$424, DW_AT_name("rsvd2")
    5134                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_rsvd2")
    5135                      .dwattr $C$DW$424, DW_AT_bit_offset(0x09)
    5136                      .dwattr $C$DW$424, DW_AT_bit_size(0x01)
    5137                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5138                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5139              
    5140              $C$DW$425       .dwtag  DW_TAG_member
    5141                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    5142                      .dwattr $C$DW$425, DW_AT_name("ERRCLR")
    5143                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_ERRCLR")
    5144                      .dwattr $C$DW$425, DW_AT_bit_offset(0x08)
    5145                      .dwattr $C$DW$425, DW_AT_bit_size(0x01)
    5146                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5147                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5148              
    5149              $C$DW$426       .dwtag  DW_TAG_member
    5150                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$19)
    5151                      .dwattr $C$DW$426, DW_AT_name("PERINTFLG")
    5152                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_PERINTFLG")
    5153                      .dwattr $C$DW$426, DW_AT_bit_offset(0x07)
    5154                      .dwattr $C$DW$426, DW_AT_bit_size(0x01)
    5155                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5156                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5157              
    5158              $C$DW$427       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   98

    5159                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    5160                      .dwattr $C$DW$427, DW_AT_name("rsvd3")
    5161                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_rsvd3")
    5162                      .dwattr $C$DW$427, DW_AT_bit_offset(0x06)
    5163                      .dwattr $C$DW$427, DW_AT_bit_size(0x01)
    5164                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5165                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5166              
    5167              $C$DW$428       .dwtag  DW_TAG_member
    5168                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    5169                      .dwattr $C$DW$428, DW_AT_name("rsvd4")
    5170                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_rsvd4")
    5171                      .dwattr $C$DW$428, DW_AT_bit_offset(0x05)
    5172                      .dwattr $C$DW$428, DW_AT_bit_size(0x01)
    5173                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5174                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5175              
    5176              $C$DW$429       .dwtag  DW_TAG_member
    5177                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
    5178                      .dwattr $C$DW$429, DW_AT_name("TRANSFERSTS")
    5179                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_TRANSFERSTS")
    5180                      .dwattr $C$DW$429, DW_AT_bit_offset(0x04)
    5181                      .dwattr $C$DW$429, DW_AT_bit_size(0x01)
    5182                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5183                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5184              
    5185              $C$DW$430       .dwtag  DW_TAG_member
    5186                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$19)
    5187                      .dwattr $C$DW$430, DW_AT_name("BURSTSTS")
    5188                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_BURSTSTS")
    5189                      .dwattr $C$DW$430, DW_AT_bit_offset(0x03)
    5190                      .dwattr $C$DW$430, DW_AT_bit_size(0x01)
    5191                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5192                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5193              
    5194              $C$DW$431       .dwtag  DW_TAG_member
    5195                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$19)
    5196                      .dwattr $C$DW$431, DW_AT_name("RUNSTS")
    5197                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_RUNSTS")
    5198                      .dwattr $C$DW$431, DW_AT_bit_offset(0x02)
    5199                      .dwattr $C$DW$431, DW_AT_bit_size(0x01)
    5200                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5201                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5202              
    5203              $C$DW$432       .dwtag  DW_TAG_member
    5204                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    5205                      .dwattr $C$DW$432, DW_AT_name("OVRFLG")
    5206                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_OVRFLG")
    5207                      .dwattr $C$DW$432, DW_AT_bit_offset(0x01)
    5208                      .dwattr $C$DW$432, DW_AT_bit_size(0x01)
    5209                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5210                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5211              
    5212              $C$DW$433       .dwtag  DW_TAG_member
    5213                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE   99

    5214                      .dwattr $C$DW$433, DW_AT_name("rsvd5")
    5215                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_rsvd5")
    5216                      .dwattr $C$DW$433, DW_AT_bit_offset(0x00)
    5217                      .dwattr $C$DW$433, DW_AT_bit_size(0x01)
    5218                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5219                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5220              
    5221                      .dwendtag $C$DW$T$33
    5222              
    5223              
    5224              $C$DW$T$34      .dwtag  DW_TAG_union_type
    5225                      .dwattr $C$DW$T$34, DW_AT_name("CONTROL_REG")
    5226                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    5227              $C$DW$434       .dwtag  DW_TAG_member
    5228                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$19)
    5229                      .dwattr $C$DW$434, DW_AT_name("all")
    5230                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_all")
    5231                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5232                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5233              
    5234              $C$DW$435       .dwtag  DW_TAG_member
    5235                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$33)
    5236                      .dwattr $C$DW$435, DW_AT_name("bit")
    5237                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_bit")
    5238                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5239                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5240              
    5241                      .dwendtag $C$DW$T$34
    5242              
    5243              
    5244              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5245                      .dwattr $C$DW$T$35, DW_AT_name("DEBUGCTRL_BITS")
    5246                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    5247              $C$DW$436       .dwtag  DW_TAG_member
    5248                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$19)
    5249                      .dwattr $C$DW$436, DW_AT_name("rsvd1")
    5250                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_rsvd1")
    5251                      .dwattr $C$DW$436, DW_AT_bit_offset(0x01)
    5252                      .dwattr $C$DW$436, DW_AT_bit_size(0x0f)
    5253                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5254                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5255              
    5256              $C$DW$437       .dwtag  DW_TAG_member
    5257                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$19)
    5258                      .dwattr $C$DW$437, DW_AT_name("FREE")
    5259                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_FREE")
    5260                      .dwattr $C$DW$437, DW_AT_bit_offset(0x00)
    5261                      .dwattr $C$DW$437, DW_AT_bit_size(0x01)
    5262                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5263                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5264              
    5265                      .dwendtag $C$DW$T$35
    5266              
    5267              
    5268              $C$DW$T$36      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  100

    5269                      .dwattr $C$DW$T$36, DW_AT_name("DEBUGCTRL_REG")
    5270                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    5271              $C$DW$438       .dwtag  DW_TAG_member
    5272                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$19)
    5273                      .dwattr $C$DW$438, DW_AT_name("all")
    5274                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_all")
    5275                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5276                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5277              
    5278              $C$DW$439       .dwtag  DW_TAG_member
    5279                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$35)
    5280                      .dwattr $C$DW$439, DW_AT_name("bit")
    5281                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_bit")
    5282                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5283                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5284              
    5285                      .dwendtag $C$DW$T$36
    5286              
    5287              
    5288              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5289                      .dwattr $C$DW$T$37, DW_AT_name("DMACHSRCSEL1_BITS")
    5290                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    5291              $C$DW$440       .dwtag  DW_TAG_member
    5292                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$19)
    5293                      .dwattr $C$DW$440, DW_AT_name("CH1")
    5294                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_CH1")
    5295                      .dwattr $C$DW$440, DW_AT_bit_offset(0x08)
    5296                      .dwattr $C$DW$440, DW_AT_bit_size(0x08)
    5297                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5298                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5299              
    5300              $C$DW$441       .dwtag  DW_TAG_member
    5301                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$19)
    5302                      .dwattr $C$DW$441, DW_AT_name("CH2")
    5303                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_CH2")
    5304                      .dwattr $C$DW$441, DW_AT_bit_offset(0x00)
    5305                      .dwattr $C$DW$441, DW_AT_bit_size(0x08)
    5306                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5307                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5308              
    5309              $C$DW$442       .dwtag  DW_TAG_member
    5310                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$19)
    5311                      .dwattr $C$DW$442, DW_AT_name("CH3")
    5312                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_CH3")
    5313                      .dwattr $C$DW$442, DW_AT_bit_offset(0x08)
    5314                      .dwattr $C$DW$442, DW_AT_bit_size(0x08)
    5315                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5316                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5317              
    5318              $C$DW$443       .dwtag  DW_TAG_member
    5319                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$19)
    5320                      .dwattr $C$DW$443, DW_AT_name("CH4")
    5321                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_CH4")
    5322                      .dwattr $C$DW$443, DW_AT_bit_offset(0x00)
    5323                      .dwattr $C$DW$443, DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  101

    5324                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5325                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5326              
    5327                      .dwendtag $C$DW$T$37
    5328              
    5329              
    5330              $C$DW$T$38      .dwtag  DW_TAG_union_type
    5331                      .dwattr $C$DW$T$38, DW_AT_name("DMACHSRCSEL1_REG")
    5332                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    5333              $C$DW$444       .dwtag  DW_TAG_member
    5334                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$25)
    5335                      .dwattr $C$DW$444, DW_AT_name("all")
    5336                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_all")
    5337                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5338                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5339              
    5340              $C$DW$445       .dwtag  DW_TAG_member
    5341                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$37)
    5342                      .dwattr $C$DW$445, DW_AT_name("bit")
    5343                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_bit")
    5344                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5345                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5346              
    5347                      .dwendtag $C$DW$T$38
    5348              
    5349              
    5350              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5351                      .dwattr $C$DW$T$39, DW_AT_name("DMACHSRCSEL2_BITS")
    5352                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    5353              $C$DW$446       .dwtag  DW_TAG_member
    5354                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$19)
    5355                      .dwattr $C$DW$446, DW_AT_name("CH5")
    5356                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_CH5")
    5357                      .dwattr $C$DW$446, DW_AT_bit_offset(0x08)
    5358                      .dwattr $C$DW$446, DW_AT_bit_size(0x08)
    5359                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5360                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5361              
    5362              $C$DW$447       .dwtag  DW_TAG_member
    5363                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$19)
    5364                      .dwattr $C$DW$447, DW_AT_name("CH6")
    5365                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_CH6")
    5366                      .dwattr $C$DW$447, DW_AT_bit_offset(0x00)
    5367                      .dwattr $C$DW$447, DW_AT_bit_size(0x08)
    5368                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5369                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5370              
    5371              $C$DW$448       .dwtag  DW_TAG_member
    5372                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$19)
    5373                      .dwattr $C$DW$448, DW_AT_name("rsvd1")
    5374                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_rsvd1")
    5375                      .dwattr $C$DW$448, DW_AT_bit_offset(0x00)
    5376                      .dwattr $C$DW$448, DW_AT_bit_size(0x10)
    5377                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5378                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  102

    5379              
    5380                      .dwendtag $C$DW$T$39
    5381              
    5382              
    5383              $C$DW$T$40      .dwtag  DW_TAG_union_type
    5384                      .dwattr $C$DW$T$40, DW_AT_name("DMACHSRCSEL2_REG")
    5385                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    5386              $C$DW$449       .dwtag  DW_TAG_member
    5387                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$25)
    5388                      .dwattr $C$DW$449, DW_AT_name("all")
    5389                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_all")
    5390                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5391                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    5392              
    5393              $C$DW$450       .dwtag  DW_TAG_member
    5394                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$39)
    5395                      .dwattr $C$DW$450, DW_AT_name("bit")
    5396                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_bit")
    5397                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5398                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    5399              
    5400                      .dwendtag $C$DW$T$40
    5401              
    5402              
    5403              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5404                      .dwattr $C$DW$T$41, DW_AT_name("DMACHSRCSELLOCK_BITS")
    5405                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    5406              $C$DW$451       .dwtag  DW_TAG_member
    5407                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
    5408                      .dwattr $C$DW$451, DW_AT_name("DMACHSRCSEL1")
    5409                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_DMACHSRCSEL1")
    5410                      .dwattr $C$DW$451, DW_AT_bit_offset(0x0f)
    5411                      .dwattr $C$DW$451, DW_AT_bit_size(0x01)
    5412                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5413                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    5414              
    5415              $C$DW$452       .dwtag  DW_TAG_member
    5416                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
    5417                      .dwattr $C$DW$452, DW_AT_name("DMACHSRCSEL2")
    5418                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_DMACHSRCSEL2")
    5419                      .dwattr $C$DW$452, DW_AT_bit_offset(0x0e)
    5420                      .dwattr $C$DW$452, DW_AT_bit_size(0x01)
    5421                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5422                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    5423              
    5424              $C$DW$453       .dwtag  DW_TAG_member
    5425                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$19)
    5426                      .dwattr $C$DW$453, DW_AT_name("rsvd1")
    5427                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_rsvd1")
    5428                      .dwattr $C$DW$453, DW_AT_bit_offset(0x00)
    5429                      .dwattr $C$DW$453, DW_AT_bit_size(0x0e)
    5430                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5431                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5432              
    5433              $C$DW$454       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  103

    5434                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
    5435                      .dwattr $C$DW$454, DW_AT_name("rsvd2")
    5436                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_rsvd2")
    5437                      .dwattr $C$DW$454, DW_AT_bit_offset(0x00)
    5438                      .dwattr $C$DW$454, DW_AT_bit_size(0x10)
    5439                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5440                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5441              
    5442                      .dwendtag $C$DW$T$41
    5443              
    5444              
    5445              $C$DW$T$42      .dwtag  DW_TAG_union_type
    5446                      .dwattr $C$DW$T$42, DW_AT_name("DMACHSRCSELLOCK_REG")
    5447                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    5448              $C$DW$455       .dwtag  DW_TAG_member
    5449                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$25)
    5450                      .dwattr $C$DW$455, DW_AT_name("all")
    5451                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_all")
    5452                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5453                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5454              
    5455              $C$DW$456       .dwtag  DW_TAG_member
    5456                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$41)
    5457                      .dwattr $C$DW$456, DW_AT_name("bit")
    5458                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_bit")
    5459                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5460                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5461              
    5462                      .dwendtag $C$DW$T$42
    5463              
    5464              
    5465              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    5466                      .dwattr $C$DW$T$43, DW_AT_name("DMACTRL_BITS")
    5467                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    5468              $C$DW$457       .dwtag  DW_TAG_member
    5469                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    5470                      .dwattr $C$DW$457, DW_AT_name("HARDRESET")
    5471                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_HARDRESET")
    5472                      .dwattr $C$DW$457, DW_AT_bit_offset(0x0f)
    5473                      .dwattr $C$DW$457, DW_AT_bit_size(0x01)
    5474                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5475                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5476              
    5477              $C$DW$458       .dwtag  DW_TAG_member
    5478                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
    5479                      .dwattr $C$DW$458, DW_AT_name("PRIORITYRESET")
    5480                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_PRIORITYRESET")
    5481                      .dwattr $C$DW$458, DW_AT_bit_offset(0x0e)
    5482                      .dwattr $C$DW$458, DW_AT_bit_size(0x01)
    5483                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5484                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5485              
    5486              $C$DW$459       .dwtag  DW_TAG_member
    5487                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
    5488                      .dwattr $C$DW$459, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  104

    5489                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_rsvd1")
    5490                      .dwattr $C$DW$459, DW_AT_bit_offset(0x00)
    5491                      .dwattr $C$DW$459, DW_AT_bit_size(0x0e)
    5492                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5493                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5494              
    5495                      .dwendtag $C$DW$T$43
    5496              
    5497              
    5498              $C$DW$T$44      .dwtag  DW_TAG_union_type
    5499                      .dwattr $C$DW$T$44, DW_AT_name("DMACTRL_REG")
    5500                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    5501              $C$DW$460       .dwtag  DW_TAG_member
    5502                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
    5503                      .dwattr $C$DW$460, DW_AT_name("all")
    5504                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_all")
    5505                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5506                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5507              
    5508              $C$DW$461       .dwtag  DW_TAG_member
    5509                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$43)
    5510                      .dwattr $C$DW$461, DW_AT_name("bit")
    5511                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_bit")
    5512                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5513                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5514              
    5515                      .dwendtag $C$DW$T$44
    5516              
    5517              
    5518              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    5519                      .dwattr $C$DW$T$47, DW_AT_name("DMA_CLA_SRC_SEL_REGS")
    5520                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x1a)
    5521              $C$DW$462       .dwtag  DW_TAG_member
    5522                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$32)
    5523                      .dwattr $C$DW$462, DW_AT_name("CLA1TASKSRCSELLOCK")
    5524                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_CLA1TASKSRCSELLOCK")
    5525                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5526                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5527              
    5528              $C$DW$463       .dwtag  DW_TAG_member
    5529                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$45)
    5530                      .dwattr $C$DW$463, DW_AT_name("rsvd1")
    5531                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_rsvd1")
    5532                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5533                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5534              
    5535              $C$DW$464       .dwtag  DW_TAG_member
    5536                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$42)
    5537                      .dwattr $C$DW$464, DW_AT_name("DMACHSRCSELLOCK")
    5538                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_DMACHSRCSELLOCK")
    5539                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5540                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5541              
    5542              $C$DW$465       .dwtag  DW_TAG_member
    5543                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  105

    5544                      .dwattr $C$DW$465, DW_AT_name("CLA1TASKSRCSEL1")
    5545                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_CLA1TASKSRCSEL1")
    5546                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5547                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5548              
    5549              $C$DW$466       .dwtag  DW_TAG_member
    5550                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$30)
    5551                      .dwattr $C$DW$466, DW_AT_name("CLA1TASKSRCSEL2")
    5552                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_CLA1TASKSRCSEL2")
    5553                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5554                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5555              
    5556              $C$DW$467       .dwtag  DW_TAG_member
    5557                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$46)
    5558                      .dwattr $C$DW$467, DW_AT_name("rsvd2")
    5559                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_rsvd2")
    5560                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5561                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5562              
    5563              $C$DW$468       .dwtag  DW_TAG_member
    5564                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$38)
    5565                      .dwattr $C$DW$468, DW_AT_name("DMACHSRCSEL1")
    5566                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_DMACHSRCSEL1")
    5567                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5568                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5569              
    5570              $C$DW$469       .dwtag  DW_TAG_member
    5571                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$40)
    5572                      .dwattr $C$DW$469, DW_AT_name("DMACHSRCSEL2")
    5573                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_DMACHSRCSEL2")
    5574                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5575                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5576              
    5577                      .dwendtag $C$DW$T$47
    5578              
    5579              $C$DW$470       .dwtag  DW_TAG_TI_far_type
    5580                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$47)
    5581              
    5582              $C$DW$T$119     .dwtag  DW_TAG_volatile_type
    5583                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$470)
    5584              
    5585              
    5586              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    5587                      .dwattr $C$DW$T$49, DW_AT_name("DMA_REGS")
    5588                      .dwattr $C$DW$T$49, DW_AT_byte_size(0xe0)
    5589              $C$DW$471       .dwtag  DW_TAG_member
    5590                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$44)
    5591                      .dwattr $C$DW$471, DW_AT_name("DMACTRL")
    5592                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_DMACTRL")
    5593                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5594                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5595              
    5596              $C$DW$472       .dwtag  DW_TAG_member
    5597                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$36)
    5598                      .dwattr $C$DW$472, DW_AT_name("DEBUGCTRL")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  106

    5599                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_DEBUGCTRL")
    5600                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5601                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5602              
    5603              $C$DW$473       .dwtag  DW_TAG_member
    5604                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$45)
    5605                      .dwattr $C$DW$473, DW_AT_name("rsvd1")
    5606                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_rsvd1")
    5607                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5608                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5609              
    5610              $C$DW$474       .dwtag  DW_TAG_member
    5611                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$106)
    5612                      .dwattr $C$DW$474, DW_AT_name("PRIORITYCTRL1")
    5613                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_PRIORITYCTRL1")
    5614                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5615                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5616              
    5617              $C$DW$475       .dwtag  DW_TAG_member
    5618                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    5619                      .dwattr $C$DW$475, DW_AT_name("rsvd2")
    5620                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_rsvd2")
    5621                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5622                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5623              
    5624              $C$DW$476       .dwtag  DW_TAG_member
    5625                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$108)
    5626                      .dwattr $C$DW$476, DW_AT_name("PRIORITYSTAT")
    5627                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_PRIORITYSTAT")
    5628                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5629                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5630              
    5631              $C$DW$477       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$48)
    5633                      .dwattr $C$DW$477, DW_AT_name("rsvd3")
    5634                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_rsvd3")
    5635                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5636                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5637              
    5638              $C$DW$478       .dwtag  DW_TAG_member
    5639                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$26)
    5640                      .dwattr $C$DW$478, DW_AT_name("CH1")
    5641                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_CH1")
    5642                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5643                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5644              
    5645              $C$DW$479       .dwtag  DW_TAG_member
    5646                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$26)
    5647                      .dwattr $C$DW$479, DW_AT_name("CH2")
    5648                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_CH2")
    5649                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5650                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5651              
    5652              $C$DW$480       .dwtag  DW_TAG_member
    5653                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  107

    5654                      .dwattr $C$DW$480, DW_AT_name("CH3")
    5655                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_CH3")
    5656                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5657                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5658              
    5659              $C$DW$481       .dwtag  DW_TAG_member
    5660                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$26)
    5661                      .dwattr $C$DW$481, DW_AT_name("CH4")
    5662                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_CH4")
    5663                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    5664                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5665              
    5666              $C$DW$482       .dwtag  DW_TAG_member
    5667                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$26)
    5668                      .dwattr $C$DW$482, DW_AT_name("CH5")
    5669                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_CH5")
    5670                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5671                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5672              
    5673              $C$DW$483       .dwtag  DW_TAG_member
    5674                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$26)
    5675                      .dwattr $C$DW$483, DW_AT_name("CH6")
    5676                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_CH6")
    5677                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5678                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5679              
    5680                      .dwendtag $C$DW$T$49
    5681              
    5682              $C$DW$484       .dwtag  DW_TAG_TI_far_type
    5683                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$49)
    5684              
    5685              $C$DW$T$121     .dwtag  DW_TAG_volatile_type
    5686                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$484)
    5687              
    5688              
    5689              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    5690                      .dwattr $C$DW$T$50, DW_AT_name("MODE_BITS")
    5691                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    5692              $C$DW$485       .dwtag  DW_TAG_member
    5693                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
    5694                      .dwattr $C$DW$485, DW_AT_name("PERINTSEL")
    5695                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_PERINTSEL")
    5696                      .dwattr $C$DW$485, DW_AT_bit_offset(0x0b)
    5697                      .dwattr $C$DW$485, DW_AT_bit_size(0x05)
    5698                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5699                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5700              
    5701              $C$DW$486       .dwtag  DW_TAG_member
    5702                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
    5703                      .dwattr $C$DW$486, DW_AT_name("rsvd1")
    5704                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_rsvd1")
    5705                      .dwattr $C$DW$486, DW_AT_bit_offset(0x09)
    5706                      .dwattr $C$DW$486, DW_AT_bit_size(0x02)
    5707                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5708                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  108

    5709              
    5710              $C$DW$487       .dwtag  DW_TAG_member
    5711                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$19)
    5712                      .dwattr $C$DW$487, DW_AT_name("OVRINTE")
    5713                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_OVRINTE")
    5714                      .dwattr $C$DW$487, DW_AT_bit_offset(0x08)
    5715                      .dwattr $C$DW$487, DW_AT_bit_size(0x01)
    5716                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5717                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5718              
    5719              $C$DW$488       .dwtag  DW_TAG_member
    5720                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$19)
    5721                      .dwattr $C$DW$488, DW_AT_name("PERINTE")
    5722                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_PERINTE")
    5723                      .dwattr $C$DW$488, DW_AT_bit_offset(0x07)
    5724                      .dwattr $C$DW$488, DW_AT_bit_size(0x01)
    5725                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5726                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5727              
    5728              $C$DW$489       .dwtag  DW_TAG_member
    5729                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
    5730                      .dwattr $C$DW$489, DW_AT_name("CHINTMODE")
    5731                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_CHINTMODE")
    5732                      .dwattr $C$DW$489, DW_AT_bit_offset(0x06)
    5733                      .dwattr $C$DW$489, DW_AT_bit_size(0x01)
    5734                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5735                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5736              
    5737              $C$DW$490       .dwtag  DW_TAG_member
    5738                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$19)
    5739                      .dwattr $C$DW$490, DW_AT_name("ONESHOT")
    5740                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_ONESHOT")
    5741                      .dwattr $C$DW$490, DW_AT_bit_offset(0x05)
    5742                      .dwattr $C$DW$490, DW_AT_bit_size(0x01)
    5743                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5744                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5745              
    5746              $C$DW$491       .dwtag  DW_TAG_member
    5747                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$19)
    5748                      .dwattr $C$DW$491, DW_AT_name("CONTINUOUS")
    5749                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_CONTINUOUS")
    5750                      .dwattr $C$DW$491, DW_AT_bit_offset(0x04)
    5751                      .dwattr $C$DW$491, DW_AT_bit_size(0x01)
    5752                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5753                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5754              
    5755              $C$DW$492       .dwtag  DW_TAG_member
    5756                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$19)
    5757                      .dwattr $C$DW$492, DW_AT_name("rsvd2")
    5758                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_rsvd2")
    5759                      .dwattr $C$DW$492, DW_AT_bit_offset(0x03)
    5760                      .dwattr $C$DW$492, DW_AT_bit_size(0x01)
    5761                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5762                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5763              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  109

    5764              $C$DW$493       .dwtag  DW_TAG_member
    5765                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$19)
    5766                      .dwattr $C$DW$493, DW_AT_name("rsvd3")
    5767                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_rsvd3")
    5768                      .dwattr $C$DW$493, DW_AT_bit_offset(0x02)
    5769                      .dwattr $C$DW$493, DW_AT_bit_size(0x01)
    5770                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5771                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5772              
    5773              $C$DW$494       .dwtag  DW_TAG_member
    5774                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    5775                      .dwattr $C$DW$494, DW_AT_name("DATASIZE")
    5776                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_DATASIZE")
    5777                      .dwattr $C$DW$494, DW_AT_bit_offset(0x01)
    5778                      .dwattr $C$DW$494, DW_AT_bit_size(0x01)
    5779                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5780                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5781              
    5782              $C$DW$495       .dwtag  DW_TAG_member
    5783                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    5784                      .dwattr $C$DW$495, DW_AT_name("CHINTE")
    5785                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_CHINTE")
    5786                      .dwattr $C$DW$495, DW_AT_bit_offset(0x00)
    5787                      .dwattr $C$DW$495, DW_AT_bit_size(0x01)
    5788                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5789                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5790              
    5791                      .dwendtag $C$DW$T$50
    5792              
    5793              
    5794              $C$DW$T$51      .dwtag  DW_TAG_union_type
    5795                      .dwattr $C$DW$T$51, DW_AT_name("MODE_REG")
    5796                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    5797              $C$DW$496       .dwtag  DW_TAG_member
    5798                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    5799                      .dwattr $C$DW$496, DW_AT_name("all")
    5800                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_all")
    5801                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5802                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5803              
    5804              $C$DW$497       .dwtag  DW_TAG_member
    5805                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$50)
    5806                      .dwattr $C$DW$497, DW_AT_name("bit")
    5807                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_bit")
    5808                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5809                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5810              
    5811                      .dwendtag $C$DW$T$51
    5812              
    5813              
    5814              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    5815                      .dwattr $C$DW$T$52, DW_AT_name("PIEACK_BITS")
    5816                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    5817              $C$DW$498       .dwtag  DW_TAG_member
    5818                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  110

    5819                      .dwattr $C$DW$498, DW_AT_name("ACK1")
    5820                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_ACK1")
    5821                      .dwattr $C$DW$498, DW_AT_bit_offset(0x0f)
    5822                      .dwattr $C$DW$498, DW_AT_bit_size(0x01)
    5823                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5824                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5825              
    5826              $C$DW$499       .dwtag  DW_TAG_member
    5827                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
    5828                      .dwattr $C$DW$499, DW_AT_name("ACK2")
    5829                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_ACK2")
    5830                      .dwattr $C$DW$499, DW_AT_bit_offset(0x0e)
    5831                      .dwattr $C$DW$499, DW_AT_bit_size(0x01)
    5832                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5833                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5834              
    5835              $C$DW$500       .dwtag  DW_TAG_member
    5836                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
    5837                      .dwattr $C$DW$500, DW_AT_name("ACK3")
    5838                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_ACK3")
    5839                      .dwattr $C$DW$500, DW_AT_bit_offset(0x0d)
    5840                      .dwattr $C$DW$500, DW_AT_bit_size(0x01)
    5841                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5842                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5843              
    5844              $C$DW$501       .dwtag  DW_TAG_member
    5845                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
    5846                      .dwattr $C$DW$501, DW_AT_name("ACK4")
    5847                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_ACK4")
    5848                      .dwattr $C$DW$501, DW_AT_bit_offset(0x0c)
    5849                      .dwattr $C$DW$501, DW_AT_bit_size(0x01)
    5850                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5851                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5852              
    5853              $C$DW$502       .dwtag  DW_TAG_member
    5854                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
    5855                      .dwattr $C$DW$502, DW_AT_name("ACK5")
    5856                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_ACK5")
    5857                      .dwattr $C$DW$502, DW_AT_bit_offset(0x0b)
    5858                      .dwattr $C$DW$502, DW_AT_bit_size(0x01)
    5859                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5860                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5861              
    5862              $C$DW$503       .dwtag  DW_TAG_member
    5863                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
    5864                      .dwattr $C$DW$503, DW_AT_name("ACK6")
    5865                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_ACK6")
    5866                      .dwattr $C$DW$503, DW_AT_bit_offset(0x0a)
    5867                      .dwattr $C$DW$503, DW_AT_bit_size(0x01)
    5868                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5869                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5870              
    5871              $C$DW$504       .dwtag  DW_TAG_member
    5872                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$19)
    5873                      .dwattr $C$DW$504, DW_AT_name("ACK7")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{76591A99-5B9B-480D-B4B3-F66C61DDC580} PAGE  111

    5874                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_ACK7")
    5875                      .dwattr $C$DW$504, DW_AT_bit_offset(0x09)
    5876                      .dwattr $C$DW$504, DW_AT_bit_size(0x01)
    5877                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5878                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5879              
    5880              $C$DW$505       .dwtag  DW_TAG_member
    5881                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    5882                      .dwattr $C$DW$505, DW_AT_name("ACK8")
    5883                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_ACK8")
    5884                      .dwattr $C$DW$505, DW_AT_bit_offset(0x08)
    5885                      .dwattr $C$DW$505, DW_AT_bit_size(0x01)
    5886                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5887                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5888              
    5889              $C$DW$506       .dwtag  DW_TAG_member
    5890                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$19)
    5891                      .dwattr $C$DW$506, DW_AT_name("ACK9")
    5892                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_ACK9")
    5893                      .dwattr $C$DW$506, DW_AT_bit_offset(0x07)
    5894                      .dwattr $C$DW$506, DW_AT_bit_size(0x01)
    5895                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5896                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5897              
    5898              $C$DW$507       .dwtag  DW_TAG_member
    5899                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$19)
    5900                      .dwattr $C$DW$507, DW_AT_name("ACK10")
