TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:55 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DeviceSupport/source/f28003x_sysctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("F28x_usDelay")

    2350 00000010 A032!         MOVL      @$BLOCKED(_CpuSysRegs)+50,XAR5 ; [CPU_ALU] |246| 
    2351                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 247,column 5,is_stmt,isa 0
    2352 00000011 A834!         MOVL      @$BLOCKED(_CpuSysRegs)+52,XAR4 ; [CPU_ALU] |247| 
    2353                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 248,column 5,is_stmt,isa 0
    2354 00000012 A936!         MOVL      @$BLOCKED(_CpuSysRegs)+54,P ; [CPU_ALU] |248| 
    2355                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 249,column 5,is_stmt,isa 0
    2356 00000013 1E3C!         MOVL      @$BLOCKED(_CpuSysRegs)+60,ACC ; [CPU_ALU] |249| 
    2357                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 250,column 5,is_stmt,isa 0
    2358 00000014 C33E!         MOVL      @$BLOCKED(_CpuSysRegs)+62,XAR7 ; [CPU_ALU] |250| 
    2359 00000015 761F!         MOVW      DP,#_CpuSysRegs+66    ; [CPU_ARAU] 
         00000016 0001 
    2360                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 251,column 5,is_stmt,isa 0
    2361 00000017 C202!         MOVL      @$BLOCKED(_CpuSysRegs)+66,XAR6 ; [CPU_ALU] |251| 
    2362                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 252,column 5,is_stmt,isa 0
    2363 00000018 1E04!         MOVL      @$BLOCKED(_CpuSysRegs)+68,ACC ; [CPU_ALU] |252| 
    2364                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 253,column 5,is_stmt,isa 0
    2365 00000019 3A06!         MOVL      @$BLOCKED(_CpuSysRegs)+70,XAR0 ; [CPU_ALU] |253| 
    2366                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 254,column 5,is_stmt,isa 0
    2367 0000001a A008!         MOVL      @$BLOCKED(_CpuSysRegs)+72,XAR5 ; [CPU_ALU] |254| 
    2368                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 255,column 5,is_stmt,isa 0
    2369 0000001b A80A!         MOVL      @$BLOCKED(_CpuSysRegs)+74,XAR4 ; [CPU_ALU] |255| 
    2370                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 256,column 5,is_stmt,isa 0
    2371 0000001c A90C!         MOVL      @$BLOCKED(_CpuSysRegs)+76,P ; [CPU_ALU] |256| 
    2372                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 257,column 5,is_stmt,isa 0
    2373 0000001d C314!         MOVL      @$BLOCKED(_CpuSysRegs)+84,XAR7 ; [CPU_ALU] |257| 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   48

    2374                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 258,column 5,is_stmt,isa 0
    2375 0000001e C216!         MOVL      @$BLOCKED(_CpuSysRegs)+86,XAR6 ; [CPU_ALU] |258| 
    2376                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 259,column 5,is_stmt,isa 0
    2377 0000001f 1E18!         MOVL      @$BLOCKED(_CpuSysRegs)+88,ACC ; [CPU_ALU] |259| 
    2378                      .dwpsn  file "../DeviceSupport/source/f28003x_sysctrl.c",line 261,column 5,is_stmt,isa 0
    2379 00000020 761A          EDIS      ; [CPU_ALU] |261| 
    2380              $C$DW$106       .dwtag  DW_TAG_TI_branch
    2381                      .dwattr $C$DW$106, DW_AT_low_pc(0x00)
    2382                      .dwattr $C$DW$106, DW_AT_TI_return
    2383              
    2384 00000021 0006          LRETR     ; [CPU_ALU] 
    2385                      ; return occurs ; [] 
    2386                      .dwattr $C$DW$105, DW_AT_TI_end_file("../DeviceSupport/source/f28003x_sysctrl.c")
    2387                      .dwattr $C$DW$105, DW_AT_TI_end_line(0x106)
    2388                      .dwattr $C$DW$105, DW_AT_TI_end_column(0x01)
    2389                      .dwendentry
    2390                      .dwendtag $C$DW$105
    2391              
    2392              ;**************************************************************
    2393              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2394              ;**************************************************************
    2395                      .global _F28x_usDelay
    2396                      .global _RamfuncsLoadStart
    2397                      .global _RamfuncsLoadSize
    2398                      .global _RamfuncsRunStart
    2399                      .global _Flash0EccRegs
    2400                      .global _WdRegs
    2401                      .global _Dcc0Regs
    2402                      .global _Dcc1Regs
    2403                      .global _ClkCfgRegs
    2404                      .global _CpuSysRegs
    2405                      .global _Flash0CtrlRegs
    2406                      .global FS$$DIV
    2407                      .global _memcpy
    2408              
    2409              ;***************************************************************
    2410              ;* TYPE INFORMATION                                            *
    2411              ;***************************************************************
    2412              
    2413              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2414                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
    2415                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    2416              $C$DW$107       .dwtag  DW_TAG_member
    2417                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2418                      .dwattr $C$DW$107, DW_AT_name("rsvd1")
    2419                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd1")
    2420                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0d)
    2421                      .dwattr $C$DW$107, DW_AT_bit_size(0x03)
    2422                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2423                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2424              
    2425              $C$DW$108       .dwtag  DW_TAG_member
    2426                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2427                      .dwattr $C$DW$108, DW_AT_name("rsvd2")
    2428                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   49

    2429                      .dwattr $C$DW$108, DW_AT_bit_offset(0x08)
    2430                      .dwattr $C$DW$108, DW_AT_bit_size(0x05)
    2431                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2433              
    2434              $C$DW$109       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2436                      .dwattr $C$DW$109, DW_AT_name("MCANCLKDIV")
    2437                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_MCANCLKDIV")
    2438                      .dwattr $C$DW$109, DW_AT_bit_offset(0x03)
    2439                      .dwattr $C$DW$109, DW_AT_bit_size(0x05)
    2440                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2441                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2442              
    2443              $C$DW$110       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2445                      .dwattr $C$DW$110, DW_AT_name("rsvd3")
    2446                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd3")
    2447                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    2448                      .dwattr $C$DW$110, DW_AT_bit_size(0x03)
    2449                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2450                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2451              
    2452              $C$DW$111       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2454                      .dwattr $C$DW$111, DW_AT_name("rsvd4")
    2455                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd4")
    2456                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    2457                      .dwattr $C$DW$111, DW_AT_bit_size(0x10)
    2458                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2459                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2460              
    2461                      .dwendtag $C$DW$T$20
    2462              
    2463              
    2464              $C$DW$T$22      .dwtag  DW_TAG_union_type
    2465                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
    2466                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    2467              $C$DW$112       .dwtag  DW_TAG_member
    2468                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    2469                      .dwattr $C$DW$112, DW_AT_name("all")
    2470                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    2471                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2473              
    2474              $C$DW$113       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    2476                      .dwattr $C$DW$113, DW_AT_name("bit")
    2477                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    2478                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2480              
    2481                      .dwendtag $C$DW$T$22
    2482              
    2483              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   50

    2484              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2485                      .dwattr $C$DW$T$23, DW_AT_name("CLKCFGLOCK1_BITS")
    2486                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    2487              $C$DW$114       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2489                      .dwattr $C$DW$114, DW_AT_name("CLKSRCCTL1")
    2490                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2491                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0f)
    2492                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    2493                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2495              
    2496              $C$DW$115       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2498                      .dwattr $C$DW$115, DW_AT_name("CLKSRCCTL2")
    2499                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2500                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0e)
    2501                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    2502                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2504              
    2505              $C$DW$116       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2507                      .dwattr $C$DW$116, DW_AT_name("CLKSRCCTL3")
    2508                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2509                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0d)
    2510                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    2511                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2513              
    2514              $C$DW$117       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2516                      .dwattr $C$DW$117, DW_AT_name("SYSPLLCTL1")
    2517                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2518                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0c)
    2519                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    2520                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2521                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2522              
    2523              $C$DW$118       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2525                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    2526                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    2527                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0b)
    2528                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    2529                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2530                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2531              
    2532              $C$DW$119       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2534                      .dwattr $C$DW$119, DW_AT_name("rsvd2")
    2535                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd2")
    2536                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0a)
    2537                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    2538                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   51

    2539                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2540              
    2541              $C$DW$120       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2543                      .dwattr $C$DW$120, DW_AT_name("SYSPLLMULT")
    2544                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2545                      .dwattr $C$DW$120, DW_AT_bit_offset(0x09)
    2546                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    2547                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2548                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2549              
    2550              $C$DW$121       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2552                      .dwattr $C$DW$121, DW_AT_name("rsvd3")
    2553                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd3")
    2554                      .dwattr $C$DW$121, DW_AT_bit_offset(0x08)
    2555                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    2556                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2558              
    2559              $C$DW$122       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2561                      .dwattr $C$DW$122, DW_AT_name("rsvd4")
    2562                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd4")
    2563                      .dwattr $C$DW$122, DW_AT_bit_offset(0x07)
    2564                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    2565                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2566                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2567              
    2568              $C$DW$123       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2570                      .dwattr $C$DW$123, DW_AT_name("rsvd5")
    2571                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd5")
    2572                      .dwattr $C$DW$123, DW_AT_bit_offset(0x06)
    2573                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    2574                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2576              
    2577              $C$DW$124       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2579                      .dwattr $C$DW$124, DW_AT_name("rsvd6")
    2580                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd6")
    2581                      .dwattr $C$DW$124, DW_AT_bit_offset(0x05)
    2582                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    2583                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2585              
    2586              $C$DW$125       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2588                      .dwattr $C$DW$125, DW_AT_name("SYSCLKDIVSEL")
    2589                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2590                      .dwattr $C$DW$125, DW_AT_bit_offset(0x04)
    2591                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    2592                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2593                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   52

    2594              
    2595              $C$DW$126       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2597                      .dwattr $C$DW$126, DW_AT_name("AUXCLKDIVSEL")
    2598                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2599                      .dwattr $C$DW$126, DW_AT_bit_offset(0x03)
    2600                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    2601                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2602                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2603              
    2604              $C$DW$127       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2606                      .dwattr $C$DW$127, DW_AT_name("PERCLKDIVSEL")
    2607                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2608                      .dwattr $C$DW$127, DW_AT_bit_offset(0x02)
    2609                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2610                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2611                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2612              
    2613              $C$DW$128       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2615                      .dwattr $C$DW$128, DW_AT_name("rsvd7")
    2616                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd7")
    2617                      .dwattr $C$DW$128, DW_AT_bit_offset(0x01)
    2618                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2619                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2620                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2621              
    2622              $C$DW$129       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2624                      .dwattr $C$DW$129, DW_AT_name("LOSPCP")
    2625                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_LOSPCP")
    2626                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    2627                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2628                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2630              
    2631              $C$DW$130       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2633                      .dwattr $C$DW$130, DW_AT_name("XTALCR")
    2634                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_XTALCR")
    2635                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f)
    2636                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2637                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2638                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2639              
    2640              $C$DW$131       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2642                      .dwattr $C$DW$131, DW_AT_name("rsvd8")
    2643                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd8")
    2644                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    2645                      .dwattr $C$DW$131, DW_AT_bit_size(0x0f)
    2646                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2647                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2648              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   53

    2649                      .dwendtag $C$DW$T$23
    2650              
    2651              
    2652              $C$DW$T$24      .dwtag  DW_TAG_union_type
    2653                      .dwattr $C$DW$T$24, DW_AT_name("CLKCFGLOCK1_REG")
    2654                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    2655              $C$DW$132       .dwtag  DW_TAG_member
    2656                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$21)
    2657                      .dwattr $C$DW$132, DW_AT_name("all")
    2658                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_all")
    2659                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2660                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2661              
    2662              $C$DW$133       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$23)
    2664                      .dwattr $C$DW$133, DW_AT_name("bit")
    2665                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_bit")
    2666                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2668              
    2669                      .dwendtag $C$DW$T$24
    2670              
    2671              
    2672              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2673                      .dwattr $C$DW$T$25, DW_AT_name("CLKFAILCFG_BITS")
    2674                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    2675              $C$DW$134       .dwtag  DW_TAG_member
    2676                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2677                      .dwattr $C$DW$134, DW_AT_name("DCC0_ERROR_EN")
    2678                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_DCC0_ERROR_EN")
    2679                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0f)
    2680                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2681                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2682                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2683              
    2684              $C$DW$135       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2686                      .dwattr $C$DW$135, DW_AT_name("DCC1_ERROR_EN")
    2687                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_DCC1_ERROR_EN")
    2688                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0e)
    2689                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2690                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2691                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2692              
    2693              $C$DW$136       .dwtag  DW_TAG_member
    2694                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2695                      .dwattr $C$DW$136, DW_AT_name("rsvd1")
    2696                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd1")
    2697                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    2698                      .dwattr $C$DW$136, DW_AT_bit_size(0x0e)
    2699                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2700                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2701              
    2702              $C$DW$137       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   54

    2704                      .dwattr $C$DW$137, DW_AT_name("rsvd2")
    2705                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd2")
    2706                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2707                      .dwattr $C$DW$137, DW_AT_bit_size(0x10)
    2708                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2709                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2710              
    2711                      .dwendtag $C$DW$T$25
    2712              
    2713              
    2714              $C$DW$T$26      .dwtag  DW_TAG_union_type
    2715                      .dwattr $C$DW$T$26, DW_AT_name("CLKFAILCFG_REG")
    2716                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2717              $C$DW$138       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    2719                      .dwattr $C$DW$138, DW_AT_name("all")
    2720                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    2721                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2723              
    2724              $C$DW$139       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$25)
    2726                      .dwattr $C$DW$139, DW_AT_name("bit")
    2727                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    2728                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2729                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2730              
    2731                      .dwendtag $C$DW$T$26
    2732              
    2733              
    2734              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2735                      .dwattr $C$DW$T$27, DW_AT_name("CLKSRCCTL1_BITS")
    2736                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    2737              $C$DW$140       .dwtag  DW_TAG_member
    2738                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2739                      .dwattr $C$DW$140, DW_AT_name("OSCCLKSRCSEL")
    2740                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2741                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e)
    2742                      .dwattr $C$DW$140, DW_AT_bit_size(0x02)
    2743                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2745              
    2746              $C$DW$141       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2748                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    2749                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    2750                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0d)
    2751                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2752                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2753                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2754              
    2755              $C$DW$142       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2757                      .dwattr $C$DW$142, DW_AT_name("INTOSC2OFF")
    2758                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_INTOSC2OFF")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   55

    2759                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0c)
    2760                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2761                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2762                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2763              
    2764              $C$DW$143       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2766                      .dwattr $C$DW$143, DW_AT_name("rsvd2")
    2767                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd2")
    2768                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0b)
    2769                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2770                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2771                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2772              
    2773              $C$DW$144       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2775                      .dwattr $C$DW$144, DW_AT_name("WDHALTI")
    2776                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_WDHALTI")
    2777                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0a)
    2778                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2779                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2780                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2781              
    2782              $C$DW$145       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2784                      .dwattr $C$DW$145, DW_AT_name("rsvd3")
    2785                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd3")
    2786                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2787                      .dwattr $C$DW$145, DW_AT_bit_size(0x0a)
    2788                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2789                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2790              
    2791              $C$DW$146       .dwtag  DW_TAG_member
    2792                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2793                      .dwattr $C$DW$146, DW_AT_name("rsvd4")
    2794                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd4")
    2795                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2796                      .dwattr $C$DW$146, DW_AT_bit_size(0x10)
    2797                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2798                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2799              
    2800                      .dwendtag $C$DW$T$27
    2801              
    2802              
    2803              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2804                      .dwattr $C$DW$T$28, DW_AT_name("CLKSRCCTL1_REG")
    2805                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2806              $C$DW$147       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    2808                      .dwattr $C$DW$147, DW_AT_name("all")
    2809                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    2810                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2811                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2812              
    2813              $C$DW$148       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   56

    2814                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2815                      .dwattr $C$DW$148, DW_AT_name("bit")
    2816                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    2817                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2818                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2819              
    2820                      .dwendtag $C$DW$T$28
    2821              
    2822              
    2823              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2824                      .dwattr $C$DW$T$29, DW_AT_name("CLKSRCCTL2_BITS")
    2825                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2826              $C$DW$149       .dwtag  DW_TAG_member
    2827                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2828                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    2829                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    2830                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    2831                      .dwattr $C$DW$149, DW_AT_bit_size(0x02)
    2832                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2833                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2834              
    2835              $C$DW$150       .dwtag  DW_TAG_member
    2836                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2837                      .dwattr $C$DW$150, DW_AT_name("CANABCLKSEL")
    2838                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_CANABCLKSEL")
    2839                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0c)
    2840                      .dwattr $C$DW$150, DW_AT_bit_size(0x02)
    2841                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2842                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2843              
    2844              $C$DW$151       .dwtag  DW_TAG_member
    2845                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2846                      .dwattr $C$DW$151, DW_AT_name("rsvd2")
    2847                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd2")
    2848                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0a)
    2849                      .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    2850                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2851                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2852              
    2853              $C$DW$152       .dwtag  DW_TAG_member
    2854                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2855                      .dwattr $C$DW$152, DW_AT_name("rsvd3")
    2856                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd3")
    2857                      .dwattr $C$DW$152, DW_AT_bit_offset(0x08)
    2858                      .dwattr $C$DW$152, DW_AT_bit_size(0x02)
    2859                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2860                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2861              
    2862              $C$DW$153       .dwtag  DW_TAG_member
    2863                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2864                      .dwattr $C$DW$153, DW_AT_name("rsvd4")
    2865                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd4")
    2866                      .dwattr $C$DW$153, DW_AT_bit_offset(0x06)
    2867                      .dwattr $C$DW$153, DW_AT_bit_size(0x02)
    2868                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   57

    2869                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2870              
    2871              $C$DW$154       .dwtag  DW_TAG_member
    2872                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2873                      .dwattr $C$DW$154, DW_AT_name("MCANABCLKSEL")
    2874                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_MCANABCLKSEL")
    2875                      .dwattr $C$DW$154, DW_AT_bit_offset(0x04)
    2876                      .dwattr $C$DW$154, DW_AT_bit_size(0x02)
    2877                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2878                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2879              
    2880              $C$DW$155       .dwtag  DW_TAG_member
    2881                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2882                      .dwattr $C$DW$155, DW_AT_name("rsvd5")
    2883                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd5")
    2884                      .dwattr $C$DW$155, DW_AT_bit_offset(0x02)
    2885                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    2886                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2887                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2888              
    2889              $C$DW$156       .dwtag  DW_TAG_member
    2890                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2891                      .dwattr $C$DW$156, DW_AT_name("rsvd6")
    2892                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd6")
    2893                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    2894                      .dwattr $C$DW$156, DW_AT_bit_size(0x02)
    2895                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2896                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2897              
    2898              $C$DW$157       .dwtag  DW_TAG_member
    2899                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2900                      .dwattr $C$DW$157, DW_AT_name("rsvd7")
    2901                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd7")
    2902                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e)
    2903                      .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    2904                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2905                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2906              
    2907              $C$DW$158       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2909                      .dwattr $C$DW$158, DW_AT_name("rsvd8")
    2910                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd8")
    2911                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00)
    2912                      .dwattr $C$DW$158, DW_AT_bit_size(0x0e)
    2913                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2914                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2915              
    2916                      .dwendtag $C$DW$T$29
    2917              
    2918              
    2919              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2920                      .dwattr $C$DW$T$30, DW_AT_name("CLKSRCCTL2_REG")
    2921                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2922              $C$DW$159       .dwtag  DW_TAG_member
    2923                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   58

    2924                      .dwattr $C$DW$159, DW_AT_name("all")
    2925                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_all")
    2926                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2927                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2928              
    2929              $C$DW$160       .dwtag  DW_TAG_member
    2930                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$29)
    2931                      .dwattr $C$DW$160, DW_AT_name("bit")
    2932                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_bit")
    2933                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2934                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2935              
    2936                      .dwendtag $C$DW$T$30
    2937              
    2938              
    2939              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2940                      .dwattr $C$DW$T$31, DW_AT_name("CLKSRCCTL3_BITS")
    2941                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2942              $C$DW$161       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2944                      .dwattr $C$DW$161, DW_AT_name("XCLKOUTSEL")
    2945                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    2946                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c)
    2947                      .dwattr $C$DW$161, DW_AT_bit_size(0x04)
    2948                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2949                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2950              
    2951              $C$DW$162       .dwtag  DW_TAG_member
    2952                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2953                      .dwattr $C$DW$162, DW_AT_name("rsvd1")
    2954                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd1")
    2955                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    2956                      .dwattr $C$DW$162, DW_AT_bit_size(0x0c)
    2957                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2958                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2959              
    2960              $C$DW$163       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2962                      .dwattr $C$DW$163, DW_AT_name("rsvd2")
    2963                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd2")
    2964                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    2965                      .dwattr $C$DW$163, DW_AT_bit_size(0x10)
    2966                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2967                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2968              
    2969                      .dwendtag $C$DW$T$31
    2970              
    2971              
    2972              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2973                      .dwattr $C$DW$T$32, DW_AT_name("CLKSRCCTL3_REG")
    2974                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2975              $C$DW$164       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    2977                      .dwattr $C$DW$164, DW_AT_name("all")
    2978                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   59

    2979                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2980                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2981              
    2982              $C$DW$165       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$31)
    2984                      .dwattr $C$DW$165, DW_AT_name("bit")
    2985                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_bit")
    2986                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2987                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2988              
    2989                      .dwendtag $C$DW$T$32
    2990              
    2991              
    2992              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2993                      .dwattr $C$DW$T$33, DW_AT_name("CLKSTOPACK_BITS")
    2994                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2995              $C$DW$166       .dwtag  DW_TAG_member
    2996                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2997                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    2998                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    2999                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0f)
    3000                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    3001                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3002                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3003              
    3004              $C$DW$167       .dwtag  DW_TAG_member
    3005                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    3006                      .dwattr $C$DW$167, DW_AT_name("rsvd2")
    3007                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd2")
    3008                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0e)
    3009                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    3010                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3011                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3012              
    3013              $C$DW$168       .dwtag  DW_TAG_member
    3014                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    3015                      .dwattr $C$DW$168, DW_AT_name("rsvd3")
    3016                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd3")
    3017                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0d)
    3018                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    3019                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3020                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3021              
    3022              $C$DW$169       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    3024                      .dwattr $C$DW$169, DW_AT_name("rsvd4")
    3025                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd4")
    3026                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c)
    3027                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    3028                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3029                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3030              
    3031              $C$DW$170       .dwtag  DW_TAG_member
    3032                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    3033                      .dwattr $C$DW$170, DW_AT_name("rsvd5")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   60

    3034                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd5")
    3035                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0b)
    3036                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    3037                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3038                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3039              
    3040              $C$DW$171       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    3042                      .dwattr $C$DW$171, DW_AT_name("rsvd6")
    3043                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd6")
    3044                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0a)
    3045                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    3046                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3047                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3048              
    3049              $C$DW$172       .dwtag  DW_TAG_member
    3050                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    3051                      .dwattr $C$DW$172, DW_AT_name("rsvd7")
    3052                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd7")
    3053                      .dwattr $C$DW$172, DW_AT_bit_offset(0x08)
    3054                      .dwattr $C$DW$172, DW_AT_bit_size(0x02)
    3055                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3056                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3057              
    3058              $C$DW$173       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    3060                      .dwattr $C$DW$173, DW_AT_name("MCAN_A")
    3061                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_MCAN_A")
    3062                      .dwattr $C$DW$173, DW_AT_bit_offset(0x07)
    3063                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    3064                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3065                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3066              
    3067              $C$DW$174       .dwtag  DW_TAG_member
    3068                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    3069                      .dwattr $C$DW$174, DW_AT_name("rsvd8")
    3070                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd8")
    3071                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    3072                      .dwattr $C$DW$174, DW_AT_bit_size(0x07)
    3073                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3074                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3075              
    3076              $C$DW$175       .dwtag  DW_TAG_member
    3077                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    3078                      .dwattr $C$DW$175, DW_AT_name("rsvd9")
    3079                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd9")
    3080                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    3081                      .dwattr $C$DW$175, DW_AT_bit_size(0x10)
    3082                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3083                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3084              
    3085                      .dwendtag $C$DW$T$33
    3086              
    3087              
    3088              $C$DW$T$34      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   61

    3089                      .dwattr $C$DW$T$34, DW_AT_name("CLKSTOPACK_REG")
    3090                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    3091              $C$DW$176       .dwtag  DW_TAG_member
    3092                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    3093                      .dwattr $C$DW$176, DW_AT_name("all")
    3094                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_all")
    3095                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3096                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3097              
    3098              $C$DW$177       .dwtag  DW_TAG_member
    3099                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$33)
    3100                      .dwattr $C$DW$177, DW_AT_name("bit")
    3101                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_bit")
    3102                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3103                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3104              
    3105                      .dwendtag $C$DW$T$34
    3106              
    3107              
    3108              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3109                      .dwattr $C$DW$T$35, DW_AT_name("CLKSTOPREQ_BITS")
    3110                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3111              $C$DW$178       .dwtag  DW_TAG_member
    3112                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    3113                      .dwattr $C$DW$178, DW_AT_name("rsvd1")
    3114                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd1")
    3115                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0f)
    3116                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    3117                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3118                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3119              
    3120              $C$DW$179       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3122                      .dwattr $C$DW$179, DW_AT_name("rsvd2")
    3123                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd2")
    3124                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    3125                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    3126                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3127                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3128              
    3129              $C$DW$180       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    3131                      .dwattr $C$DW$180, DW_AT_name("rsvd3")
    3132                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd3")
    3133                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0d)
    3134                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    3135                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3136                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3137              
    3138              $C$DW$181       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3140                      .dwattr $C$DW$181, DW_AT_name("rsvd4")
    3141                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd4")
    3142                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0c)
    3143                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   62

    3144                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3145                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3146              
    3147              $C$DW$182       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3149                      .dwattr $C$DW$182, DW_AT_name("rsvd5")
    3150                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd5")
    3151                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0b)
    3152                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    3153                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3154                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3155              
    3156              $C$DW$183       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3158                      .dwattr $C$DW$183, DW_AT_name("rsvd6")
    3159                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd6")
    3160                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0a)
    3161                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    3162                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3163                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3164              
    3165              $C$DW$184       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3167                      .dwattr $C$DW$184, DW_AT_name("rsvd7")
    3168                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd7")
    3169                      .dwattr $C$DW$184, DW_AT_bit_offset(0x08)
    3170                      .dwattr $C$DW$184, DW_AT_bit_size(0x02)
    3171                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3172                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3173              
    3174              $C$DW$185       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3176                      .dwattr $C$DW$185, DW_AT_name("MCAN_A")
    3177                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_MCAN_A")
    3178                      .dwattr $C$DW$185, DW_AT_bit_offset(0x07)
    3179                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    3180                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3181                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3182              
    3183              $C$DW$186       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    3185                      .dwattr $C$DW$186, DW_AT_name("rsvd8")
    3186                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd8")
    3187                      .dwattr $C$DW$186, DW_AT_bit_offset(0x04)
    3188                      .dwattr $C$DW$186, DW_AT_bit_size(0x03)
    3189                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3190                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3191              
    3192              $C$DW$187       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3194                      .dwattr $C$DW$187, DW_AT_name("rsvd9")
    3195                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd9")
    3196                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    3197                      .dwattr $C$DW$187, DW_AT_bit_size(0x04)
    3198                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   63

    3199                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3200              
    3201              $C$DW$188       .dwtag  DW_TAG_member
    3202                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3203                      .dwattr $C$DW$188, DW_AT_name("KEY")
    3204                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_KEY")
    3205                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    3206                      .dwattr $C$DW$188, DW_AT_bit_size(0x10)
    3207                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3208                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3209              
    3210                      .dwendtag $C$DW$T$35
    3211              
    3212              
    3213              $C$DW$T$36      .dwtag  DW_TAG_union_type
    3214                      .dwattr $C$DW$T$36, DW_AT_name("CLKSTOPREQ_REG")
    3215                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    3216              $C$DW$189       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$21)
    3218                      .dwattr $C$DW$189, DW_AT_name("all")
    3219                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    3220                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3221                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3222              
    3223              $C$DW$190       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$35)
    3225                      .dwattr $C$DW$190, DW_AT_name("bit")
    3226                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    3227                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3228                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3229              
    3230                      .dwendtag $C$DW$T$36
    3231              
    3232              
    3233              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3234                      .dwattr $C$DW$T$41, DW_AT_name("CLK_CFG_REGS")
    3235                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x3e)
    3236              $C$DW$191       .dwtag  DW_TAG_member
    3237                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$37)
    3238                      .dwattr $C$DW$191, DW_AT_name("rsvd1")
    3239                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd1")
    3240                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3241                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3242              
    3243              $C$DW$192       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$24)
    3245                      .dwattr $C$DW$192, DW_AT_name("CLKCFGLOCK1")
    3246                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3247                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3248                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3249              
    3250              $C$DW$193       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$38)
    3252                      .dwattr $C$DW$193, DW_AT_name("rsvd2")
    3253                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   64

    3254                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3255                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3256              
    3257              $C$DW$194       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$28)
    3259                      .dwattr $C$DW$194, DW_AT_name("CLKSRCCTL1")
    3260                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3261                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3262                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3263              
    3264              $C$DW$195       .dwtag  DW_TAG_member
    3265                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$30)
    3266                      .dwattr $C$DW$195, DW_AT_name("CLKSRCCTL2")
    3267                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3268                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3269                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3270              
    3271              $C$DW$196       .dwtag  DW_TAG_member
    3272                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$32)
    3273                      .dwattr $C$DW$196, DW_AT_name("CLKSRCCTL3")
    3274                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3275                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3276                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3277              
    3278              $C$DW$197       .dwtag  DW_TAG_member
    3279                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$187)
    3280                      .dwattr $C$DW$197, DW_AT_name("SYSPLLCTL1")
    3281                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3282                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3283                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3284              
    3285              $C$DW$198       .dwtag  DW_TAG_member
    3286                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$38)
    3287                      .dwattr $C$DW$198, DW_AT_name("rsvd3")
    3288                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd3")
    3289                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3290                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3291              
    3292              $C$DW$199       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$189)
    3294                      .dwattr $C$DW$199, DW_AT_name("SYSPLLMULT")
    3295                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3296                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3297                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3298              
    3299              $C$DW$200       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$191)
    3301                      .dwattr $C$DW$200, DW_AT_name("SYSPLLSTS")
    3302                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3303                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3304                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3305              
    3306              $C$DW$201       .dwtag  DW_TAG_member
    3307                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$39)
    3308                      .dwattr $C$DW$201, DW_AT_name("rsvd4")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   65

    3309                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd4")
    3310                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3311                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3312              
    3313              $C$DW$202       .dwtag  DW_TAG_member
    3314                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$185)
    3315                      .dwattr $C$DW$202, DW_AT_name("SYSCLKDIVSEL")
    3316                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3317                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3318                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3319              
    3320              $C$DW$203       .dwtag  DW_TAG_member
    3321                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$22)
    3322                      .dwattr $C$DW$203, DW_AT_name("AUXCLKDIVSEL")
    3323                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3324                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3325                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3326              
    3327              $C$DW$204       .dwtag  DW_TAG_member
    3328                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$37)
    3329                      .dwattr $C$DW$204, DW_AT_name("rsvd5")
    3330                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd5")
    3331                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3332                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3333              
    3334              $C$DW$205       .dwtag  DW_TAG_member
    3335                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$208)
    3336                      .dwattr $C$DW$205, DW_AT_name("XCLKOUTDIVSEL")
    3337                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3338                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3339                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3340              
    3341              $C$DW$206       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$37)
    3343                      .dwattr $C$DW$206, DW_AT_name("rsvd6")
    3344                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd6")
    3345                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3346                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3347              
    3348              $C$DW$207       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$125)
    3350                      .dwattr $C$DW$207, DW_AT_name("LOSPCP")
    3351                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_LOSPCP")
    3352                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3353                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3354              
    3355              $C$DW$208       .dwtag  DW_TAG_member
    3356                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$133)
    3357                      .dwattr $C$DW$208, DW_AT_name("MCDCR")
    3358                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_MCDCR")
    3359                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3360                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3361              
    3362              $C$DW$209       .dwtag  DW_TAG_member
    3363                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$206)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   66

    3364                      .dwattr $C$DW$209, DW_AT_name("X1CNT")
    3365                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_X1CNT")
    3366                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3367                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3368              
    3369              $C$DW$210       .dwtag  DW_TAG_member
    3370                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$212)
    3371                      .dwattr $C$DW$210, DW_AT_name("XTALCR")
    3372                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_XTALCR")
    3373                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3374                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3375              
    3376              $C$DW$211       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$40)
    3378                      .dwattr $C$DW$211, DW_AT_name("rsvd7")
    3379                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd7")
    3380                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3381                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3382              
    3383              $C$DW$212       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$210)
    3385                      .dwattr $C$DW$212, DW_AT_name("XTALCR2")
    3386                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_XTALCR2")
    3387                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3388                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3389              
    3390              $C$DW$213       .dwtag  DW_TAG_member
    3391                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$26)
    3392                      .dwattr $C$DW$213, DW_AT_name("CLKFAILCFG")
    3393                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_CLKFAILCFG")
    3394                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3395                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3396              
    3397                      .dwendtag $C$DW$T$41
    3398              
    3399              $C$DW$214       .dwtag  DW_TAG_TI_far_type
    3400                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$41)
    3401              
    3402              $C$DW$T$215     .dwtag  DW_TAG_volatile_type
    3403                      .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$214)
    3404              
    3405              
    3406              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3407                      .dwattr $C$DW$T$42, DW_AT_name("CPUSYSLOCK1_BITS")
    3408                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    3409              $C$DW$215       .dwtag  DW_TAG_member
    3410                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    3411                      .dwattr $C$DW$215, DW_AT_name("rsvd1")
    3412                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_rsvd1")
    3413                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0f)
    3414                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    3415                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3416                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3417              
    3418              $C$DW$216       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   67

    3419                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3420                      .dwattr $C$DW$216, DW_AT_name("rsvd2")
    3421                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd2")
    3422                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0e)
    3423                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    3424                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3425                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3426              
    3427              $C$DW$217       .dwtag  DW_TAG_member
    3428                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3429                      .dwattr $C$DW$217, DW_AT_name("PIEVERRADDR")
    3430                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_PIEVERRADDR")
    3431                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0d)
    3432                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    3433                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3434                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3435              
    3436              $C$DW$218       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3438                      .dwattr $C$DW$218, DW_AT_name("PCLKCR0")
    3439                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PCLKCR0")
    3440                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0c)
    3441                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    3442                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3443                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3444              
    3445              $C$DW$219       .dwtag  DW_TAG_member
    3446                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3447                      .dwattr $C$DW$219, DW_AT_name("rsvd3")
    3448                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd3")
    3449                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0b)
    3450                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    3451                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3452                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3453              
    3454              $C$DW$220       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3456                      .dwattr $C$DW$220, DW_AT_name("PCLKCR2")
    3457                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_PCLKCR2")
    3458                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0a)
    3459                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    3460                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3461                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3462              
    3463              $C$DW$221       .dwtag  DW_TAG_member
    3464                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3465                      .dwattr $C$DW$221, DW_AT_name("PCLKCR3")
    3466                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PCLKCR3")
    3467                      .dwattr $C$DW$221, DW_AT_bit_offset(0x09)
    3468                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    3469                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3470                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3471              
    3472              $C$DW$222       .dwtag  DW_TAG_member
    3473                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   68

    3474                      .dwattr $C$DW$222, DW_AT_name("PCLKCR4")
    3475                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_PCLKCR4")
    3476                      .dwattr $C$DW$222, DW_AT_bit_offset(0x08)
    3477                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    3478                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3479                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3480              
    3481              $C$DW$223       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3483                      .dwattr $C$DW$223, DW_AT_name("rsvd4")
    3484                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd4")
    3485                      .dwattr $C$DW$223, DW_AT_bit_offset(0x07)
    3486                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    3487                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3488                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3489              
    3490              $C$DW$224       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3492                      .dwattr $C$DW$224, DW_AT_name("PCLKCR6")
    3493                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_PCLKCR6")
    3494                      .dwattr $C$DW$224, DW_AT_bit_offset(0x06)
    3495                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    3496                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3497                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3498              
    3499              $C$DW$225       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3501                      .dwattr $C$DW$225, DW_AT_name("PCLKCR7")
    3502                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_PCLKCR7")
    3503                      .dwattr $C$DW$225, DW_AT_bit_offset(0x05)
    3504                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    3505                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3506                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3507              
    3508              $C$DW$226       .dwtag  DW_TAG_member
    3509                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    3510                      .dwattr $C$DW$226, DW_AT_name("PCLKCR8")
    3511                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_PCLKCR8")
    3512                      .dwattr $C$DW$226, DW_AT_bit_offset(0x04)
    3513                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    3514                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3515                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3516              
    3517              $C$DW$227       .dwtag  DW_TAG_member
    3518                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    3519                      .dwattr $C$DW$227, DW_AT_name("PCLKCR9")
    3520                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_PCLKCR9")
    3521                      .dwattr $C$DW$227, DW_AT_bit_offset(0x03)
    3522                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    3523                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3524                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3525              
    3526              $C$DW$228       .dwtag  DW_TAG_member
    3527                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    3528                      .dwattr $C$DW$228, DW_AT_name("PCLKCR10")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   69

    3529                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_PCLKCR10")
    3530                      .dwattr $C$DW$228, DW_AT_bit_offset(0x02)
    3531                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    3532                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3533                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3534              
    3535              $C$DW$229       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    3537                      .dwattr $C$DW$229, DW_AT_name("rsvd5")
    3538                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_rsvd5")
    3539                      .dwattr $C$DW$229, DW_AT_bit_offset(0x01)
    3540                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    3541                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3542                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3543              
    3544              $C$DW$230       .dwtag  DW_TAG_member
    3545                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3546                      .dwattr $C$DW$230, DW_AT_name("rsvd6")
    3547                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_rsvd6")
    3548                      .dwattr $C$DW$230, DW_AT_bit_offset(0x00)
    3549                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    3550                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3551                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3552              
    3553              $C$DW$231       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    3555                      .dwattr $C$DW$231, DW_AT_name("PCLKCR13")
    3556                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_PCLKCR13")
    3557                      .dwattr $C$DW$231, DW_AT_bit_offset(0x0f)
    3558                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    3559                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3560                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3561              
    3562              $C$DW$232       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    3564                      .dwattr $C$DW$232, DW_AT_name("PCLKCR14")
    3565                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_PCLKCR14")
    3566                      .dwattr $C$DW$232, DW_AT_bit_offset(0x0e)
    3567                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    3568                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3569                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3570              
    3571              $C$DW$233       .dwtag  DW_TAG_member
    3572                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    3573                      .dwattr $C$DW$233, DW_AT_name("rsvd7")
    3574                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_rsvd7")
    3575                      .dwattr $C$DW$233, DW_AT_bit_offset(0x0d)
    3576                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    3577                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3578                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3579              
    3580              $C$DW$234       .dwtag  DW_TAG_member
    3581                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    3582                      .dwattr $C$DW$234, DW_AT_name("PCLKCR16")
    3583                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_PCLKCR16")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   70

    3584                      .dwattr $C$DW$234, DW_AT_bit_offset(0x0c)
    3585                      .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    3586                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3587                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3588              
    3589              $C$DW$235       .dwtag  DW_TAG_member
    3590                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    3591                      .dwattr $C$DW$235, DW_AT_name("rsvd8")
    3592                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_rsvd8")
    3593                      .dwattr $C$DW$235, DW_AT_bit_offset(0x0b)
    3594                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    3595                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3596                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3597              
    3598              $C$DW$236       .dwtag  DW_TAG_member
    3599                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3600                      .dwattr $C$DW$236, DW_AT_name("LPMCR")
    3601                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_LPMCR")
    3602                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0a)
    3603                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    3604                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3605                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3606              
    3607              $C$DW$237       .dwtag  DW_TAG_member
    3608                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3609                      .dwattr $C$DW$237, DW_AT_name("GPIOLPMSEL0")
    3610                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    3611                      .dwattr $C$DW$237, DW_AT_bit_offset(0x09)
    3612                      .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    3613                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3614                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3615              
    3616              $C$DW$238       .dwtag  DW_TAG_member
    3617                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3618                      .dwattr $C$DW$238, DW_AT_name("GPIOLPMSEL1")
    3619                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    3620                      .dwattr $C$DW$238, DW_AT_bit_offset(0x08)
    3621                      .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    3622                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3623                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3624              
    3625              $C$DW$239       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    3627                      .dwattr $C$DW$239, DW_AT_name("PCLKCR17")
    3628                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_PCLKCR17")
    3629                      .dwattr $C$DW$239, DW_AT_bit_offset(0x07)
    3630                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    3631                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3632                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3633              
    3634              $C$DW$240       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    3636                      .dwattr $C$DW$240, DW_AT_name("PCLKCR18")
    3637                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_PCLKCR18")
    3638                      .dwattr $C$DW$240, DW_AT_bit_offset(0x06)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{78ED34F4-3C3B-4D89-8F5D-B64BD43A86E6} PAGE   71

    3639                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    3640                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3641                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3642              
    3643              $C$DW$241       .dwtag  DW_TAG_member
    3644                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    3645                      .dwattr $C$DW$241, DW_AT_name("PCLKCR19")
    3646                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_PCLKCR19")
    3647                      .dwattr $C$DW$241, DW_AT_bit_offset(0x05)
    3648                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    3649                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3650                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3651              
    3652              $C$DW$242       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3654                      .dwattr $C$DW$242, DW_AT_name("PCLKCR20")
    3655                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_PCLKCR20")
    3656                      .dwattr $C$DW$242, DW_AT_bit_offset(0x04)
    3657                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    3658                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3659                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3660              
    3661              $C$DW$243       .dwtag  DW_TAG_member
    3662                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3663                      .dwattr $C$DW$243, DW_AT_name("PCLKCR21")
    3664                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_PCLKCR21")
    3665                      .dwattr $C$DW$243, DW_AT_bit_offset(0x03)
    3666                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    3667                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3668                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3669              
    3670              $C$DW$244       .dwtag  DW_TAG_member
    3671                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3672                      .dwattr $C$DW$244, DW_AT_name("PCLKCR22")
    3673                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_PCLKCR22")
    3674                      .dwattr $C$DW$244, DW_AT_bit_offset(0x02)
