TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DeviceSupport/source/f28003x_adc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__eallow")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___eallow")

     147 0000000e FF62          LSR       AL,T                  ; [CPU_ALU] |83| 
     148 0000000f 3CA6          MOVB      AR6,AL.LSB            ; [CPU_ALU] |83| 
     149 00000010 7E3B!         MOV       @$BLOCKED(_AdcaRegs)+59,AR6 ; [CPU_ALU] |83| 
     150 00000011 761F!         MOVW      DP,#_AdcbRegs+59      ; [CPU_ARAU] 
         00000012 0000 
     151                      .dwpsn  file "../DeviceSupport/source/f28003x_adc.c",line 93,column 5,is_stmt,isa 0
     152 00000013 883B!         MOVZ      AR6,@$BLOCKED(_AdcbRegs)+59 ; [CPU_ALU] |93| 
     153 00000014 92CD          MOV       AL,*+XAR5[1]          ; [CPU_ALU] |93| 
     154 00000015 FF62          LSR       AL,T                  ; [CPU_ALU] |93| 
     155 00000016 3CA6          MOVB      AR6,AL.LSB            ; [CPU_ALU] |93| 
     156 00000017 7E3B!         MOV       @$BLOCKED(_AdcbRegs)+59,AR6 ; [CPU_ALU] |93| 
     157 00000018 761F!         MOVW      DP,#_AdccRegs+59      ; [CPU_ARAU] 
         00000019 0000 
     158                      .dwpsn  file "../DeviceSupport/source/f28003x_adc.c",line 103,column 5,is_stmt,isa 0
     159 0000001a 883B!         MOVZ      AR6,@$BLOCKED(_AdccRegs)+59 ; [CPU_ALU] |103| 
     160 0000001b 92D5          MOV       AL,*+XAR5[2]          ; [CPU_ALU] |103| 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE    4

     161 0000001c FF62          LSR       AL,T                  ; [CPU_ALU] |103| 
     162 0000001d 3CA6          MOVB      AR6,AL.LSB            ; [CPU_ALU] |103| 
     163                      .dwpsn  file "../DeviceSupport/source/f28003x_adc.c",line 108,column 5,is_stmt,isa 0
     164 0000001e 9101          ANDB      AH,#1                 ; [CPU_ALU] |108| 
     165                      .dwpsn  file "../DeviceSupport/source/f28003x_adc.c",line 103,column 5,is_stmt,isa 0
     166 0000001f 7E3B!         MOV       @$BLOCKED(_AdccRegs)+59,AR6 ; [CPU_FPU] |103| 
     167 00000020 761F!         MOVW      DP,#_AnalogSubsysRegs+104 ; [CPU_ARAU] 
         00000021 0001 
     168                      .dwpsn  file "../DeviceSupport/source/f28003x_adc.c",line 108,column 5,is_stmt,isa 0
     169 00000022 CC28!         AND       AL,@$BLOCKED(_AnalogSubsysRegs)+104,#0xfffe ; [CPU_FPU] |108| 
         00000023 FFFE 
     170 00000024 CBA9          OR        AH,AL                 ; [CPU_ALU] |108| 
     171                      .dwpsn  file "../DeviceSupport/source/f28003x_adc.c",line 113,column 5,is_stmt,isa 0
     172 00000025 CCA4          AND       AL,AR4,#0x0001        ; [CPU_FPU] |113| 
         00000026 0001 
     173 00000027 FF87          LSL       AL,8                  ; [CPU_ALU] |113| 
     174                      .dwpsn  file "../DeviceSupport/source/f28003x_adc.c",line 108,column 5,is_stmt,isa 0
     175 00000028 9728!         MOV       @$BLOCKED(_AnalogSubsysRegs)+104,AH ; [CPU_FPU] |108| 
     176                      .dwpsn  file "../DeviceSupport/source/f28003x_adc.c",line 113,column 5,is_stmt,isa 0
     177 00000029 CD28!         AND       AH,@$BLOCKED(_AnalogSubsysRegs)+104,#0xfeff ; [CPU_FPU] |113| 
         0000002a FEFF 
     178 0000002b CAA8          OR        AL,AH                 ; [CPU_ALU] |113| 
     179 0000002c 9628!         MOV       @$BLOCKED(_AnalogSubsysRegs)+104,AL ; [CPU_ALU] |113| 
     180                      .dwpsn  file "../DeviceSupport/source/f28003x_adc.c",line 115,column 5,is_stmt,isa 0
     181 0000002d 761A          EDIS      ; [CPU_ALU] |115| 
     182              $C$DW$14        .dwtag  DW_TAG_TI_branch
     183                      .dwattr $C$DW$14, DW_AT_low_pc(0x00)
     184                      .dwattr $C$DW$14, DW_AT_TI_return
     185              
     186 0000002e 0006          LRETR     ; [CPU_ALU] 
     187                      ; return occurs ; [] 
     188                      .dwattr $C$DW$7, DW_AT_TI_end_file("../DeviceSupport/source/f28003x_adc.c")
     189                      .dwattr $C$DW$7, DW_AT_TI_end_line(0x74)
     190                      .dwattr $C$DW$7, DW_AT_TI_end_column(0x01)
     191                      .dwendentry
     192                      .dwendtag $C$DW$7
     193              
     194              ;**************************************************************
     195              ;* UNDEFINED EXTERNAL REFERENCES                              *
     196              ;**************************************************************
     197                      .global _AdcaRegs
     198                      .global _AdcbRegs
     199                      .global _AdccRegs
     200                      .global _AnalogSubsysRegs
     201              
     202              ;***************************************************************
     203              ;* TYPE INFORMATION                                            *
     204              ;***************************************************************
     205              
     206              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     207                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
     208                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     209              $C$DW$15        .dwtag  DW_TAG_member
     210                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     211                      .dwattr $C$DW$15, DW_AT_name("BURSTTRIGSEL")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE    5

     212                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
     213                      .dwattr $C$DW$15, DW_AT_bit_offset(0x0a)
     214                      .dwattr $C$DW$15, DW_AT_bit_size(0x06)
     215                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     216                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     217              
     218              $C$DW$16        .dwtag  DW_TAG_member
     219                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     220                      .dwattr $C$DW$16, DW_AT_name("rsvd1")
     221                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_rsvd1")
     222                      .dwattr $C$DW$16, DW_AT_bit_offset(0x08)
     223                      .dwattr $C$DW$16, DW_AT_bit_size(0x02)
     224                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     225                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     226              
     227              $C$DW$17        .dwtag  DW_TAG_member
     228                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     229                      .dwattr $C$DW$17, DW_AT_name("BURSTSIZE")
     230                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_BURSTSIZE")
     231                      .dwattr $C$DW$17, DW_AT_bit_offset(0x04)
     232                      .dwattr $C$DW$17, DW_AT_bit_size(0x04)
     233                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     234                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     235              
     236              $C$DW$18        .dwtag  DW_TAG_member
     237                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     238                      .dwattr $C$DW$18, DW_AT_name("rsvd2")
     239                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_rsvd2")
     240                      .dwattr $C$DW$18, DW_AT_bit_offset(0x01)
     241                      .dwattr $C$DW$18, DW_AT_bit_size(0x03)
     242                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     243                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     244              
     245              $C$DW$19        .dwtag  DW_TAG_member
     246                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     247                      .dwattr $C$DW$19, DW_AT_name("BURSTEN")
     248                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_BURSTEN")
     249                      .dwattr $C$DW$19, DW_AT_bit_offset(0x00)
     250                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     251                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     252                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     253              
     254                      .dwendtag $C$DW$T$20
     255              
     256              
     257              $C$DW$T$21      .dwtag  DW_TAG_union_type
     258                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
     259                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     260              $C$DW$20        .dwtag  DW_TAG_member
     261                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     262                      .dwattr $C$DW$20, DW_AT_name("all")
     263                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_all")
     264                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     265                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     266              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE    6

     267              $C$DW$21        .dwtag  DW_TAG_member
     268                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$20)
     269                      .dwattr $C$DW$21, DW_AT_name("bit")
     270                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_bit")
     271                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     272                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     273              
     274                      .dwendtag $C$DW$T$21
     275              
     276              
     277              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     278                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
     279                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     280              $C$DW$22        .dwtag  DW_TAG_member
     281                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     282                      .dwattr $C$DW$22, DW_AT_name("FREECOUNT")
     283                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_FREECOUNT")
     284                      .dwattr $C$DW$22, DW_AT_bit_offset(0x04)
     285                      .dwattr $C$DW$22, DW_AT_bit_size(0x0c)
     286                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     287                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     288              
     289              $C$DW$23        .dwtag  DW_TAG_member
     290                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     291                      .dwattr $C$DW$23, DW_AT_name("rsvd1")
     292                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_rsvd1")
     293                      .dwattr $C$DW$23, DW_AT_bit_offset(0x00)
     294                      .dwattr $C$DW$23, DW_AT_bit_size(0x04)
     295                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     296                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     297              
     298                      .dwendtag $C$DW$T$22
     299              
     300              
     301              $C$DW$T$23      .dwtag  DW_TAG_union_type
     302                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
     303                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     304              $C$DW$24        .dwtag  DW_TAG_member
     305                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     306                      .dwattr $C$DW$24, DW_AT_name("all")
     307                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_all")
     308                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     310              
     311              $C$DW$25        .dwtag  DW_TAG_member
     312                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$22)
     313                      .dwattr $C$DW$25, DW_AT_name("bit")
     314                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_bit")
     315                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     316                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     317              
     318                      .dwendtag $C$DW$T$23
     319              
     320              
     321              $C$DW$T$24      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE    7

     322                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
     323                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     324              $C$DW$26        .dwtag  DW_TAG_member
     325                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     326                      .dwattr $C$DW$26, DW_AT_name("rsvd1")
     327                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd1")
     328                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e)
     329                      .dwattr $C$DW$26, DW_AT_bit_size(0x02)
     330                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     331                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     332              
     333              $C$DW$27        .dwtag  DW_TAG_member
     334                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     335                      .dwattr $C$DW$27, DW_AT_name("INTPULSEPOS")
     336                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_INTPULSEPOS")
     337                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0d)
     338                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     339                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     341              
     342              $C$DW$28        .dwtag  DW_TAG_member
     343                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     344                      .dwattr $C$DW$28, DW_AT_name("rsvd2")
     345                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd2")
     346                      .dwattr $C$DW$28, DW_AT_bit_offset(0x09)
     347                      .dwattr $C$DW$28, DW_AT_bit_size(0x04)
     348                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     349                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     350              
     351              $C$DW$29        .dwtag  DW_TAG_member
     352                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     353                      .dwattr $C$DW$29, DW_AT_name("ADCPWDNZ")
     354                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_ADCPWDNZ")
     355                      .dwattr $C$DW$29, DW_AT_bit_offset(0x08)
     356                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     357                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     358                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     359              
     360              $C$DW$30        .dwtag  DW_TAG_member
     361                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     362                      .dwattr $C$DW$30, DW_AT_name("ADCBSYCHN")
     363                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_ADCBSYCHN")
     364                      .dwattr $C$DW$30, DW_AT_bit_offset(0x04)
     365                      .dwattr $C$DW$30, DW_AT_bit_size(0x04)
     366                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     367                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     368              
     369              $C$DW$31        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     371                      .dwattr $C$DW$31, DW_AT_name("rsvd3")
     372                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd3")
     373                      .dwattr $C$DW$31, DW_AT_bit_offset(0x03)
     374                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     375                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     376                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE    8

     377              
     378              $C$DW$32        .dwtag  DW_TAG_member
     379                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     380                      .dwattr $C$DW$32, DW_AT_name("ADCBSY")
     381                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_ADCBSY")
     382                      .dwattr $C$DW$32, DW_AT_bit_offset(0x02)
     383                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     384                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     385                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     386              
     387              $C$DW$33        .dwtag  DW_TAG_member
     388                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     389                      .dwattr $C$DW$33, DW_AT_name("rsvd4")
     390                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd4")
     391                      .dwattr $C$DW$33, DW_AT_bit_offset(0x00)
     392                      .dwattr $C$DW$33, DW_AT_bit_size(0x02)
     393                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     394                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     395              
     396                      .dwendtag $C$DW$T$24
     397              
     398              
     399              $C$DW$T$25      .dwtag  DW_TAG_union_type
     400                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
     401                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     402              $C$DW$34        .dwtag  DW_TAG_member
     403                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     404                      .dwattr $C$DW$34, DW_AT_name("all")
     405                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_all")
     406                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     407                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     408              
     409              $C$DW$35        .dwtag  DW_TAG_member
     410                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$24)
     411                      .dwattr $C$DW$35, DW_AT_name("bit")
     412                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_bit")
     413                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     414                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     415              
     416                      .dwendtag $C$DW$T$25
     417              
     418              
     419              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     420                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
     421                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     422              $C$DW$36        .dwtag  DW_TAG_member
     423                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     424                      .dwattr $C$DW$36, DW_AT_name("PRESCALE")
     425                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_PRESCALE")
     426                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0c)
     427                      .dwattr $C$DW$36, DW_AT_bit_size(0x04)
     428                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     429                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     430              
     431              $C$DW$37        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE    9

     432                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     433                      .dwattr $C$DW$37, DW_AT_name("rsvd1")
     434                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd1")
     435                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0a)
     436                      .dwattr $C$DW$37, DW_AT_bit_size(0x02)
     437                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     438                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     439              
     440              $C$DW$38        .dwtag  DW_TAG_member
     441                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     442                      .dwattr $C$DW$38, DW_AT_name("rsvd2")
     443                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd2")
     444                      .dwattr $C$DW$38, DW_AT_bit_offset(0x09)
     445                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     446                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     447                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     448              
     449              $C$DW$39        .dwtag  DW_TAG_member
     450                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     451                      .dwattr $C$DW$39, DW_AT_name("rsvd3")
     452                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd3")
     453                      .dwattr $C$DW$39, DW_AT_bit_offset(0x08)
     454                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     455                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     456                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     457              
     458              $C$DW$40        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     460                      .dwattr $C$DW$40, DW_AT_name("rsvd4")
     461                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd4")
     462                      .dwattr $C$DW$40, DW_AT_bit_offset(0x03)
     463                      .dwattr $C$DW$40, DW_AT_bit_size(0x05)
     464                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     465                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     466              
     467              $C$DW$41        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$41, DW_AT_name("rsvd5")
     470                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd5")
     471                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     472                      .dwattr $C$DW$41, DW_AT_bit_size(0x03)
     473                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     475              
     476                      .dwendtag $C$DW$T$26
     477              
     478              
     479              $C$DW$T$27      .dwtag  DW_TAG_union_type
     480                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
     481                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     482              $C$DW$42        .dwtag  DW_TAG_member
     483                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     484                      .dwattr $C$DW$42, DW_AT_name("all")
     485                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     486                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   10

     487                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     488              
     489              $C$DW$43        .dwtag  DW_TAG_member
     490                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$26)
     491                      .dwattr $C$DW$43, DW_AT_name("bit")
     492                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     493                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     494                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     495              
     496                      .dwendtag $C$DW$T$27
     497              
     498              
     499              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     500                      .dwattr $C$DW$T$28, DW_AT_name("ADCDACLOOPBACK_BITS")
     501                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     502              $C$DW$44        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$44, DW_AT_name("ENLB2ADCA")
     505                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_ENLB2ADCA")
     506                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0f)
     507                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     508                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     509                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     510              
     511              $C$DW$45        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$45, DW_AT_name("ENLB2ADCB")
     514                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_ENLB2ADCB")
     515                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0e)
     516                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     517                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     518                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     519              
     520              $C$DW$46        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$46, DW_AT_name("ENLB2ADCC")
     523                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_ENLB2ADCC")
     524                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0d)
     525                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     526                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     527                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529              $C$DW$47        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     531                      .dwattr $C$DW$47, DW_AT_name("rsvd1")
     532                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd1")
     533                      .dwattr $C$DW$47, DW_AT_bit_offset(0x00)
     534                      .dwattr $C$DW$47, DW_AT_bit_size(0x0d)
     535                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     537              
     538              $C$DW$48        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     540                      .dwattr $C$DW$48, DW_AT_name("KEY")
     541                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_KEY")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   11

     542                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00)
     543                      .dwattr $C$DW$48, DW_AT_bit_size(0x10)
     544                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     545                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     546              
     547                      .dwendtag $C$DW$T$28
     548              
     549              
     550              $C$DW$T$30      .dwtag  DW_TAG_union_type
     551                      .dwattr $C$DW$T$30, DW_AT_name("ADCDACLOOPBACK_REG")
     552                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     553              $C$DW$49        .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$29)
     555                      .dwattr $C$DW$49, DW_AT_name("all")
     556                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_all")
     557                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     558                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     559              
     560              $C$DW$50        .dwtag  DW_TAG_member
     561                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$28)
     562                      .dwattr $C$DW$50, DW_AT_name("bit")
     563                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_bit")
     564                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     565                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     566              
     567                      .dwendtag $C$DW$T$30
     568              
     569              
     570              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     571                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTCLR_BITS")
     572                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     573              $C$DW$51        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     575                      .dwattr $C$DW$51, DW_AT_name("PPB1TRIPHI")
     576                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     577                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0f)
     578                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     579                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     580                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     581              
     582              $C$DW$52        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$52, DW_AT_name("PPB1TRIPLO")
     585                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     586                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0e)
     587                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     588                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     590              
     591              $C$DW$53        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$53, DW_AT_name("PPB1ZERO")
     594                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PPB1ZERO")
     595                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0d)
     596                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   12

     597                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     598                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     599              
     600              $C$DW$54        .dwtag  DW_TAG_member
     601                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     602                      .dwattr $C$DW$54, DW_AT_name("rsvd1")
     603                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd1")
     604                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0c)
     605                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     606                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     608              
     609              $C$DW$55        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     611                      .dwattr $C$DW$55, DW_AT_name("PPB2TRIPHI")
     612                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     613                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0b)
     614                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     615                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     617              
     618              $C$DW$56        .dwtag  DW_TAG_member
     619                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     620                      .dwattr $C$DW$56, DW_AT_name("PPB2TRIPLO")
     621                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     622                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0a)
     623                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     624                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     626              
     627              $C$DW$57        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     629                      .dwattr $C$DW$57, DW_AT_name("PPB2ZERO")
     630                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PPB2ZERO")
     631                      .dwattr $C$DW$57, DW_AT_bit_offset(0x09)
     632                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     633                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     634                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     635              
     636              $C$DW$58        .dwtag  DW_TAG_member
     637                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     638                      .dwattr $C$DW$58, DW_AT_name("rsvd2")
     639                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd2")
     640                      .dwattr $C$DW$58, DW_AT_bit_offset(0x08)
     641                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     642                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     644              
     645              $C$DW$59        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     647                      .dwattr $C$DW$59, DW_AT_name("PPB3TRIPHI")
     648                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PPB3TRIPHI")
     649                      .dwattr $C$DW$59, DW_AT_bit_offset(0x07)
     650                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     651                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   13

     652                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     653              
     654              $C$DW$60        .dwtag  DW_TAG_member
     655                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     656                      .dwattr $C$DW$60, DW_AT_name("PPB3TRIPLO")
     657                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     658                      .dwattr $C$DW$60, DW_AT_bit_offset(0x06)
     659                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     660                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     661                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     662              
     663              $C$DW$61        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     665                      .dwattr $C$DW$61, DW_AT_name("PPB3ZERO")
     666                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PPB3ZERO")
     667                      .dwattr $C$DW$61, DW_AT_bit_offset(0x05)
     668                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     669                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     670                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     671              
     672              $C$DW$62        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     674                      .dwattr $C$DW$62, DW_AT_name("rsvd3")
     675                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd3")
     676                      .dwattr $C$DW$62, DW_AT_bit_offset(0x04)
     677                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     678                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     680              
     681              $C$DW$63        .dwtag  DW_TAG_member
     682                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     683                      .dwattr $C$DW$63, DW_AT_name("PPB4TRIPHI")
     684                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PPB4TRIPHI")
     685                      .dwattr $C$DW$63, DW_AT_bit_offset(0x03)
     686                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     687                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     689              
     690              $C$DW$64        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     692                      .dwattr $C$DW$64, DW_AT_name("PPB4TRIPLO")
     693                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PPB4TRIPLO")
     694                      .dwattr $C$DW$64, DW_AT_bit_offset(0x02)
     695                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     696                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     698              
     699              $C$DW$65        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     701                      .dwattr $C$DW$65, DW_AT_name("PPB4ZERO")
     702                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_PPB4ZERO")
     703                      .dwattr $C$DW$65, DW_AT_bit_offset(0x01)
     704                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     705                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     706                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   14

     707              
     708              $C$DW$66        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     710                      .dwattr $C$DW$66, DW_AT_name("rsvd4")
     711                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd4")
     712                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00)
     713                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     714                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     715                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     716              
     717                      .dwendtag $C$DW$T$31
     718              
     719              
     720              $C$DW$T$32      .dwtag  DW_TAG_union_type
     721                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTCLR_REG")
     722                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     723              $C$DW$67        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     725                      .dwattr $C$DW$67, DW_AT_name("all")
     726                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_all")
     727                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     728                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     729              
     730              $C$DW$68        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$31)
     732                      .dwattr $C$DW$68, DW_AT_name("bit")
     733                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_bit")
     734                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     735                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     736              
     737                      .dwendtag $C$DW$T$32
     738              
     739              
     740              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     741                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTINTSEL_BITS")
     742                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     743              $C$DW$69        .dwtag  DW_TAG_member
     744                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     745                      .dwattr $C$DW$69, DW_AT_name("PPB1TRIPHI")
     746                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     747                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0f)
     748                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     749                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752              $C$DW$70        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$70, DW_AT_name("PPB1TRIPLO")
     755                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     756                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0e)
     757                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     758                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     759                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     760              
     761              $C$DW$71        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   15

     762                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     763                      .dwattr $C$DW$71, DW_AT_name("PPB1ZERO")
     764                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PPB1ZERO")
     765                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0d)
     766                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     767                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     768                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     769              
     770              $C$DW$72        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     772                      .dwattr $C$DW$72, DW_AT_name("rsvd1")
     773                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd1")
     774                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0c)
     775                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     776                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     777                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     778              
     779              $C$DW$73        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     781                      .dwattr $C$DW$73, DW_AT_name("PPB2TRIPHI")
     782                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     783                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0b)
     784                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     785                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     786                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     787              
     788              $C$DW$74        .dwtag  DW_TAG_member
     789                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     790                      .dwattr $C$DW$74, DW_AT_name("PPB2TRIPLO")
     791                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     792                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0a)
     793                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     794                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     796              
     797              $C$DW$75        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     799                      .dwattr $C$DW$75, DW_AT_name("PPB2ZERO")
     800                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_PPB2ZERO")
     801                      .dwattr $C$DW$75, DW_AT_bit_offset(0x09)
     802                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     803                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     804                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     805              
     806              $C$DW$76        .dwtag  DW_TAG_member
     807                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     808                      .dwattr $C$DW$76, DW_AT_name("rsvd2")
     809                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd2")
     810                      .dwattr $C$DW$76, DW_AT_bit_offset(0x08)
     811                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
     812                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     813                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     814              
     815              $C$DW$77        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   16

     817                      .dwattr $C$DW$77, DW_AT_name("PPB3TRIPHI")
     818                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_PPB3TRIPHI")
     819                      .dwattr $C$DW$77, DW_AT_bit_offset(0x07)
     820                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
     821                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824              $C$DW$78        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     826                      .dwattr $C$DW$78, DW_AT_name("PPB3TRIPLO")
     827                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     828                      .dwattr $C$DW$78, DW_AT_bit_offset(0x06)
     829                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
     830                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     831                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     832              
     833              $C$DW$79        .dwtag  DW_TAG_member
     834                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     835                      .dwattr $C$DW$79, DW_AT_name("PPB3ZERO")
     836                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PPB3ZERO")
     837                      .dwattr $C$DW$79, DW_AT_bit_offset(0x05)
     838                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     839                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     840                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     841              
     842              $C$DW$80        .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     844                      .dwattr $C$DW$80, DW_AT_name("rsvd3")
     845                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd3")
     846                      .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
     847                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     848                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     850              
     851              $C$DW$81        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     853                      .dwattr $C$DW$81, DW_AT_name("PPB4TRIPHI")
     854                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_PPB4TRIPHI")
     855                      .dwattr $C$DW$81, DW_AT_bit_offset(0x03)
     856                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     857                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     858                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     859              
     860              $C$DW$82        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$82, DW_AT_name("PPB4TRIPLO")
     863                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PPB4TRIPLO")
     864                      .dwattr $C$DW$82, DW_AT_bit_offset(0x02)
     865                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     866                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     868              
     869              $C$DW$83        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     871                      .dwattr $C$DW$83, DW_AT_name("PPB4ZERO")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   17

     872                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_PPB4ZERO")
     873                      .dwattr $C$DW$83, DW_AT_bit_offset(0x01)
     874                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     875                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     877              
     878              $C$DW$84        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     880                      .dwattr $C$DW$84, DW_AT_name("rsvd4")
     881                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd4")
     882                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
     883                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     884                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     886              
     887                      .dwendtag $C$DW$T$33
     888              
     889              
     890              $C$DW$T$34      .dwtag  DW_TAG_union_type
     891                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTINTSEL_REG")
     892                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     893              $C$DW$85        .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     895                      .dwattr $C$DW$85, DW_AT_name("all")
     896                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_all")
     897                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     899              
     900              $C$DW$86        .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$33)
     902                      .dwattr $C$DW$86, DW_AT_name("bit")
     903                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_bit")
     904                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     906              
     907                      .dwendtag $C$DW$T$34
     908              
     909              
     910              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     911                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSEL_BITS")
     912                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     913              $C$DW$87        .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     915                      .dwattr $C$DW$87, DW_AT_name("PPB1TRIPHI")
     916                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     917                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0f)
     918                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     919                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     921              
     922              $C$DW$88        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     924                      .dwattr $C$DW$88, DW_AT_name("PPB1TRIPLO")
     925                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     926                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   18

     927                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     928                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     930              
     931              $C$DW$89        .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     933                      .dwattr $C$DW$89, DW_AT_name("PPB1ZERO")
     934                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PPB1ZERO")
     935                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0d)
     936                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     937                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     938                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     939              
     940              $C$DW$90        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     942                      .dwattr $C$DW$90, DW_AT_name("rsvd1")
     943                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd1")
     944                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0c)
     945                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
     946                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     948              
     949              $C$DW$91        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$91, DW_AT_name("PPB2TRIPHI")
     952                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     953                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0b)
     954                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     955                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958              $C$DW$92        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     960                      .dwattr $C$DW$92, DW_AT_name("PPB2TRIPLO")
     961                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     962                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0a)
     963                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
     964                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     966              
     967              $C$DW$93        .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     969                      .dwattr $C$DW$93, DW_AT_name("PPB2ZERO")
     970                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_PPB2ZERO")
     971                      .dwattr $C$DW$93, DW_AT_bit_offset(0x09)
     972                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
     973                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     975              
     976              $C$DW$94        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$94, DW_AT_name("rsvd2")
     979                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd2")
     980                      .dwattr $C$DW$94, DW_AT_bit_offset(0x08)
     981                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   19

     982                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     984              
     985              $C$DW$95        .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     987                      .dwattr $C$DW$95, DW_AT_name("PPB3TRIPHI")
     988                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_PPB3TRIPHI")
     989                      .dwattr $C$DW$95, DW_AT_bit_offset(0x07)
     990                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
     991                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     993              
     994              $C$DW$96        .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     996                      .dwattr $C$DW$96, DW_AT_name("PPB3TRIPLO")
     997                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     998                      .dwattr $C$DW$96, DW_AT_bit_offset(0x06)
     999                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1000                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1002              
    1003              $C$DW$97        .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$97, DW_AT_name("PPB3ZERO")
    1006                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_PPB3ZERO")
    1007                      .dwattr $C$DW$97, DW_AT_bit_offset(0x05)
    1008                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1009                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1011              
    1012              $C$DW$98        .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1014                      .dwattr $C$DW$98, DW_AT_name("rsvd3")
    1015                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd3")
    1016                      .dwattr $C$DW$98, DW_AT_bit_offset(0x04)
    1017                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1018                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1020              
    1021              $C$DW$99        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1023                      .dwattr $C$DW$99, DW_AT_name("PPB4TRIPHI")
    1024                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1025                      .dwattr $C$DW$99, DW_AT_bit_offset(0x03)
    1026                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1027                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030              $C$DW$100       .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1032                      .dwattr $C$DW$100, DW_AT_name("PPB4TRIPLO")
    1033                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1034                      .dwattr $C$DW$100, DW_AT_bit_offset(0x02)
    1035                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1036                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   20

    1037                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1038              
    1039              $C$DW$101       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$101, DW_AT_name("PPB4ZERO")
    1042                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_PPB4ZERO")
    1043                      .dwattr $C$DW$101, DW_AT_bit_offset(0x01)
    1044                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1045                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1047              
    1048              $C$DW$102       .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1050                      .dwattr $C$DW$102, DW_AT_name("rsvd4")
    1051                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd4")
    1052                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1053                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1054                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057                      .dwendtag $C$DW$T$35
    1058              
    1059              
    1060              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1061                      .dwattr $C$DW$T$36, DW_AT_name("ADCEVTSEL_REG")
    1062                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1063              $C$DW$103       .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1065                      .dwattr $C$DW$103, DW_AT_name("all")
    1066                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    1067                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1069              
    1070              $C$DW$104       .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$35)
    1072                      .dwattr $C$DW$104, DW_AT_name("bit")
    1073                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    1074                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1076              
    1077                      .dwendtag $C$DW$T$36
    1078              
    1079              
    1080              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1081                      .dwattr $C$DW$T$37, DW_AT_name("ADCEVTSTAT_BITS")
    1082                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1083              $C$DW$105       .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1085                      .dwattr $C$DW$105, DW_AT_name("PPB1TRIPHI")
    1086                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1087                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0f)
    1088                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1089                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1091              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   21

    1092              $C$DW$106       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$106, DW_AT_name("PPB1TRIPLO")
    1095                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1096                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0e)
    1097                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1098                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1100              
    1101              $C$DW$107       .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1103                      .dwattr $C$DW$107, DW_AT_name("PPB1ZERO")
    1104                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PPB1ZERO")
    1105                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0d)
    1106                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1107                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1109              
    1110              $C$DW$108       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$108, DW_AT_name("rsvd1")
    1113                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd1")
    1114                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0c)
    1115                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1116                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1117                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1118              
    1119              $C$DW$109       .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$109, DW_AT_name("PPB2TRIPHI")
    1122                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1123                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0b)
    1124                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1125                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1127              
    1128              $C$DW$110       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1130                      .dwattr $C$DW$110, DW_AT_name("PPB2TRIPLO")
    1131                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1132                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0a)
    1133                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1134                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$111       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$111, DW_AT_name("PPB2ZERO")
    1140                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PPB2ZERO")
    1141                      .dwattr $C$DW$111, DW_AT_bit_offset(0x09)
    1142                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1143                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1145              
    1146              $C$DW$112       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   22

    1147                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1148                      .dwattr $C$DW$112, DW_AT_name("rsvd2")
    1149                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd2")
    1150                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08)
    1151                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1152                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155              $C$DW$113       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$113, DW_AT_name("PPB3TRIPHI")
    1158                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1159                      .dwattr $C$DW$113, DW_AT_bit_offset(0x07)
    1160                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164              $C$DW$114       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$114, DW_AT_name("PPB3TRIPLO")
    1167                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1168                      .dwattr $C$DW$114, DW_AT_bit_offset(0x06)
    1169                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1170                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$115       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$115, DW_AT_name("PPB3ZERO")
    1176                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PPB3ZERO")
    1177                      .dwattr $C$DW$115, DW_AT_bit_offset(0x05)
    1178                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1179                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182              $C$DW$116       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$116, DW_AT_name("rsvd3")
    1185                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd3")
    1186                      .dwattr $C$DW$116, DW_AT_bit_offset(0x04)
    1187                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1188                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1190              
    1191              $C$DW$117       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$117, DW_AT_name("PPB4TRIPHI")
    1194                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1195                      .dwattr $C$DW$117, DW_AT_bit_offset(0x03)
    1196                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1197                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$118       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   23

    1202                      .dwattr $C$DW$118, DW_AT_name("PPB4TRIPLO")
    1203                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1204                      .dwattr $C$DW$118, DW_AT_bit_offset(0x02)
    1205                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1206                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209              $C$DW$119       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1211                      .dwattr $C$DW$119, DW_AT_name("PPB4ZERO")
    1212                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PPB4ZERO")
    1213                      .dwattr $C$DW$119, DW_AT_bit_offset(0x01)
    1214                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1215                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1217              
    1218              $C$DW$120       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1220                      .dwattr $C$DW$120, DW_AT_name("rsvd4")
    1221                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd4")
    1222                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    1223                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1224                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227                      .dwendtag $C$DW$T$37
    1228              
    1229              
    1230              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1231                      .dwattr $C$DW$T$38, DW_AT_name("ADCEVTSTAT_REG")
    1232                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1233              $C$DW$121       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$121, DW_AT_name("all")
    1236                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    1237                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1239              
    1240              $C$DW$122       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$37)
    1242                      .dwattr $C$DW$122, DW_AT_name("bit")
    1243                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    1244                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1246              
    1247                      .dwendtag $C$DW$T$38
    1248              
    1249              
    1250              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1251                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLGCLR_BITS")
    1252                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1253              $C$DW$123       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$123, DW_AT_name("ADCINT1")
    1256                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ADCINT1")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   24

    1257                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0f)
    1258                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1259                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262              $C$DW$124       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$124, DW_AT_name("ADCINT2")
    1265                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ADCINT2")
    1266                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e)
    1267                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1268                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$125       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$125, DW_AT_name("ADCINT3")
    1274                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ADCINT3")
    1275                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0d)
    1276                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1277                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280              $C$DW$126       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$126, DW_AT_name("ADCINT4")
    1283                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_ADCINT4")
    1284                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0c)
    1285                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1286                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289              $C$DW$127       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$127, DW_AT_name("rsvd1")
    1292                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd1")
    1293                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00)
    1294                      .dwattr $C$DW$127, DW_AT_bit_size(0x0c)
    1295                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298                      .dwendtag $C$DW$T$39
    1299              
    1300              
    1301              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1302                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTFLGCLR_REG")
    1303                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1304              $C$DW$128       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1306                      .dwattr $C$DW$128, DW_AT_name("all")
    1307                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_all")
    1308                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1310              
    1311              $C$DW$129       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   25

    1312                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$39)
    1313                      .dwattr $C$DW$129, DW_AT_name("bit")
    1314                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_bit")
    1315                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318                      .dwendtag $C$DW$T$40
    1319              
    1320              
    1321              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1322                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTFLG_BITS")
    1323                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1324              $C$DW$130       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1326                      .dwattr $C$DW$130, DW_AT_name("ADCINT1")
    1327                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADCINT1")
    1328                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f)
    1329                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1330                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1332              
    1333              $C$DW$131       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$131, DW_AT_name("ADCINT2")
    1336                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCINT2")
    1337                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e)
    1338                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1339                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$132       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$132, DW_AT_name("ADCINT3")
    1345                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADCINT3")
    1346                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0d)
    1347                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1348                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1350              
    1351              $C$DW$133       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1353                      .dwattr $C$DW$133, DW_AT_name("ADCINT4")
    1354                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCINT4")
    1355                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c)
    1356                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1357                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360              $C$DW$134       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    1363                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    1364                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    1365                      .dwattr $C$DW$134, DW_AT_bit_size(0x0c)
    1366                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   26

    1367                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1368              
    1369                      .dwendtag $C$DW$T$41
    1370              
    1371              
    1372              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1373                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTFLG_REG")
    1374                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1375              $C$DW$135       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$135, DW_AT_name("all")
    1378                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    1379                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1381              
    1382              $C$DW$136       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$41)
    1384                      .dwattr $C$DW$136, DW_AT_name("bit")
    1385                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    1386                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1388              
    1389                      .dwendtag $C$DW$T$42
    1390              
    1391              
    1392              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1393                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVFCLR_BITS")
    1394                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1395              $C$DW$137       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$137, DW_AT_name("ADCINT1")
    1398                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ADCINT1")
    1399                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0f)
    1400                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1401                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$138       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$138, DW_AT_name("ADCINT2")
    1407                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCINT2")
    1408                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0e)
    1409                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1410                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$139       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$139, DW_AT_name("ADCINT3")
    1416                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ADCINT3")
    1417                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0d)
    1418                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1419                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1421              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   27

    1422              $C$DW$140       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$140, DW_AT_name("ADCINT4")
    1425                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCINT4")
    1426                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0c)
    1427                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1428                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$141       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1434                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    1435                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    1436                      .dwattr $C$DW$141, DW_AT_bit_size(0x0c)
    1437                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440                      .dwendtag $C$DW$T$43
    1441              
    1442              
    1443              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1444                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTOVFCLR_REG")
    1445                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1446              $C$DW$142       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1448                      .dwattr $C$DW$142, DW_AT_name("all")
    1449                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    1450                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1452              
    1453              $C$DW$143       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$43)
    1455                      .dwattr $C$DW$143, DW_AT_name("bit")
    1456                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    1457                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460                      .dwendtag $C$DW$T$44
    1461              
    1462              
    1463              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1464                      .dwattr $C$DW$T$45, DW_AT_name("ADCINTOVF_BITS")
    1465                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1466              $C$DW$144       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1468                      .dwattr $C$DW$144, DW_AT_name("ADCINT1")
    1469                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ADCINT1")
    1470                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0f)
    1471                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1472                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$145       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E7A85329-0D98-429C-8BDB-182719521AEF} PAGE   28

    1477                      .dwattr $C$DW$145, DW_AT_name("ADCINT2")
    1478                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCINT2")
    1479                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e)
    1480                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1481                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1483              
