TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DeviceSupport/source/f28003x_epwm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__eallow")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___eallow")

     588                      .dwpsn  file "../DeviceSupport/source/f28003x_epwm.c",line 306,column 5,is_stmt,isa 0
     589              $C$DW$23        .dwtag  DW_TAG_TI_branch
     590                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     591                      .dwattr $C$DW$23, DW_AT_name("_InitEPwm3Gpio")
     592                      .dwattr $C$DW$23, DW_AT_TI_call
     593              
     594 00000004 7640+         LCR       #_InitEPwm3Gpio       ; [CPU_ALU] |306| 
         00000005 0000 
     595                      ; call occurs [#_InitEPwm3Gpio] ; [] |306| 
     596                      .dwpsn  file "../DeviceSupport/source/f28003x_epwm.c",line 307,column 5,is_stmt,isa 0
     597              $C$DW$24        .dwtag  DW_TAG_TI_branch
     598                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     599                      .dwattr $C$DW$24, DW_AT_name("_InitEPwm4Gpio")
     600                      .dwattr $C$DW$24, DW_AT_TI_call
     601              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   13

     602 00000006 7640+         LCR       #_InitEPwm4Gpio       ; [CPU_ALU] |307| 
         00000007 0000 
     603                      ; call occurs [#_InitEPwm4Gpio] ; [] |307| 
     604                      .dwpsn  file "../DeviceSupport/source/f28003x_epwm.c",line 308,column 5,is_stmt,isa 0
     605              $C$DW$25        .dwtag  DW_TAG_TI_branch
     606                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     607                      .dwattr $C$DW$25, DW_AT_name("_InitEPwm5Gpio")
     608                      .dwattr $C$DW$25, DW_AT_TI_call
     609              
     610 00000008 7640+         LCR       #_InitEPwm5Gpio       ; [CPU_ALU] |308| 
         00000009 0000 
     611                      ; call occurs [#_InitEPwm5Gpio] ; [] |308| 
     612                      .dwpsn  file "../DeviceSupport/source/f28003x_epwm.c",line 309,column 5,is_stmt,isa 0
     613              $C$DW$26        .dwtag  DW_TAG_TI_branch
     614                      .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     615                      .dwattr $C$DW$26, DW_AT_name("_InitEPwm6Gpio")
     616                      .dwattr $C$DW$26, DW_AT_TI_call
     617              
     618 0000000a 7640+         LCR       #_InitEPwm6Gpio       ; [CPU_ALU] |309| 
         0000000b 0000 
     619                      ; call occurs [#_InitEPwm6Gpio] ; [] |309| 
     620                      .dwpsn  file "../DeviceSupport/source/f28003x_epwm.c",line 310,column 5,is_stmt,isa 0
     621              $C$DW$27        .dwtag  DW_TAG_TI_branch
     622                      .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     623                      .dwattr $C$DW$27, DW_AT_name("_InitEPwm7Gpio")
     624                      .dwattr $C$DW$27, DW_AT_TI_call
     625              
     626 0000000c 7640+         LCR       #_InitEPwm7Gpio       ; [CPU_ALU] |310| 
         0000000d 0000 
     627                      ; call occurs [#_InitEPwm7Gpio] ; [] |310| 
     628                      .dwpsn  file "../DeviceSupport/source/f28003x_epwm.c",line 311,column 5,is_stmt,isa 0
     629              $C$DW$28        .dwtag  DW_TAG_TI_branch
     630                      .dwattr $C$DW$28, DW_AT_low_pc(0x00)
     631                      .dwattr $C$DW$28, DW_AT_name("_InitEPwm8Gpio")
     632                      .dwattr $C$DW$28, DW_AT_TI_call
     633              
     634 0000000e 7640+         LCR       #_InitEPwm8Gpio       ; [CPU_ALU] |311| 
         0000000f 0000 
     635                      ; call occurs [#_InitEPwm8Gpio] ; [] |311| 
     636              $C$DW$29        .dwtag  DW_TAG_TI_branch
     637                      .dwattr $C$DW$29, DW_AT_low_pc(0x00)
     638                      .dwattr $C$DW$29, DW_AT_TI_return
     639              
     640 00000010 0006          LRETR     ; [CPU_ALU] 
     641                      ; return occurs ; [] 
     642                      .dwattr $C$DW$20, DW_AT_TI_end_file("../DeviceSupport/source/f28003x_epwm.c")
     643                      .dwattr $C$DW$20, DW_AT_TI_end_line(0x138)
     644                      .dwattr $C$DW$20, DW_AT_TI_end_column(0x01)
     645                      .dwendentry
     646                      .dwendtag $C$DW$20
     647              
     648              ;**************************************************************
     649              ;* UNDEFINED EXTERNAL REFERENCES                              *
     650              ;**************************************************************
     651                      .global _GpioCtrlRegs
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   14

     652              
     653              ;***************************************************************
     654              ;* TYPE INFORMATION                                            *
     655              ;***************************************************************
     656              
     657              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     658                      .dwattr $C$DW$T$20, DW_AT_name("GPAAMSEL_BITS")
     659                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     660              $C$DW$30        .dwtag  DW_TAG_member
     661                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     662                      .dwattr $C$DW$30, DW_AT_name("rsvd1")
     663                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd1")
     664                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0f)
     665                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     666                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     668              
     669              $C$DW$31        .dwtag  DW_TAG_member
     670                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     671                      .dwattr $C$DW$31, DW_AT_name("rsvd2")
     672                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd2")
     673                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0e)
     674                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     675                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     676                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     677              
     678              $C$DW$32        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     680                      .dwattr $C$DW$32, DW_AT_name("rsvd3")
     681                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd3")
     682                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0d)
     683                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     684                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     685                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     686              
     687              $C$DW$33        .dwtag  DW_TAG_member
     688                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     689                      .dwattr $C$DW$33, DW_AT_name("rsvd4")
     690                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd4")
     691                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0c)
     692                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     693                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     694                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     695              
     696              $C$DW$34        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     698                      .dwattr $C$DW$34, DW_AT_name("rsvd5")
     699                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd5")
     700                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0b)
     701                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     702                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     704              
     705              $C$DW$35        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   15

     707                      .dwattr $C$DW$35, DW_AT_name("rsvd6")
     708                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd6")
     709                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a)
     710                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     711                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$36        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$36, DW_AT_name("rsvd7")
     717                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd7")
     718                      .dwattr $C$DW$36, DW_AT_bit_offset(0x09)
     719                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     720                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     721                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     722              
     723              $C$DW$37        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     725                      .dwattr $C$DW$37, DW_AT_name("rsvd8")
     726                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd8")
     727                      .dwattr $C$DW$37, DW_AT_bit_offset(0x08)
     728                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     729                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     731              
     732              $C$DW$38        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     734                      .dwattr $C$DW$38, DW_AT_name("rsvd9")
     735                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd9")
     736                      .dwattr $C$DW$38, DW_AT_bit_offset(0x07)
     737                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     738                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     740              
     741              $C$DW$39        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     743                      .dwattr $C$DW$39, DW_AT_name("rsvd10")
     744                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd10")
     745                      .dwattr $C$DW$39, DW_AT_bit_offset(0x06)
     746                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     747                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     748                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     749              
     750              $C$DW$40        .dwtag  DW_TAG_member
     751                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     752                      .dwattr $C$DW$40, DW_AT_name("rsvd11")
     753                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd11")
     754                      .dwattr $C$DW$40, DW_AT_bit_offset(0x05)
     755                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     756                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$41        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$41, DW_AT_name("rsvd12")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   16

     762                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd12")
     763                      .dwattr $C$DW$41, DW_AT_bit_offset(0x04)
     764                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     765                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     767              
     768              $C$DW$42        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     770                      .dwattr $C$DW$42, DW_AT_name("rsvd13")
     771                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd13")
     772                      .dwattr $C$DW$42, DW_AT_bit_offset(0x03)
     773                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     774                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     775                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     776              
     777              $C$DW$43        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$43, DW_AT_name("rsvd14")
     780                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd14")
     781                      .dwattr $C$DW$43, DW_AT_bit_offset(0x02)
     782                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     783                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     785              
     786              $C$DW$44        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$44, DW_AT_name("rsvd15")
     789                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_rsvd15")
     790                      .dwattr $C$DW$44, DW_AT_bit_offset(0x01)
     791                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     792                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     793                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     794              
     795              $C$DW$45        .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     797                      .dwattr $C$DW$45, DW_AT_name("rsvd16")
     798                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd16")
     799                      .dwattr $C$DW$45, DW_AT_bit_offset(0x00)
     800                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     801                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804              $C$DW$46        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$46, DW_AT_name("rsvd17")
     807                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd17")
     808                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0f)
     809                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     810                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     811                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     812              
     813              $C$DW$47        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     815                      .dwattr $C$DW$47, DW_AT_name("rsvd18")
     816                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd18")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   17

     817                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0e)
     818                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     819                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     820                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     821              
     822              $C$DW$48        .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     824                      .dwattr $C$DW$48, DW_AT_name("rsvd19")
     825                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd19")
     826                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0d)
     827                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     828                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     829                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831              $C$DW$49        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$49, DW_AT_name("rsvd20")
     834                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd20")
     835                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0c)
     836                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     837                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     838                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     839              
     840              $C$DW$50        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     842                      .dwattr $C$DW$50, DW_AT_name("GPIO20")
     843                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO20")
     844                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0b)
     845                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     846                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     847                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     848              
     849              $C$DW$51        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$51, DW_AT_name("GPIO21")
     852                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO21")
     853                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0a)
     854                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     855                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     856                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     857              
     858              $C$DW$52        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$52, DW_AT_name("rsvd21")
     861                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd21")
     862                      .dwattr $C$DW$52, DW_AT_bit_offset(0x09)
     863                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     864                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     865                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     866              
     867              $C$DW$53        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$53, DW_AT_name("rsvd22")
     870                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd22")
     871                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   18

     872                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     873                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     874                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     875              
     876              $C$DW$54        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$54, DW_AT_name("rsvd23")
     879                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd23")
     880                      .dwattr $C$DW$54, DW_AT_bit_offset(0x07)
     881                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     882                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     883                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     884              
     885              $C$DW$55        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$55, DW_AT_name("rsvd24")
     888                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd24")
     889                      .dwattr $C$DW$55, DW_AT_bit_offset(0x06)
     890                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     891                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     892                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     893              
     894              $C$DW$56        .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$56, DW_AT_name("rsvd25")
     897                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd25")
     898                      .dwattr $C$DW$56, DW_AT_bit_offset(0x05)
     899                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     900                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     901                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     902              
     903              $C$DW$57        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$57, DW_AT_name("rsvd26")
     906                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd26")
     907                      .dwattr $C$DW$57, DW_AT_bit_offset(0x04)
     908                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     909                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     910                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     911              
     912              $C$DW$58        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$58, DW_AT_name("rsvd27")
     915                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd27")
     916                      .dwattr $C$DW$58, DW_AT_bit_offset(0x03)
     917                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     918                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     919                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     920              
     921              $C$DW$59        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$59, DW_AT_name("rsvd28")
     924                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd28")
     925                      .dwattr $C$DW$59, DW_AT_bit_offset(0x02)
     926                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   19

     927                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     928                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     929              
     930              $C$DW$60        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$60, DW_AT_name("rsvd29")
     933                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd29")
     934                      .dwattr $C$DW$60, DW_AT_bit_offset(0x01)
     935                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     936                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     937                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     938              
     939              $C$DW$61        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     941                      .dwattr $C$DW$61, DW_AT_name("rsvd30")
     942                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd30")
     943                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
     944                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     945                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     946                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     947              
     948                      .dwendtag $C$DW$T$20
     949              
     950              
     951              $C$DW$T$22      .dwtag  DW_TAG_union_type
     952                      .dwattr $C$DW$T$22, DW_AT_name("GPAAMSEL_REG")
     953                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     954              $C$DW$62        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$21)
     956                      .dwattr $C$DW$62, DW_AT_name("all")
     957                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
     958                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     960              
     961              $C$DW$63        .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$20)
     963                      .dwattr $C$DW$63, DW_AT_name("bit")
     964                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
     965                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     967              
     968                      .dwendtag $C$DW$T$22
     969              
     970              
     971              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     972                      .dwattr $C$DW$T$23, DW_AT_name("GPACR_BITS")
     973                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     974              $C$DW$64        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$64, DW_AT_name("GPIO0")
     977                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO0")
     978                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0f)
     979                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     980                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   20

     982              
     983              $C$DW$65        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$65, DW_AT_name("GPIO1")
     986                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO1")
     987                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0e)
     988                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     989                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     991              
     992              $C$DW$66        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$66, DW_AT_name("GPIO2")
     995                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO2")
     996                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0d)
     997                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     998                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001              $C$DW$67        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$67, DW_AT_name("GPIO3")
    1004                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO3")
    1005                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0c)
    1006                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1007                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010              $C$DW$68        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$68, DW_AT_name("GPIO4")
    1013                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO4")
    1014                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0b)
    1015                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1018              
    1019              $C$DW$69        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$69, DW_AT_name("GPIO5")
    1022                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO5")
    1023                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0a)
    1024                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1025                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1027              
    1028              $C$DW$70        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$70, DW_AT_name("GPIO6")
    1031                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO6")
    1032                      .dwattr $C$DW$70, DW_AT_bit_offset(0x09)
    1033                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1036              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   21

    1037              $C$DW$71        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$71, DW_AT_name("GPIO7")
    1040                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO7")
    1041                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08)
    1042                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1043                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1045              
    1046              $C$DW$72        .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$72, DW_AT_name("GPIO8")
    1049                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO8")
    1050                      .dwattr $C$DW$72, DW_AT_bit_offset(0x07)
    1051                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1052                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1054              
    1055              $C$DW$73        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$73, DW_AT_name("GPIO9")
    1058                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO9")
    1059                      .dwattr $C$DW$73, DW_AT_bit_offset(0x06)
    1060                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1061                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1063              
    1064              $C$DW$74        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$74, DW_AT_name("GPIO10")
    1067                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO10")
    1068                      .dwattr $C$DW$74, DW_AT_bit_offset(0x05)
    1069                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1070                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$75        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$75, DW_AT_name("GPIO11")
    1076                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO11")
    1077                      .dwattr $C$DW$75, DW_AT_bit_offset(0x04)
    1078                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1079                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$76        .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$76, DW_AT_name("GPIO12")
    1085                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO12")
    1086                      .dwattr $C$DW$76, DW_AT_bit_offset(0x03)
    1087                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1088                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1090              
    1091              $C$DW$77        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   22

    1092                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$77, DW_AT_name("GPIO13")
    1094                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO13")
    1095                      .dwattr $C$DW$77, DW_AT_bit_offset(0x02)
    1096                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1097                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$78        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$78, DW_AT_name("GPIO14")
    1103                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO14")
    1104                      .dwattr $C$DW$78, DW_AT_bit_offset(0x01)
    1105                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1106                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$79        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$79, DW_AT_name("GPIO15")
    1112                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO15")
    1113                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1114                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1115                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1117              
    1118              $C$DW$80        .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1120                      .dwattr $C$DW$80, DW_AT_name("GPIO16")
    1121                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO16")
    1122                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0f)
    1123                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1124                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1125                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127              $C$DW$81        .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$81, DW_AT_name("GPIO17")
    1130                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO17")
    1131                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0e)
    1132                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1133                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1134                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136              $C$DW$82        .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$82, DW_AT_name("GPIO18")
    1139                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO18")
    1140                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0d)
    1141                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1142                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1143                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145              $C$DW$83        .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   23

    1147                      .dwattr $C$DW$83, DW_AT_name("GPIO19")
    1148                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO19")
    1149                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0c)
    1150                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1151                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1152                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1153              
    1154              $C$DW$84        .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1156                      .dwattr $C$DW$84, DW_AT_name("GPIO20")
    1157                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO20")
    1158                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0b)
    1159                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1160                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1161                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1162              
    1163              $C$DW$85        .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$85, DW_AT_name("GPIO21")
    1166                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO21")
    1167                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0a)
    1168                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1169                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1170                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172              $C$DW$86        .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$86, DW_AT_name("GPIO22")
    1175                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO22")
    1176                      .dwattr $C$DW$86, DW_AT_bit_offset(0x09)
    1177                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1178                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1179                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1180              
    1181              $C$DW$87        .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$87, DW_AT_name("GPIO23")
    1184                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO23")
    1185                      .dwattr $C$DW$87, DW_AT_bit_offset(0x08)
    1186                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1187                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1188                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1189              
    1190              $C$DW$88        .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$88, DW_AT_name("GPIO24")
    1193                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO24")
    1194                      .dwattr $C$DW$88, DW_AT_bit_offset(0x07)
    1195                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1196                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1197                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1198              
    1199              $C$DW$89        .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1201                      .dwattr $C$DW$89, DW_AT_name("GPIO25")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   24

    1202                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO25")
    1203                      .dwattr $C$DW$89, DW_AT_bit_offset(0x06)
    1204                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1205                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1206                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1207              
    1208              $C$DW$90        .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$90, DW_AT_name("GPIO26")
    1211                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO26")
    1212                      .dwattr $C$DW$90, DW_AT_bit_offset(0x05)
    1213                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1214                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1215                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1216              
    1217              $C$DW$91        .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$91, DW_AT_name("GPIO27")
    1220                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO27")
    1221                      .dwattr $C$DW$91, DW_AT_bit_offset(0x04)
    1222                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1223                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1224                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1225              
    1226              $C$DW$92        .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$92, DW_AT_name("GPIO28")
    1229                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO28")
    1230                      .dwattr $C$DW$92, DW_AT_bit_offset(0x03)
    1231                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1232                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1233                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235              $C$DW$93        .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$93, DW_AT_name("GPIO29")
    1238                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO29")
    1239                      .dwattr $C$DW$93, DW_AT_bit_offset(0x02)
    1240                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1241                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1242                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1243              
    1244              $C$DW$94        .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$94, DW_AT_name("GPIO30")
    1247                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO30")
    1248                      .dwattr $C$DW$94, DW_AT_bit_offset(0x01)
    1249                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1250                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1251                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1252              
    1253              $C$DW$95        .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$95, DW_AT_name("GPIO31")
    1256                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO31")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   25

    1257                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
    1258                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1259                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1260                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262                      .dwendtag $C$DW$T$23
    1263              
    1264              
    1265              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1266                      .dwattr $C$DW$T$24, DW_AT_name("GPACR_REG")
    1267                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1268              $C$DW$96        .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
    1270                      .dwattr $C$DW$96, DW_AT_name("all")
    1271                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
    1272                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$97        .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$23)
    1277                      .dwattr $C$DW$97, DW_AT_name("bit")
    1278                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
    1279                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1280                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1281              
    1282                      .dwendtag $C$DW$T$24
    1283              
    1284              
    1285              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1286                      .dwattr $C$DW$T$25, DW_AT_name("GPACSEL1_BITS")
    1287                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1288              $C$DW$98        .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1290                      .dwattr $C$DW$98, DW_AT_name("GPIO0")
    1291                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO0")
    1292                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1293                      .dwattr $C$DW$98, DW_AT_bit_size(0x04)
    1294                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$99        .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1299                      .dwattr $C$DW$99, DW_AT_name("GPIO1")
    1300                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO1")
    1301                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08)
    1302                      .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1303                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306              $C$DW$100       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$100, DW_AT_name("GPIO2")
    1309                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO2")
    1310                      .dwattr $C$DW$100, DW_AT_bit_offset(0x04)
    1311                      .dwattr $C$DW$100, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   26

    1312                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1313                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1314              
    1315              $C$DW$101       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$101, DW_AT_name("GPIO3")
    1318                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO3")
    1319                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1320                      .dwattr $C$DW$101, DW_AT_bit_size(0x04)
    1321                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324              $C$DW$102       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1326                      .dwattr $C$DW$102, DW_AT_name("GPIO4")
    1327                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO4")
    1328                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0c)
    1329                      .dwattr $C$DW$102, DW_AT_bit_size(0x04)
    1330                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1331                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1332              
    1333              $C$DW$103       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$103, DW_AT_name("GPIO5")
    1336                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO5")
    1337                      .dwattr $C$DW$103, DW_AT_bit_offset(0x08)
    1338                      .dwattr $C$DW$103, DW_AT_bit_size(0x04)
    1339                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1340                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$104       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$104, DW_AT_name("GPIO6")
    1345                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO6")
    1346                      .dwattr $C$DW$104, DW_AT_bit_offset(0x04)
    1347                      .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1348                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1349                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1350              
    1351              $C$DW$105       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1353                      .dwattr $C$DW$105, DW_AT_name("GPIO7")
    1354                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO7")
    1355                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1356                      .dwattr $C$DW$105, DW_AT_bit_size(0x04)
    1357                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1358                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360                      .dwendtag $C$DW$T$25
    1361              
    1362              
    1363              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1364                      .dwattr $C$DW$T$26, DW_AT_name("GPACSEL1_REG")
    1365                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1366              $C$DW$106       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   27

    1367                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1368                      .dwattr $C$DW$106, DW_AT_name("all")
    1369                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1370                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1371                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1372              
    1373              $C$DW$107       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$25)
    1375                      .dwattr $C$DW$107, DW_AT_name("bit")
    1376                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1377                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1379              
    1380                      .dwendtag $C$DW$T$26
    1381              
    1382              
    1383              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1384                      .dwattr $C$DW$T$27, DW_AT_name("GPACSEL2_BITS")
    1385                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1386              $C$DW$108       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$108, DW_AT_name("GPIO8")
    1389                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO8")
    1390                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0c)
    1391                      .dwattr $C$DW$108, DW_AT_bit_size(0x04)
    1392                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$109       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$109, DW_AT_name("GPIO9")
    1398                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO9")
    1399                      .dwattr $C$DW$109, DW_AT_bit_offset(0x08)
    1400                      .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1401                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$110       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$110, DW_AT_name("GPIO10")
    1407                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO10")
    1408                      .dwattr $C$DW$110, DW_AT_bit_offset(0x04)
    1409                      .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1410                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$111       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$111, DW_AT_name("GPIO11")
    1416                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO11")
    1417                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1418                      .dwattr $C$DW$111, DW_AT_bit_size(0x04)
    1419                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1421              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   28

    1422              $C$DW$112       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$112, DW_AT_name("GPIO12")
    1425                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO12")
    1426                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c)
    1427                      .dwattr $C$DW$112, DW_AT_bit_size(0x04)
    1428                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1429                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$113       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$113, DW_AT_name("GPIO13")
    1434                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO13")
    1435                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08)
    1436                      .dwattr $C$DW$113, DW_AT_bit_size(0x04)
    1437                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1438                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$114       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$114, DW_AT_name("GPIO14")
    1443                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO14")
    1444                      .dwattr $C$DW$114, DW_AT_bit_offset(0x04)
    1445                      .dwattr $C$DW$114, DW_AT_bit_size(0x04)
    1446                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1447                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449              $C$DW$115       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1451                      .dwattr $C$DW$115, DW_AT_name("GPIO15")
    1452                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO15")
    1453                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1454                      .dwattr $C$DW$115, DW_AT_bit_size(0x04)
    1455                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1456                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1457              
    1458                      .dwendtag $C$DW$T$27
    1459              
    1460              
    1461              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1462                      .dwattr $C$DW$T$28, DW_AT_name("GPACSEL2_REG")
    1463                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1464              $C$DW$116       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    1466                      .dwattr $C$DW$116, DW_AT_name("all")
    1467                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_all")
    1468                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1469                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1470              
    1471              $C$DW$117       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$27)
    1473                      .dwattr $C$DW$117, DW_AT_name("bit")
    1474                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bit")
    1475                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   29

    1477              
    1478                      .dwendtag $C$DW$T$28
    1479              
    1480              
    1481              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1482                      .dwattr $C$DW$T$29, DW_AT_name("GPACSEL3_BITS")
    1483                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1484              $C$DW$118       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$118, DW_AT_name("GPIO16")
    1487                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO16")
    1488                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0c)
    1489                      .dwattr $C$DW$118, DW_AT_bit_size(0x04)
    1490                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$119       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$119, DW_AT_name("GPIO17")
    1496                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO17")
    1497                      .dwattr $C$DW$119, DW_AT_bit_offset(0x08)
    1498                      .dwattr $C$DW$119, DW_AT_bit_size(0x04)
    1499                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502              $C$DW$120       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$120, DW_AT_name("GPIO18")
    1505                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO18")
    1506                      .dwattr $C$DW$120, DW_AT_bit_offset(0x04)
    1507                      .dwattr $C$DW$120, DW_AT_bit_size(0x04)
    1508                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$121       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$121, DW_AT_name("GPIO19")
    1514                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO19")
    1515                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1516                      .dwattr $C$DW$121, DW_AT_bit_size(0x04)
    1517                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520              $C$DW$122       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$122, DW_AT_name("GPIO20")
    1523                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO20")
    1524                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0c)
    1525                      .dwattr $C$DW$122, DW_AT_bit_size(0x04)
    1526                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1527                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529              $C$DW$123       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1531                      .dwattr $C$DW$123, DW_AT_name("GPIO21")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   30

    1532                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO21")
    1533                      .dwattr $C$DW$123, DW_AT_bit_offset(0x08)
    1534                      .dwattr $C$DW$123, DW_AT_bit_size(0x04)
    1535                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1536                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$124       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$124, DW_AT_name("GPIO22")
    1541                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO22")
    1542                      .dwattr $C$DW$124, DW_AT_bit_offset(0x04)
    1543                      .dwattr $C$DW$124, DW_AT_bit_size(0x04)
    1544                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1545                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1546              
    1547              $C$DW$125       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1549                      .dwattr $C$DW$125, DW_AT_name("GPIO23")
    1550                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO23")
    1551                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    1552                      .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    1553                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1554                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1555              
    1556                      .dwendtag $C$DW$T$29
    1557              
    1558              
    1559              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1560                      .dwattr $C$DW$T$30, DW_AT_name("GPACSEL3_REG")
    1561                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1562              $C$DW$126       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$21)
    1564                      .dwattr $C$DW$126, DW_AT_name("all")
    1565                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    1566                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1568              
    1569              $C$DW$127       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$29)
    1571                      .dwattr $C$DW$127, DW_AT_name("bit")
    1572                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    1573                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1575              
    1576                      .dwendtag $C$DW$T$30
    1577              
    1578              
    1579              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1580                      .dwattr $C$DW$T$31, DW_AT_name("GPACSEL4_BITS")
    1581                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1582              $C$DW$128       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$128, DW_AT_name("GPIO24")
    1585                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO24")
    1586                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   31

    1587                      .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    1588                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$129       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$129, DW_AT_name("GPIO25")
    1594                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO25")
    1595                      .dwattr $C$DW$129, DW_AT_bit_offset(0x08)
    1596                      .dwattr $C$DW$129, DW_AT_bit_size(0x04)
    1597                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$130       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$130, DW_AT_name("GPIO26")
    1603                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO26")
    1604                      .dwattr $C$DW$130, DW_AT_bit_offset(0x04)
    1605                      .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    1606                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1608              
    1609              $C$DW$131       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$131, DW_AT_name("GPIO27")
    1612                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO27")
    1613                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1614                      .dwattr $C$DW$131, DW_AT_bit_size(0x04)
    1615                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1616                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618              $C$DW$132       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$132, DW_AT_name("GPIO28")
    1621                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO28")
    1622                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0c)
    1623                      .dwattr $C$DW$132, DW_AT_bit_size(0x04)
    1624                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1625                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1626              
    1627              $C$DW$133       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1629                      .dwattr $C$DW$133, DW_AT_name("GPIO29")
    1630                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO29")
    1631                      .dwattr $C$DW$133, DW_AT_bit_offset(0x08)
    1632                      .dwattr $C$DW$133, DW_AT_bit_size(0x04)
    1633                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1634                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1635              
    1636              $C$DW$134       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$134, DW_AT_name("GPIO30")
    1639                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO30")
    1640                      .dwattr $C$DW$134, DW_AT_bit_offset(0x04)
    1641                      .dwattr $C$DW$134, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   32

    1642                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1643                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1644              
    1645              $C$DW$135       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1647                      .dwattr $C$DW$135, DW_AT_name("GPIO31")
    1648                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO31")
    1649                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1650                      .dwattr $C$DW$135, DW_AT_bit_size(0x04)
    1651                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1652                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1653              
    1654                      .dwendtag $C$DW$T$31
    1655              
    1656              
    1657              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1658                      .dwattr $C$DW$T$32, DW_AT_name("GPACSEL4_REG")
    1659                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1660              $C$DW$136       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    1662                      .dwattr $C$DW$136, DW_AT_name("all")
    1663                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1664                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1666              
    1667              $C$DW$137       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$31)
    1669                      .dwattr $C$DW$137, DW_AT_name("bit")
    1670                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1671                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1673              
    1674                      .dwendtag $C$DW$T$32
    1675              
    1676              
    1677              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1678                      .dwattr $C$DW$T$33, DW_AT_name("GPACTRL_BITS")
    1679                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1680              $C$DW$138       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1682                      .dwattr $C$DW$138, DW_AT_name("QUALPRD0")
    1683                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_QUALPRD0")
    1684                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08)
    1685                      .dwattr $C$DW$138, DW_AT_bit_size(0x08)
    1686                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$139       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1691                      .dwattr $C$DW$139, DW_AT_name("QUALPRD1")
    1692                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_QUALPRD1")
    1693                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1694                      .dwattr $C$DW$139, DW_AT_bit_size(0x08)
    1695                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   33

    1697              
    1698              $C$DW$140       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1700                      .dwattr $C$DW$140, DW_AT_name("QUALPRD2")
    1701                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_QUALPRD2")
    1702                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08)
    1703                      .dwattr $C$DW$140, DW_AT_bit_size(0x08)
    1704                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1705                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1706              
    1707              $C$DW$141       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1709                      .dwattr $C$DW$141, DW_AT_name("QUALPRD3")
    1710                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_QUALPRD3")
    1711                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    1712                      .dwattr $C$DW$141, DW_AT_bit_size(0x08)
    1713                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1714                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716                      .dwendtag $C$DW$T$33
    1717              
    1718              
    1719              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1720                      .dwattr $C$DW$T$34, DW_AT_name("GPACTRL_REG")
    1721                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1722              $C$DW$142       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    1724                      .dwattr $C$DW$142, DW_AT_name("all")
    1725                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    1726                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1727                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1728              
    1729              $C$DW$143       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$33)
    1731                      .dwattr $C$DW$143, DW_AT_name("bit")
    1732                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    1733                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1734                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1735              
    1736                      .dwendtag $C$DW$T$34
    1737              
    1738              
    1739              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1740                      .dwattr $C$DW$T$35, DW_AT_name("GPADIR_BITS")
    1741                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1742              $C$DW$144       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$144, DW_AT_name("GPIO0")
    1745                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO0")
    1746                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0f)
    1747                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1748                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$145       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   34

    1752                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$145, DW_AT_name("GPIO1")
    1754                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO1")
    1755                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e)
    1756                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1757                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$146       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1762                      .dwattr $C$DW$146, DW_AT_name("GPIO2")
    1763                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO2")
    1764                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0d)
    1765                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1766                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1768              
    1769              $C$DW$147       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1771                      .dwattr $C$DW$147, DW_AT_name("GPIO3")
    1772                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO3")
    1773                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0c)
    1774                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1775                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1777              
    1778              $C$DW$148       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1780                      .dwattr $C$DW$148, DW_AT_name("GPIO4")
    1781                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO4")
    1782                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0b)
    1783                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1784                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787              $C$DW$149       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$149, DW_AT_name("GPIO5")
    1790                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO5")
    1791                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0a)
    1792                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1793                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1795              
    1796              $C$DW$150       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1798                      .dwattr $C$DW$150, DW_AT_name("GPIO6")
    1799                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO6")
    1800                      .dwattr $C$DW$150, DW_AT_bit_offset(0x09)
    1801                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1802                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1803                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1804              
    1805              $C$DW$151       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   35

    1807                      .dwattr $C$DW$151, DW_AT_name("GPIO7")
    1808                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO7")
    1809                      .dwattr $C$DW$151, DW_AT_bit_offset(0x08)
    1810                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1811                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1813              
    1814              $C$DW$152       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$152, DW_AT_name("GPIO8")
    1817                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO8")
    1818                      .dwattr $C$DW$152, DW_AT_bit_offset(0x07)
    1819                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1820                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$153       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$153, DW_AT_name("GPIO9")
    1826                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO9")
    1827                      .dwattr $C$DW$153, DW_AT_bit_offset(0x06)
    1828                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1829                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1831              
    1832              $C$DW$154       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1834                      .dwattr $C$DW$154, DW_AT_name("GPIO10")
    1835                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO10")
    1836                      .dwattr $C$DW$154, DW_AT_bit_offset(0x05)
    1837                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1838                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1840              
    1841              $C$DW$155       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1843                      .dwattr $C$DW$155, DW_AT_name("GPIO11")
    1844                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO11")
    1845                      .dwattr $C$DW$155, DW_AT_bit_offset(0x04)
    1846                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1847                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850              $C$DW$156       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1852                      .dwattr $C$DW$156, DW_AT_name("GPIO12")
    1853                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO12")
    1854                      .dwattr $C$DW$156, DW_AT_bit_offset(0x03)
    1855                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1856                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859              $C$DW$157       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1861                      .dwattr $C$DW$157, DW_AT_name("GPIO13")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   36

    1862                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO13")
    1863                      .dwattr $C$DW$157, DW_AT_bit_offset(0x02)
    1864                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1865                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1867              
    1868              $C$DW$158       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1870                      .dwattr $C$DW$158, DW_AT_name("GPIO14")
    1871                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO14")
    1872                      .dwattr $C$DW$158, DW_AT_bit_offset(0x01)
    1873                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1874                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1875                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1876              
    1877              $C$DW$159       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1879                      .dwattr $C$DW$159, DW_AT_name("GPIO15")
    1880                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO15")
    1881                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    1882                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1883                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1885              
    1886              $C$DW$160       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1888                      .dwattr $C$DW$160, DW_AT_name("GPIO16")
    1889                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO16")
    1890                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f)
    1891                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    1892                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1893                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1894              
    1895              $C$DW$161       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$161, DW_AT_name("GPIO17")
    1898                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO17")
    1899                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e)
    1900                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    1901                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1902                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1903              
    1904              $C$DW$162       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1906                      .dwattr $C$DW$162, DW_AT_name("GPIO18")
    1907                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO18")
    1908                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0d)
    1909                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1910                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1911                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1912              
    1913              $C$DW$163       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$163, DW_AT_name("GPIO19")
    1916                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO19")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{9C3A7215-2E4C-4DD1-ABBD-FDDEC8CC865A} PAGE   37

    1917                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0c)
    1918                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1919                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1920                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$164       .dwtag  DW_TAG_member
