TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DeviceSupport/source/f28003x_spi.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

     159              ;*                                                             *
     160              ;* FUNCTION PROPERTIES                                         *
     161              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     162              ;***************************************************************
     163              
     164 00000000       _InitSpi:
     165              ;* AR4   assigned to $O$C1
     166                      .dwcfi  cfa_offset, -2
     167                      .dwcfi  save_reg_to_mem, 26, 0
     168                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 72,column 5,is_stmt,isa 0
     169 00000000 8F00!         MOVL      XAR4,#_SpiaRegs       ; [CPU_ARAU] |72| 
         00000001 0000 
     170 00000002 18C4          AND       *+XAR4[0],#0xff7f     ; [CPU_ALU] |72| 
         00000003 FF7F 
     171 00000004 761F!         MOVW      DP,#_SpiaRegs+1       ; [CPU_ARAU] 
         00000005 0000 
     172                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 73,column 5,is_stmt,isa 0
     173 00000006 18C4          AND       *+XAR4[0],#0xffbf     ; [CPU_ALU] |73| 
         00000007 FFBF 
     174                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 74,column 5,is_stmt,isa 0
     175 00000008 1AC4          OR        *+XAR4[0],#0x000f     ; [CPU_ALU] |74| 
         00000009 000F 
     176                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 75,column 5,is_stmt,isa 0
     177 0000000a 1AC4          OR        *+XAR4[0],#0x0010     ; [CPU_ALU] |75| 
         0000000b 0010 
     178                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 83,column 5,is_stmt,isa 0
     179 0000000c 1ACC          OR        *+XAR4[1],#0x0004     ; [CPU_ALU] |83| 
         0000000d 0004 
     180                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 84,column 5,is_stmt,isa 0
     181 0000000e 1A01!         OR        @$BLOCKED(_SpiaRegs)+1,#0x0002 ; [CPU_ALU] |84| 
         0000000f 0002 
     182                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 85,column 5,is_stmt,isa 0
     183 00000010 1801!         AND       @$BLOCKED(_SpiaRegs)+1,#0xfff7 ; [CPU_ALU] |85| 
         00000011 FFF7 
     184                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 86,column 5,is_stmt,isa 0
     185 00000012 1801!         AND       @$BLOCKED(_SpiaRegs)+1,#0xfffe ; [CPU_ALU] |86| 
         00000013 FFFE 
     186                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 91,column 5,is_stmt,isa 0
     187 00000014 CCE4          AND       AL,*+XAR4[4],#0xff80  ; [CPU_ALU] |91| 
         00000015 FF80 
     188 00000016 503B          ORB       AL,#0x3b              ; [CPU_ALU] |91| 
     189                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 97,column 5,is_stmt,isa 0
     190 00000017 DC0F          ADDB      XAR4,#15              ; [CPU_ALU] |97| 
     191                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 91,column 5,is_stmt,isa 0
     192 00000018 9604!         MOV       @$BLOCKED(_SpiaRegs)+4,AL ; [CPU_FPU] |91| 
     193                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 97,column 5,is_stmt,isa 0
     194 00000019 1AC4          OR        *+XAR4[0],#0x0010     ; [CPU_ALU] |97| 
         0000001a 0010 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE    5

     195                      .dwpsn  file "../DeviceSupport/source/f28003x_spi.c",line 102,column 5,is_stmt,isa 0
     196 0000001b 1A00!         OR        @$BLOCKED(_SpiaRegs),#0x0080 ; [CPU_ALU] |102| 
         0000001c 0080 
     197              $C$DW$8 .dwtag  DW_TAG_TI_branch
     198                      .dwattr $C$DW$8, DW_AT_low_pc(0x00)
     199                      .dwattr $C$DW$8, DW_AT_TI_return
     200              
     201 0000001d 0006          LRETR     ; [CPU_ALU] 
     202                      ; return occurs ; [] 
     203                      .dwattr $C$DW$7, DW_AT_TI_end_file("../DeviceSupport/source/f28003x_spi.c")
     204                      .dwattr $C$DW$7, DW_AT_TI_end_line(0x67)
     205                      .dwattr $C$DW$7, DW_AT_TI_end_column(0x01)
     206                      .dwendentry
     207                      .dwendtag $C$DW$7
     208              
     209              ;**************************************************************
     210              ;* UNDEFINED EXTERNAL REFERENCES                              *
     211              ;**************************************************************
     212                      .global _SpiaRegs
     213                      .global _GpioCtrlRegs
     214              
     215              ;***************************************************************
     216              ;* TYPE INFORMATION                                            *
     217              ;***************************************************************
     218              
     219              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     220                      .dwattr $C$DW$T$20, DW_AT_name("GPAAMSEL_BITS")
     221                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     222              $C$DW$9 .dwtag  DW_TAG_member
     223                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     224                      .dwattr $C$DW$9, DW_AT_name("rsvd1")
     225                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_rsvd1")
     226                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0f)
     227                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     228                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     229                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     230              
     231              $C$DW$10        .dwtag  DW_TAG_member
     232                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     233                      .dwattr $C$DW$10, DW_AT_name("rsvd2")
     234                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_rsvd2")
     235                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0e)
     236                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     237                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     238                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     239              
     240              $C$DW$11        .dwtag  DW_TAG_member
     241                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     242                      .dwattr $C$DW$11, DW_AT_name("rsvd3")
     243                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_rsvd3")
     244                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0d)
     245                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     246                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     247                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     248              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE    6

     249              $C$DW$12        .dwtag  DW_TAG_member
     250                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     251                      .dwattr $C$DW$12, DW_AT_name("rsvd4")
     252                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_rsvd4")
     253                      .dwattr $C$DW$12, DW_AT_bit_offset(0x0c)
     254                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     255                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     256                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     257              
     258              $C$DW$13        .dwtag  DW_TAG_member
     259                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     260                      .dwattr $C$DW$13, DW_AT_name("rsvd5")
     261                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_rsvd5")
     262                      .dwattr $C$DW$13, DW_AT_bit_offset(0x0b)
     263                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     264                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     265                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     266              
     267              $C$DW$14        .dwtag  DW_TAG_member
     268                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     269                      .dwattr $C$DW$14, DW_AT_name("rsvd6")
     270                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_rsvd6")
     271                      .dwattr $C$DW$14, DW_AT_bit_offset(0x0a)
     272                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     273                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     274                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     275              
     276              $C$DW$15        .dwtag  DW_TAG_member
     277                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     278                      .dwattr $C$DW$15, DW_AT_name("rsvd7")
     279                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_rsvd7")
     280                      .dwattr $C$DW$15, DW_AT_bit_offset(0x09)
     281                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     282                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     283                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     284              
     285              $C$DW$16        .dwtag  DW_TAG_member
     286                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     287                      .dwattr $C$DW$16, DW_AT_name("rsvd8")
     288                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_rsvd8")
     289                      .dwattr $C$DW$16, DW_AT_bit_offset(0x08)
     290                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     291                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     292                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     293              
     294              $C$DW$17        .dwtag  DW_TAG_member
     295                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     296                      .dwattr $C$DW$17, DW_AT_name("rsvd9")
     297                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_rsvd9")
     298                      .dwattr $C$DW$17, DW_AT_bit_offset(0x07)
     299                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     300                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     301                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     302              
     303              $C$DW$18        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE    7

     304                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     305                      .dwattr $C$DW$18, DW_AT_name("rsvd10")
     306                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_rsvd10")
     307                      .dwattr $C$DW$18, DW_AT_bit_offset(0x06)
     308                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     309                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     310                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     311              
     312              $C$DW$19        .dwtag  DW_TAG_member
     313                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     314                      .dwattr $C$DW$19, DW_AT_name("rsvd11")
     315                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_rsvd11")
     316                      .dwattr $C$DW$19, DW_AT_bit_offset(0x05)
     317                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     318                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     319                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     320              
     321              $C$DW$20        .dwtag  DW_TAG_member
     322                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     323                      .dwattr $C$DW$20, DW_AT_name("rsvd12")
     324                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_rsvd12")
     325                      .dwattr $C$DW$20, DW_AT_bit_offset(0x04)
     326                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     327                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     328                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     329              
     330              $C$DW$21        .dwtag  DW_TAG_member
     331                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     332                      .dwattr $C$DW$21, DW_AT_name("rsvd13")
     333                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd13")
     334                      .dwattr $C$DW$21, DW_AT_bit_offset(0x03)
     335                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     336                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     337                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     338              
     339              $C$DW$22        .dwtag  DW_TAG_member
     340                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     341                      .dwattr $C$DW$22, DW_AT_name("rsvd14")
     342                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_rsvd14")
     343                      .dwattr $C$DW$22, DW_AT_bit_offset(0x02)
     344                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     345                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     346                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     347              
     348              $C$DW$23        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     350                      .dwattr $C$DW$23, DW_AT_name("rsvd15")
     351                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_rsvd15")
     352                      .dwattr $C$DW$23, DW_AT_bit_offset(0x01)
     353                      .dwattr $C$DW$23, DW_AT_bit_size(0x01)
     354                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     355                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     356              
     357              $C$DW$24        .dwtag  DW_TAG_member
     358                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE    8

     359                      .dwattr $C$DW$24, DW_AT_name("rsvd16")
     360                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd16")
     361                      .dwattr $C$DW$24, DW_AT_bit_offset(0x00)
     362                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     363                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     364                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     365              
     366              $C$DW$25        .dwtag  DW_TAG_member
     367                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     368                      .dwattr $C$DW$25, DW_AT_name("rsvd17")
     369                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_rsvd17")
     370                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0f)
     371                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     372                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     373                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     374              
     375              $C$DW$26        .dwtag  DW_TAG_member
     376                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     377                      .dwattr $C$DW$26, DW_AT_name("rsvd18")
     378                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd18")
     379                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e)
     380                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     381                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     382                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     383              
     384              $C$DW$27        .dwtag  DW_TAG_member
     385                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     386                      .dwattr $C$DW$27, DW_AT_name("rsvd19")
     387                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_rsvd19")
     388                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0d)
     389                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     390                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     391                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     392              
     393              $C$DW$28        .dwtag  DW_TAG_member
     394                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     395                      .dwattr $C$DW$28, DW_AT_name("rsvd20")
     396                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd20")
     397                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0c)
     398                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     399                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     400                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     401              
     402              $C$DW$29        .dwtag  DW_TAG_member
     403                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     404                      .dwattr $C$DW$29, DW_AT_name("GPIO20")
     405                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIO20")
     406                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0b)
     407                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     408                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     409                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     410              
     411              $C$DW$30        .dwtag  DW_TAG_member
     412                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     413                      .dwattr $C$DW$30, DW_AT_name("GPIO21")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE    9

     414                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIO21")
     415                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0a)
     416                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     417                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     418                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     419              
     420              $C$DW$31        .dwtag  DW_TAG_member
     421                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     422                      .dwattr $C$DW$31, DW_AT_name("rsvd21")
     423                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd21")
     424                      .dwattr $C$DW$31, DW_AT_bit_offset(0x09)
     425                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     426                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     427                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     428              
     429              $C$DW$32        .dwtag  DW_TAG_member
     430                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     431                      .dwattr $C$DW$32, DW_AT_name("rsvd22")
     432                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd22")
     433                      .dwattr $C$DW$32, DW_AT_bit_offset(0x08)
     434                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     435                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     436                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     437              
     438              $C$DW$33        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     440                      .dwattr $C$DW$33, DW_AT_name("rsvd23")
     441                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd23")
     442                      .dwattr $C$DW$33, DW_AT_bit_offset(0x07)
     443                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     444                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     445                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     446              
     447              $C$DW$34        .dwtag  DW_TAG_member
     448                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     449                      .dwattr $C$DW$34, DW_AT_name("rsvd24")
     450                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd24")
     451                      .dwattr $C$DW$34, DW_AT_bit_offset(0x06)
     452                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     453                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     454                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     455              
     456              $C$DW$35        .dwtag  DW_TAG_member
     457                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     458                      .dwattr $C$DW$35, DW_AT_name("rsvd25")
     459                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd25")
     460                      .dwattr $C$DW$35, DW_AT_bit_offset(0x05)
     461                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     462                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     463                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     464              
     465              $C$DW$36        .dwtag  DW_TAG_member
     466                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     467                      .dwattr $C$DW$36, DW_AT_name("rsvd26")
     468                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd26")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   10

     469                      .dwattr $C$DW$36, DW_AT_bit_offset(0x04)
     470                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     471                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     472                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     473              
     474              $C$DW$37        .dwtag  DW_TAG_member
     475                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     476                      .dwattr $C$DW$37, DW_AT_name("rsvd27")
     477                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd27")
     478                      .dwattr $C$DW$37, DW_AT_bit_offset(0x03)
     479                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     480                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     481                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     482              
     483              $C$DW$38        .dwtag  DW_TAG_member
     484                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     485                      .dwattr $C$DW$38, DW_AT_name("rsvd28")
     486                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd28")
     487                      .dwattr $C$DW$38, DW_AT_bit_offset(0x02)
     488                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     489                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     490                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     491              
     492              $C$DW$39        .dwtag  DW_TAG_member
     493                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     494                      .dwattr $C$DW$39, DW_AT_name("rsvd29")
     495                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd29")
     496                      .dwattr $C$DW$39, DW_AT_bit_offset(0x01)
     497                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     498                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     499                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     500              
     501              $C$DW$40        .dwtag  DW_TAG_member
     502                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     503                      .dwattr $C$DW$40, DW_AT_name("rsvd30")
     504                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd30")
     505                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00)
     506                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     507                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     508                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     509              
     510                      .dwendtag $C$DW$T$20
     511              
     512              
     513              $C$DW$T$22      .dwtag  DW_TAG_union_type
     514                      .dwattr $C$DW$T$22, DW_AT_name("GPAAMSEL_REG")
     515                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     516              $C$DW$41        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$21)
     518                      .dwattr $C$DW$41, DW_AT_name("all")
     519                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_all")
     520                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     522              
     523              $C$DW$42        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   11

     524                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$20)
     525                      .dwattr $C$DW$42, DW_AT_name("bit")
     526                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bit")
     527                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     529              
     530                      .dwendtag $C$DW$T$22
     531              
     532              
     533              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     534                      .dwattr $C$DW$T$23, DW_AT_name("GPACR_BITS")
     535                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     536              $C$DW$43        .dwtag  DW_TAG_member
     537                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     538                      .dwattr $C$DW$43, DW_AT_name("GPIO0")
     539                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO0")
     540                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0f)
     541                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     542                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     543                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     544              
     545              $C$DW$44        .dwtag  DW_TAG_member
     546                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     547                      .dwattr $C$DW$44, DW_AT_name("GPIO1")
     548                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO1")
     549                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0e)
     550                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     551                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     553              
     554              $C$DW$45        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     556                      .dwattr $C$DW$45, DW_AT_name("GPIO2")
     557                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO2")
     558                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0d)
     559                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     560                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     561                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     562              
     563              $C$DW$46        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     565                      .dwattr $C$DW$46, DW_AT_name("GPIO3")
     566                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO3")
     567                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0c)
     568                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     569                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     570                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     571              
     572              $C$DW$47        .dwtag  DW_TAG_member
     573                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     574                      .dwattr $C$DW$47, DW_AT_name("GPIO4")
     575                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO4")
     576                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0b)
     577                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     578                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   12

     579                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     580              
     581              $C$DW$48        .dwtag  DW_TAG_member
     582                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     583                      .dwattr $C$DW$48, DW_AT_name("GPIO5")
     584                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO5")
     585                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0a)
     586                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     587                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     588                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     589              
     590              $C$DW$49        .dwtag  DW_TAG_member
     591                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     592                      .dwattr $C$DW$49, DW_AT_name("GPIO6")
     593                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO6")
     594                      .dwattr $C$DW$49, DW_AT_bit_offset(0x09)
     595                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     596                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     597                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     598              
     599              $C$DW$50        .dwtag  DW_TAG_member
     600                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     601                      .dwattr $C$DW$50, DW_AT_name("GPIO7")
     602                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO7")
     603                      .dwattr $C$DW$50, DW_AT_bit_offset(0x08)
     604                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     605                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     606                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     607              
     608              $C$DW$51        .dwtag  DW_TAG_member
     609                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     610                      .dwattr $C$DW$51, DW_AT_name("GPIO8")
     611                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO8")
     612                      .dwattr $C$DW$51, DW_AT_bit_offset(0x07)
     613                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     614                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617              $C$DW$52        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$52, DW_AT_name("GPIO9")
     620                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO9")
     621                      .dwattr $C$DW$52, DW_AT_bit_offset(0x06)
     622                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     623                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     624                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     625              
     626              $C$DW$53        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     628                      .dwattr $C$DW$53, DW_AT_name("GPIO10")
     629                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO10")
     630                      .dwattr $C$DW$53, DW_AT_bit_offset(0x05)
     631                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     632                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   13

     634              
     635              $C$DW$54        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     637                      .dwattr $C$DW$54, DW_AT_name("GPIO11")
     638                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO11")
     639                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04)
     640                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     641                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     642                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     643              
     644              $C$DW$55        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     646                      .dwattr $C$DW$55, DW_AT_name("GPIO12")
     647                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO12")
     648                      .dwattr $C$DW$55, DW_AT_bit_offset(0x03)
     649                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     650                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     652              
     653              $C$DW$56        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$56, DW_AT_name("GPIO13")
     656                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO13")
     657                      .dwattr $C$DW$56, DW_AT_bit_offset(0x02)
     658                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     659                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$57        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$57, DW_AT_name("GPIO14")
     665                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO14")
     666                      .dwattr $C$DW$57, DW_AT_bit_offset(0x01)
     667                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     668                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     670              
     671              $C$DW$58        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     673                      .dwattr $C$DW$58, DW_AT_name("GPIO15")
     674                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO15")
     675                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00)
     676                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     677                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     678                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     679              
     680              $C$DW$59        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     682                      .dwattr $C$DW$59, DW_AT_name("GPIO16")
     683                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO16")
     684                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0f)
     685                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     686                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     687                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     688              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   14

     689              $C$DW$60        .dwtag  DW_TAG_member
     690                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     691                      .dwattr $C$DW$60, DW_AT_name("GPIO17")
     692                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO17")
     693                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0e)
     694                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     695                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     696                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     697              
     698              $C$DW$61        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$61, DW_AT_name("GPIO18")
     701                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO18")
     702                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0d)
     703                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     704                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     705                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$62        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$62, DW_AT_name("GPIO19")
     710                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO19")
     711                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0c)
     712                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     713                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     714                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     715              
     716              $C$DW$63        .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     718                      .dwattr $C$DW$63, DW_AT_name("GPIO20")
     719                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO20")
     720                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0b)
     721                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     722                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     723                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     724              
     725              $C$DW$64        .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     727                      .dwattr $C$DW$64, DW_AT_name("GPIO21")
     728                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO21")
     729                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0a)
     730                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     731                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     732                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     733              
     734              $C$DW$65        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     736                      .dwattr $C$DW$65, DW_AT_name("GPIO22")
     737                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO22")
     738                      .dwattr $C$DW$65, DW_AT_bit_offset(0x09)
     739                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     740                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     741                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     742              
     743              $C$DW$66        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   15

     744                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     745                      .dwattr $C$DW$66, DW_AT_name("GPIO23")
     746                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO23")
     747                      .dwattr $C$DW$66, DW_AT_bit_offset(0x08)
     748                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     749                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     750                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752              $C$DW$67        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$67, DW_AT_name("GPIO24")
     755                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO24")
     756                      .dwattr $C$DW$67, DW_AT_bit_offset(0x07)
     757                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     758                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     759                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     760              
     761              $C$DW$68        .dwtag  DW_TAG_member
     762                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     763                      .dwattr $C$DW$68, DW_AT_name("GPIO25")
     764                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO25")
     765                      .dwattr $C$DW$68, DW_AT_bit_offset(0x06)
     766                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     767                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     768                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     769              
     770              $C$DW$69        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     772                      .dwattr $C$DW$69, DW_AT_name("GPIO26")
     773                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO26")
     774                      .dwattr $C$DW$69, DW_AT_bit_offset(0x05)
     775                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     776                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     777                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     778              
     779              $C$DW$70        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     781                      .dwattr $C$DW$70, DW_AT_name("GPIO27")
     782                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO27")
     783                      .dwattr $C$DW$70, DW_AT_bit_offset(0x04)
     784                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     785                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     786                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     787              
     788              $C$DW$71        .dwtag  DW_TAG_member
     789                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     790                      .dwattr $C$DW$71, DW_AT_name("GPIO28")
     791                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO28")
     792                      .dwattr $C$DW$71, DW_AT_bit_offset(0x03)
     793                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     794                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     795                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     796              
     797              $C$DW$72        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   16

     799                      .dwattr $C$DW$72, DW_AT_name("GPIO29")
     800                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO29")
     801                      .dwattr $C$DW$72, DW_AT_bit_offset(0x02)
     802                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     803                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     804                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     805              
     806              $C$DW$73        .dwtag  DW_TAG_member
     807                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     808                      .dwattr $C$DW$73, DW_AT_name("GPIO30")
     809                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO30")
     810                      .dwattr $C$DW$73, DW_AT_bit_offset(0x01)
     811                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     812                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     813                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     814              
     815              $C$DW$74        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     817                      .dwattr $C$DW$74, DW_AT_name("GPIO31")
     818                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO31")
     819                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
     820                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     821                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     822                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824                      .dwendtag $C$DW$T$23
     825              
     826              
     827              $C$DW$T$24      .dwtag  DW_TAG_union_type
     828                      .dwattr $C$DW$T$24, DW_AT_name("GPACR_REG")
     829                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     830              $C$DW$75        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
     832                      .dwattr $C$DW$75, DW_AT_name("all")
     833                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_all")
     834                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     836              
     837              $C$DW$76        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
     839                      .dwattr $C$DW$76, DW_AT_name("bit")
     840                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_bit")
     841                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     843              
     844                      .dwendtag $C$DW$T$24
     845              
     846              
     847              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     848                      .dwattr $C$DW$T$25, DW_AT_name("GPACSEL1_BITS")
     849                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     850              $C$DW$77        .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     852                      .dwattr $C$DW$77, DW_AT_name("GPIO0")
     853                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO0")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   17

     854                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0c)
     855                      .dwattr $C$DW$77, DW_AT_bit_size(0x04)
     856                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     857                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     858              
     859              $C$DW$78        .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     861                      .dwattr $C$DW$78, DW_AT_name("GPIO1")
     862                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO1")
     863                      .dwattr $C$DW$78, DW_AT_bit_offset(0x08)
     864                      .dwattr $C$DW$78, DW_AT_bit_size(0x04)
     865                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     866                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     867              
     868              $C$DW$79        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     870                      .dwattr $C$DW$79, DW_AT_name("GPIO2")
     871                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO2")
     872                      .dwattr $C$DW$79, DW_AT_bit_offset(0x04)
     873                      .dwattr $C$DW$79, DW_AT_bit_size(0x04)
     874                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     876              
     877              $C$DW$80        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     879                      .dwattr $C$DW$80, DW_AT_name("GPIO3")
     880                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO3")
     881                      .dwattr $C$DW$80, DW_AT_bit_offset(0x00)
     882                      .dwattr $C$DW$80, DW_AT_bit_size(0x04)
     883                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     884                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     885              
     886              $C$DW$81        .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     888                      .dwattr $C$DW$81, DW_AT_name("GPIO4")
     889                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO4")
     890                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0c)
     891                      .dwattr $C$DW$81, DW_AT_bit_size(0x04)
     892                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     893                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     894              
     895              $C$DW$82        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     897                      .dwattr $C$DW$82, DW_AT_name("GPIO5")
     898                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO5")
     899                      .dwattr $C$DW$82, DW_AT_bit_offset(0x08)
     900                      .dwattr $C$DW$82, DW_AT_bit_size(0x04)
     901                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     902                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     903              
     904              $C$DW$83        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     906                      .dwattr $C$DW$83, DW_AT_name("GPIO6")
     907                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO6")
     908                      .dwattr $C$DW$83, DW_AT_bit_offset(0x04)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   18

     909                      .dwattr $C$DW$83, DW_AT_bit_size(0x04)
     910                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     911                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     912              
     913              $C$DW$84        .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     915                      .dwattr $C$DW$84, DW_AT_name("GPIO7")
     916                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO7")
     917                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
     918                      .dwattr $C$DW$84, DW_AT_bit_size(0x04)
     919                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     920                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     921              
     922                      .dwendtag $C$DW$T$25
     923              
     924              
     925              $C$DW$T$26      .dwtag  DW_TAG_union_type
     926                      .dwattr $C$DW$T$26, DW_AT_name("GPACSEL1_REG")
     927                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     928              $C$DW$85        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
     930                      .dwattr $C$DW$85, DW_AT_name("all")
     931                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_all")
     932                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     934              
     935              $C$DW$86        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$25)
     937                      .dwattr $C$DW$86, DW_AT_name("bit")
     938                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_bit")
     939                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     941              
     942                      .dwendtag $C$DW$T$26
     943              
     944              
     945              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     946                      .dwattr $C$DW$T$27, DW_AT_name("GPACSEL2_BITS")
     947                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     948              $C$DW$87        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$87, DW_AT_name("GPIO8")
     951                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO8")
     952                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0c)
     953                      .dwattr $C$DW$87, DW_AT_bit_size(0x04)
     954                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957              $C$DW$88        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$88, DW_AT_name("GPIO9")
     960                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO9")
     961                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08)
     962                      .dwattr $C$DW$88, DW_AT_bit_size(0x04)
     963                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   19

     964                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     965              
     966              $C$DW$89        .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     968                      .dwattr $C$DW$89, DW_AT_name("GPIO10")
     969                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO10")
     970                      .dwattr $C$DW$89, DW_AT_bit_offset(0x04)
     971                      .dwattr $C$DW$89, DW_AT_bit_size(0x04)
     972                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     974              
     975              $C$DW$90        .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$90, DW_AT_name("GPIO11")
     978                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO11")
     979                      .dwattr $C$DW$90, DW_AT_bit_offset(0x00)
     980                      .dwattr $C$DW$90, DW_AT_bit_size(0x04)
     981                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     983              
     984              $C$DW$91        .dwtag  DW_TAG_member
     985                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     986                      .dwattr $C$DW$91, DW_AT_name("GPIO12")
     987                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO12")
     988                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
     989                      .dwattr $C$DW$91, DW_AT_bit_size(0x04)
     990                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     991                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     992              
     993              $C$DW$92        .dwtag  DW_TAG_member
     994                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     995                      .dwattr $C$DW$92, DW_AT_name("GPIO13")
     996                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO13")
     997                      .dwattr $C$DW$92, DW_AT_bit_offset(0x08)
     998                      .dwattr $C$DW$92, DW_AT_bit_size(0x04)
     999                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1000                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1001              
    1002              $C$DW$93        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$93, DW_AT_name("GPIO14")
    1005                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO14")
    1006                      .dwattr $C$DW$93, DW_AT_bit_offset(0x04)
    1007                      .dwattr $C$DW$93, DW_AT_bit_size(0x04)
    1008                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1009                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1010              
    1011              $C$DW$94        .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$94, DW_AT_name("GPIO15")
    1014                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO15")
    1015                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    1016                      .dwattr $C$DW$94, DW_AT_bit_size(0x04)
    1017                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1018                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   20

    1019              
    1020                      .dwendtag $C$DW$T$27
    1021              
    1022              
    1023              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1024                      .dwattr $C$DW$T$28, DW_AT_name("GPACSEL2_REG")
    1025                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1026              $C$DW$95        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
    1028                      .dwattr $C$DW$95, DW_AT_name("all")
    1029                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    1030                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1032              
    1033              $C$DW$96        .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$27)
    1035                      .dwattr $C$DW$96, DW_AT_name("bit")
    1036                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    1037                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1039              
    1040                      .dwendtag $C$DW$T$28
    1041              
    1042              
    1043              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1044                      .dwattr $C$DW$T$29, DW_AT_name("GPACSEL3_BITS")
    1045                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1046              $C$DW$97        .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$97, DW_AT_name("GPIO16")
    1049                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO16")
    1050                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0c)
    1051                      .dwattr $C$DW$97, DW_AT_bit_size(0x04)
    1052                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1054              
    1055              $C$DW$98        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$98, DW_AT_name("GPIO17")
    1058                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO17")
    1059                      .dwattr $C$DW$98, DW_AT_bit_offset(0x08)
    1060                      .dwattr $C$DW$98, DW_AT_bit_size(0x04)
    1061                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1063              
    1064              $C$DW$99        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$99, DW_AT_name("GPIO18")
    1067                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO18")
    1068                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1069                      .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1070                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$100       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   21

    1074                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$100, DW_AT_name("GPIO19")
    1076                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO19")
    1077                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1078                      .dwattr $C$DW$100, DW_AT_bit_size(0x04)
    1079                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$101       .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$101, DW_AT_name("GPIO20")
    1085                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO20")
    1086                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0c)
    1087                      .dwattr $C$DW$101, DW_AT_bit_size(0x04)
    1088                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1089                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1090              
    1091              $C$DW$102       .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$102, DW_AT_name("GPIO21")
    1094                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO21")
    1095                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08)
    1096                      .dwattr $C$DW$102, DW_AT_bit_size(0x04)
    1097                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1098                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$103       .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$103, DW_AT_name("GPIO22")
    1103                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO22")
    1104                      .dwattr $C$DW$103, DW_AT_bit_offset(0x04)
    1105                      .dwattr $C$DW$103, DW_AT_bit_size(0x04)
    1106                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1107                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$104       .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$104, DW_AT_name("GPIO23")
    1112                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO23")
    1113                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1114                      .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1115                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1116                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1117              
    1118                      .dwendtag $C$DW$T$29
    1119              
    1120              
    1121              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1122                      .dwattr $C$DW$T$30, DW_AT_name("GPACSEL3_REG")
    1123                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1124              $C$DW$105       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$21)
    1126                      .dwattr $C$DW$105, DW_AT_name("all")
    1127                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_all")
    1128                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   22

    1129                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1130              
    1131              $C$DW$106       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$29)
    1133                      .dwattr $C$DW$106, DW_AT_name("bit")
    1134                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_bit")
    1135                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138                      .dwendtag $C$DW$T$30
    1139              
    1140              
    1141              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1142                      .dwattr $C$DW$T$31, DW_AT_name("GPACSEL4_BITS")
    1143                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1144              $C$DW$107       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$107, DW_AT_name("GPIO24")
    1147                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO24")
    1148                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0c)
    1149                      .dwattr $C$DW$107, DW_AT_bit_size(0x04)
    1150                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1152              
    1153              $C$DW$108       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$108, DW_AT_name("GPIO25")
    1156                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO25")
    1157                      .dwattr $C$DW$108, DW_AT_bit_offset(0x08)
    1158                      .dwattr $C$DW$108, DW_AT_bit_size(0x04)
    1159                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1160                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1161              
    1162              $C$DW$109       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$109, DW_AT_name("GPIO26")
    1165                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO26")
    1166                      .dwattr $C$DW$109, DW_AT_bit_offset(0x04)
    1167                      .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1168                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$110       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$110, DW_AT_name("GPIO27")
    1174                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO27")
    1175                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1176                      .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1177                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$111       .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$111, DW_AT_name("GPIO28")
    1183                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO28")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   23

    1184                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    1185                      .dwattr $C$DW$111, DW_AT_bit_size(0x04)
    1186                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1187                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1188              
    1189              $C$DW$112       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$112, DW_AT_name("GPIO29")
    1192                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO29")
    1193                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08)
    1194                      .dwattr $C$DW$112, DW_AT_bit_size(0x04)
    1195                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1196                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1197              
    1198              $C$DW$113       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$113, DW_AT_name("GPIO30")
    1201                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO30")
    1202                      .dwattr $C$DW$113, DW_AT_bit_offset(0x04)
    1203                      .dwattr $C$DW$113, DW_AT_bit_size(0x04)
    1204                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1205                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$114       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$114, DW_AT_name("GPIO31")
    1210                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO31")
    1211                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    1212                      .dwattr $C$DW$114, DW_AT_bit_size(0x04)
    1213                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1214                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1215              
    1216                      .dwendtag $C$DW$T$31
    1217              
    1218              
    1219              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1220                      .dwattr $C$DW$T$32, DW_AT_name("GPACSEL4_REG")
    1221                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1222              $C$DW$115       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    1224                      .dwattr $C$DW$115, DW_AT_name("all")
    1225                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    1226                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1228              
    1229              $C$DW$116       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$31)
    1231                      .dwattr $C$DW$116, DW_AT_name("bit")
    1232                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
    1233                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1235              
    1236                      .dwendtag $C$DW$T$32
    1237              
    1238              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   24

    1239              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1240                      .dwattr $C$DW$T$33, DW_AT_name("GPACTRL_BITS")
    1241                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1242              $C$DW$117       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$117, DW_AT_name("QUALPRD0")
    1245                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_QUALPRD0")
    1246                      .dwattr $C$DW$117, DW_AT_bit_offset(0x08)
    1247                      .dwattr $C$DW$117, DW_AT_bit_size(0x08)
    1248                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251              $C$DW$118       .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$118, DW_AT_name("QUALPRD1")
    1254                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_QUALPRD1")
    1255                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1256                      .dwattr $C$DW$118, DW_AT_bit_size(0x08)
    1257                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1259              
    1260              $C$DW$119       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$119, DW_AT_name("QUALPRD2")
    1263                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_QUALPRD2")
    1264                      .dwattr $C$DW$119, DW_AT_bit_offset(0x08)
    1265                      .dwattr $C$DW$119, DW_AT_bit_size(0x08)
    1266                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1267                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269              $C$DW$120       .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1271                      .dwattr $C$DW$120, DW_AT_name("QUALPRD3")
    1272                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_QUALPRD3")
    1273                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    1274                      .dwattr $C$DW$120, DW_AT_bit_size(0x08)
    1275                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1276                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1277              
    1278                      .dwendtag $C$DW$T$33
    1279              
    1280              
    1281              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1282                      .dwattr $C$DW$T$34, DW_AT_name("GPACTRL_REG")
    1283                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1284              $C$DW$121       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1286                      .dwattr $C$DW$121, DW_AT_name("all")
    1287                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    1288                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1289                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1290              
    1291              $C$DW$122       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$33)
    1293                      .dwattr $C$DW$122, DW_AT_name("bit")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   25

    1294                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    1295                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298                      .dwendtag $C$DW$T$34
    1299              
    1300              
    1301              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1302                      .dwattr $C$DW$T$35, DW_AT_name("GPADIR_BITS")
    1303                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1304              $C$DW$123       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1306                      .dwattr $C$DW$123, DW_AT_name("GPIO0")
    1307                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO0")
    1308                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0f)
    1309                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1310                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1312              
    1313              $C$DW$124       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$124, DW_AT_name("GPIO1")
    1316                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO1")
    1317                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e)
    1318                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1319                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1320                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1321              
    1322              $C$DW$125       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1324                      .dwattr $C$DW$125, DW_AT_name("GPIO2")
    1325                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO2")
    1326                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0d)
    1327                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1328                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1330              
    1331              $C$DW$126       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1333                      .dwattr $C$DW$126, DW_AT_name("GPIO3")
    1334                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO3")
    1335                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0c)
    1336                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1337                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1338                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1339              
    1340              $C$DW$127       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1342                      .dwattr $C$DW$127, DW_AT_name("GPIO4")
    1343                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO4")
    1344                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0b)
    1345                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1346                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1347                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1348              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   26

    1349              $C$DW$128       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$128, DW_AT_name("GPIO5")
    1352                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO5")
    1353                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a)
    1354                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1355                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1357              
    1358              $C$DW$129       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1360                      .dwattr $C$DW$129, DW_AT_name("GPIO6")
    1361                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO6")
    1362                      .dwattr $C$DW$129, DW_AT_bit_offset(0x09)
    1363                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1364                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367              $C$DW$130       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1369                      .dwattr $C$DW$130, DW_AT_name("GPIO7")
    1370                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO7")
    1371                      .dwattr $C$DW$130, DW_AT_bit_offset(0x08)
    1372                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1373                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1374                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1375              
    1376              $C$DW$131       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$131, DW_AT_name("GPIO8")
    1379                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO8")
    1380                      .dwattr $C$DW$131, DW_AT_bit_offset(0x07)
    1381                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1382                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$132       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$132, DW_AT_name("GPIO9")
    1388                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO9")
    1389                      .dwattr $C$DW$132, DW_AT_bit_offset(0x06)
    1390                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1391                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394              $C$DW$133       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1396                      .dwattr $C$DW$133, DW_AT_name("GPIO10")
    1397                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO10")
    1398                      .dwattr $C$DW$133, DW_AT_bit_offset(0x05)
    1399                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1400                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1402              
    1403              $C$DW$134       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   27

    1404                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$134, DW_AT_name("GPIO11")
    1406                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO11")
    1407                      .dwattr $C$DW$134, DW_AT_bit_offset(0x04)
    1408                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1409                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$135       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1414                      .dwattr $C$DW$135, DW_AT_name("GPIO12")
    1415                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO12")
    1416                      .dwattr $C$DW$135, DW_AT_bit_offset(0x03)
    1417                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1418                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1420              
    1421              $C$DW$136       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1423                      .dwattr $C$DW$136, DW_AT_name("GPIO13")
    1424                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO13")
    1425                      .dwattr $C$DW$136, DW_AT_bit_offset(0x02)
    1426                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1427                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430              $C$DW$137       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1432                      .dwattr $C$DW$137, DW_AT_name("GPIO14")
    1433                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO14")
    1434                      .dwattr $C$DW$137, DW_AT_bit_offset(0x01)
    1435                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1436                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1437                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1438              
    1439              $C$DW$138       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1441                      .dwattr $C$DW$138, DW_AT_name("GPIO15")
    1442                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO15")
    1443                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    1444                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1445                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1447              
    1448              $C$DW$139       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1450                      .dwattr $C$DW$139, DW_AT_name("GPIO16")
    1451                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO16")
    1452                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0f)
    1453                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1454                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1455                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1456              
    1457              $C$DW$140       .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{07CE3D92-7EDB-4527-8FB6-DB6BE8597AE7} PAGE   28

    1459                      .dwattr $C$DW$140, DW_AT_name("GPIO17")
    1460                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO17")
    1461                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e)
    1462                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1463                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1464                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1465              
    1466              $C$DW$141       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1468                      .dwattr $C$DW$141, DW_AT_name("GPIO18")
    1469                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO18")
    1470                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0d)
    1471                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1472                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1473                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$142       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$142, DW_AT_name("GPIO19")
    1478                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO19")
    1479                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0c)
    1480                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1481                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1482                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$143       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$143, DW_AT_name("GPIO20")
    1487                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO20")
