TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DeviceSupport/source/f28003x_tempsensorconv.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("F28x_usDelay")

     372                      .dwpsn  file "../DeviceSupport/source/f28003x_tempsensorconv.c",line 113,column 5,is_stmt,isa 0
     373              $C$DW$23        .dwtag  DW_TAG_TI_branch
     374                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     375                      .dwattr $C$DW$23, DW_AT_name("FS$$DIV")
     376                      .dwattr $C$DW$23, DW_AT_TI_call
     377              
     378 00000013 7640!         LCR       #FS$$DIV              ; [CPU_ALU] |113| 
         00000014 0000 
     379                      ; call occurs [#FS$$DIV] ; [] |113| 
     380 00000015 0EA3          MOVU      ACC,AR3               ; [CPU_ALU] |113| 
     381 00000016 BDA9          MOV32     R1H,ACC               ; [CPU_FPU] |113| 
         00000017 0F16 
     382 00000018 7700          NOP       ; [CPU_ALU] 
     383 00000019 7700          NOP       ; [CPU_ALU] 
     384 0000001a 7700          NOP       ; [CPU_ALU] 
     385 0000001b 7700          NOP       ; [CPU_ALU] 
     386 0000001c E68B          UI32TOF32 R1H,R1H               ; [CPU_FPU] |113| 
         0000001d 0009 
     387 0000001e 7700          NOP       ; [CPU_ALU] 
     388 0000001f E700          MPYF32    R0H,R1H,R0H           ; [CPU_FPU] |113| 
         00000020 0008 
     389 00000021 7700          NOP       ; [CPU_ALU] 
     390 00000022 E688          F32TOI32  R0H,R0H               ; [CPU_FPU] |113| 
         00000023 0000 
     391 00000024 7700          NOP       ; [CPU_ALU] 
     392 00000025 7700          NOP       ; [CPU_ALU] 
     393 00000026 BFA9          MOV32     ACC,R0H               ; [CPU_FPU] |113| 
         00000027 0F12 
     394 00000028 1EA6          MOVL      XAR6,ACC              ; [CPU_ALU] |113| 
     395 00000029 3B01          SETC      SXM                   ; [CPU_ALU] 
     396 0000002a 85A2          MOV       ACC,AR2               ; [CPU_ALU] |113| 
     397 0000002b 5641          SUBL      XAR6,ACC              ; [CPU_ALU] |113| 
         0000002c 00A6 
     398 0000002d 06A6          MOVL      ACC,XAR6              ; [CPU_ALU] |113| 
     399 0000002e FF3B          LSL       ACC,12                ; [CPU_ALU] |113| 
     400 0000002f 1EA6          MOVL      XAR6,ACC              ; [CPU_ALU] |113| 
     401 00000030 85A1          MOV       ACC,AR1               ; [CPU_ALU] |113| 
     402 00000031 1E42          MOVL      *-SP[2],ACC           ; [CPU_ALU] |113| 
     403 00000032 06A6          MOVL      ACC,XAR6              ; [CPU_ALU] |113| 
     404              $C$DW$24        .dwtag  DW_TAG_TI_branch
     405                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE    9

     406                      .dwattr $C$DW$24, DW_AT_name("L$$DIV")
     407                      .dwattr $C$DW$24, DW_AT_TI_call
     408              
     409 00000033 00C0!         FFC       XAR7,#L$$DIV          ; [CPU_ALU] |113| 
         00000034 0000 
     410                      ; call occurs [#L$$DIV] ; [] |113| 
     411 00000035 FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     412                      .dwcfi  cfa_offset, -8
     413 00000036 82BE          MOVL      XAR3,*--SP            ; [CPU_ALU] 
     414                      .dwcfi  cfa_offset, -6
     415                      .dwcfi  restore_reg, 11
     416 00000037 86BE          MOVL      XAR2,*--SP            ; [CPU_ALU] 
     417                      .dwcfi  cfa_offset, -4
     418                      .dwcfi  restore_reg, 9
     419 00000038 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     420                      .dwcfi  cfa_offset, -2
     421                      .dwcfi  restore_reg, 7
     422              $C$DW$25        .dwtag  DW_TAG_TI_branch
     423                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     424                      .dwattr $C$DW$25, DW_AT_TI_return
     425              
     426 00000039 0006          LRETR     ; [CPU_ALU] 
     427                      ; return occurs ; [] 
     428                      .dwattr $C$DW$20, DW_AT_TI_end_file("../DeviceSupport/source/f28003x_tempsensorconv.c")
     429                      .dwattr $C$DW$20, DW_AT_TI_end_line(0x74)
     430                      .dwattr $C$DW$20, DW_AT_TI_end_column(0x01)
     431                      .dwendentry
     432                      .dwendtag $C$DW$20
     433              
     434              ;**************************************************************
     435              ;* UNDEFINED EXTERNAL REFERENCES                              *
     436              ;**************************************************************
     437                      .global _F28x_usDelay
     438                      .global _AnalogSubsysRegs
     439                      .global FS$$DIV
     440                      .global L$$DIV
     441              
     442              ;***************************************************************
     443              ;* TYPE INFORMATION                                            *
     444              ;***************************************************************
     445              
     446              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     447                      .dwattr $C$DW$T$20, DW_AT_name("ADCDACLOOPBACK_BITS")
     448                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     449              $C$DW$26        .dwtag  DW_TAG_member
     450                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     451                      .dwattr $C$DW$26, DW_AT_name("ENLB2ADCA")
     452                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_ENLB2ADCA")
     453                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0f)
     454                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     455                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     456                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     457              
     458              $C$DW$27        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   10

     460                      .dwattr $C$DW$27, DW_AT_name("ENLB2ADCB")
     461                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_ENLB2ADCB")
     462                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0e)
     463                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     464                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     465                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     466              
     467              $C$DW$28        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$28, DW_AT_name("ENLB2ADCC")
     470                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_ENLB2ADCC")
     471                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0d)
     472                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     473                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     475              
     476              $C$DW$29        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     478                      .dwattr $C$DW$29, DW_AT_name("rsvd1")
     479                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_rsvd1")
     480                      .dwattr $C$DW$29, DW_AT_bit_offset(0x00)
     481                      .dwattr $C$DW$29, DW_AT_bit_size(0x0d)
     482                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     484              
     485              $C$DW$30        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     487                      .dwattr $C$DW$30, DW_AT_name("KEY")
     488                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_KEY")
     489                      .dwattr $C$DW$30, DW_AT_bit_offset(0x00)
     490                      .dwattr $C$DW$30, DW_AT_bit_size(0x10)
     491                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     492                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     493              
     494                      .dwendtag $C$DW$T$20
     495              
     496              
     497              $C$DW$T$22      .dwtag  DW_TAG_union_type
     498                      .dwattr $C$DW$T$22, DW_AT_name("ADCDACLOOPBACK_REG")
     499                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     500              $C$DW$31        .dwtag  DW_TAG_member
     501                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$21)
     502                      .dwattr $C$DW$31, DW_AT_name("all")
     503                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_all")
     504                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     505                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     506              
     507              $C$DW$32        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
     509                      .dwattr $C$DW$32, DW_AT_name("bit")
     510                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_bit")
     511                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     513              
     514                      .dwendtag $C$DW$T$22
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   11

     515              
     516              
     517              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     518                      .dwattr $C$DW$T$23, DW_AT_name("AGPIOCTRLA_BITS")
     519                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     520              $C$DW$33        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$33, DW_AT_name("rsvd1")
     523                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd1")
     524                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0f)
     525                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     526                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     527                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529              $C$DW$34        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     531                      .dwattr $C$DW$34, DW_AT_name("rsvd2")
     532                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd2")
     533                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0e)
     534                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     535                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     537              
     538              $C$DW$35        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     540                      .dwattr $C$DW$35, DW_AT_name("rsvd3")
     541                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd3")
     542                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0d)
     543                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     544                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     546              
     547              $C$DW$36        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$36, DW_AT_name("rsvd4")
     550                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd4")
     551                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0c)
     552                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     553                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     555              
     556              $C$DW$37        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$37, DW_AT_name("rsvd5")
     559                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd5")
     560                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0b)
     561                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     562                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     564              
     565              $C$DW$38        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     567                      .dwattr $C$DW$38, DW_AT_name("rsvd6")
     568                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd6")
     569                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   12

     570                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     571                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     573              
     574              $C$DW$39        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     576                      .dwattr $C$DW$39, DW_AT_name("rsvd7")
     577                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd7")
     578                      .dwattr $C$DW$39, DW_AT_bit_offset(0x09)
     579                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     580                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     582              
     583              $C$DW$40        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     585                      .dwattr $C$DW$40, DW_AT_name("rsvd8")
     586                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd8")
     587                      .dwattr $C$DW$40, DW_AT_bit_offset(0x08)
     588                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     589                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     591              
     592              $C$DW$41        .dwtag  DW_TAG_member
     593                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     594                      .dwattr $C$DW$41, DW_AT_name("rsvd9")
     595                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd9")
     596                      .dwattr $C$DW$41, DW_AT_bit_offset(0x07)
     597                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     598                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     599                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     600              
     601              $C$DW$42        .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     603                      .dwattr $C$DW$42, DW_AT_name("rsvd10")
     604                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd10")
     605                      .dwattr $C$DW$42, DW_AT_bit_offset(0x06)
     606                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     607                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     608                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     609              
     610              $C$DW$43        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     612                      .dwattr $C$DW$43, DW_AT_name("rsvd11")
     613                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd11")
     614                      .dwattr $C$DW$43, DW_AT_bit_offset(0x05)
     615                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     616                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     617                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     618              
     619              $C$DW$44        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$44, DW_AT_name("rsvd12")
     622                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_rsvd12")
     623                      .dwattr $C$DW$44, DW_AT_bit_offset(0x04)
     624                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   13

     625                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     626                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     627              
     628              $C$DW$45        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     630                      .dwattr $C$DW$45, DW_AT_name("rsvd13")
     631                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd13")
     632                      .dwattr $C$DW$45, DW_AT_bit_offset(0x03)
     633                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     634                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     635                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     636              
     637              $C$DW$46        .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     639                      .dwattr $C$DW$46, DW_AT_name("rsvd14")
     640                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd14")
     641                      .dwattr $C$DW$46, DW_AT_bit_offset(0x02)
     642                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     643                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     645              
     646              $C$DW$47        .dwtag  DW_TAG_member
     647                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     648                      .dwattr $C$DW$47, DW_AT_name("rsvd15")
     649                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd15")
     650                      .dwattr $C$DW$47, DW_AT_bit_offset(0x01)
     651                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     652                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     653                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     654              
     655              $C$DW$48        .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     657                      .dwattr $C$DW$48, DW_AT_name("rsvd16")
     658                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd16")
     659                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00)
     660                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     661                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     663              
     664              $C$DW$49        .dwtag  DW_TAG_member
     665                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     666                      .dwattr $C$DW$49, DW_AT_name("rsvd17")
     667                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd17")
     668                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0f)
     669                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     670                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     671                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     672              
     673              $C$DW$50        .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     675                      .dwattr $C$DW$50, DW_AT_name("rsvd18")
     676                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd18")
     677                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0e)
     678                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     679                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   14

     680                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     681              
     682              $C$DW$51        .dwtag  DW_TAG_member
     683                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     684                      .dwattr $C$DW$51, DW_AT_name("rsvd19")
     685                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd19")
     686                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0d)
     687                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     688                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     689                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     690              
     691              $C$DW$52        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     693                      .dwattr $C$DW$52, DW_AT_name("rsvd20")
     694                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd20")
     695                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0c)
     696                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     697                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     698                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     699              
     700              $C$DW$53        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$53, DW_AT_name("GPIO20")
     703                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO20")
     704                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0b)
     705                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     706                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     707                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     708              
     709              $C$DW$54        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     711                      .dwattr $C$DW$54, DW_AT_name("GPIO21")
     712                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO21")
     713                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0a)
     714                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     715                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     716                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     717              
     718              $C$DW$55        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     720                      .dwattr $C$DW$55, DW_AT_name("rsvd21")
     721                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd21")
     722                      .dwattr $C$DW$55, DW_AT_bit_offset(0x09)
     723                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     724                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     725                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     726              
     727              $C$DW$56        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     729                      .dwattr $C$DW$56, DW_AT_name("rsvd22")
     730                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd22")
     731                      .dwattr $C$DW$56, DW_AT_bit_offset(0x08)
     732                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     733                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     734                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   15

     735              
     736              $C$DW$57        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     738                      .dwattr $C$DW$57, DW_AT_name("rsvd23")
     739                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd23")
     740                      .dwattr $C$DW$57, DW_AT_bit_offset(0x07)
     741                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     742                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     743                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     744              
     745              $C$DW$58        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$58, DW_AT_name("rsvd24")
     748                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd24")
     749                      .dwattr $C$DW$58, DW_AT_bit_offset(0x06)
     750                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     751                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     752                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     753              
     754              $C$DW$59        .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     756                      .dwattr $C$DW$59, DW_AT_name("rsvd25")
     757                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd25")
     758                      .dwattr $C$DW$59, DW_AT_bit_offset(0x05)
     759                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     760                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     761                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     762              
     763              $C$DW$60        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$60, DW_AT_name("rsvd26")
     766                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd26")
     767                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
     768                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     769                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     770                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     771              
     772              $C$DW$61        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$61, DW_AT_name("rsvd27")
     775                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd27")
     776                      .dwattr $C$DW$61, DW_AT_bit_offset(0x03)
     777                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     778                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     779                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     780              
     781              $C$DW$62        .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     783                      .dwattr $C$DW$62, DW_AT_name("rsvd28")
     784                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd28")
     785                      .dwattr $C$DW$62, DW_AT_bit_offset(0x02)
     786                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     787                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     788                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     789              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   16

     790              $C$DW$63        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$63, DW_AT_name("rsvd29")
     793                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd29")
     794                      .dwattr $C$DW$63, DW_AT_bit_offset(0x01)
     795                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     796                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     797                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     798              
     799              $C$DW$64        .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     801                      .dwattr $C$DW$64, DW_AT_name("rsvd30")
     802                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_rsvd30")
     803                      .dwattr $C$DW$64, DW_AT_bit_offset(0x00)
     804                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     805                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     806                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     807              
     808                      .dwendtag $C$DW$T$23
     809              
     810              
     811              $C$DW$T$24      .dwtag  DW_TAG_union_type
     812                      .dwattr $C$DW$T$24, DW_AT_name("AGPIOCTRLA_REG")
     813                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     814              $C$DW$65        .dwtag  DW_TAG_member
     815                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     816                      .dwattr $C$DW$65, DW_AT_name("all")
     817                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_all")
     818                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     819                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     820              
     821              $C$DW$66        .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$23)
     823                      .dwattr $C$DW$66, DW_AT_name("bit")
     824                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_bit")
     825                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     826                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     827              
     828                      .dwendtag $C$DW$T$24
     829              
     830              
     831              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     832                      .dwattr $C$DW$T$30, DW_AT_name("ANALOG_SUBSYS_REGS")
     833                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x104)
     834              $C$DW$67        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$25)
     836                      .dwattr $C$DW$67, DW_AT_name("rsvd1")
     837                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd1")
     838                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     839                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     840              
     841              $C$DW$68        .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$42)
     843                      .dwattr $C$DW$68, DW_AT_name("CONFIGLOCK")
     844                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_CONFIGLOCK")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   17

     845                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     846                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     847              
     848              $C$DW$69        .dwtag  DW_TAG_member
     849                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$46)
     850                      .dwattr $C$DW$69, DW_AT_name("TSNSCTL")
     851                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_TSNSCTL")
     852                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     853                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     854              
     855              $C$DW$70        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$26)
     857                      .dwattr $C$DW$70, DW_AT_name("rsvd2")
     858                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd2")
     859                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
     860                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     861              
     862              $C$DW$71        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$32)
     864                      .dwattr $C$DW$71, DW_AT_name("ANAREFCTL")
     865                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_ANAREFCTL")
     866                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     867                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     868              
     869              $C$DW$72        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$26)
     871                      .dwattr $C$DW$72, DW_AT_name("rsvd3")
     872                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd3")
     873                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
     874                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     875              
     876              $C$DW$73        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$48)
     878                      .dwattr $C$DW$73, DW_AT_name("VMONCTL")
     879                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_VMONCTL")
     880                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
     881                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     882              
     883              $C$DW$74        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$27)
     885                      .dwattr $C$DW$74, DW_AT_name("rsvd4")
     886                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd4")
     887                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
     888                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     889              
     890              $C$DW$75        .dwtag  DW_TAG_member
     891                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$36)
     892                      .dwattr $C$DW$75, DW_AT_name("CMPHPMXSEL")
     893                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_CMPHPMXSEL")
     894                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
     895                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     896              
     897              $C$DW$76        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$40)
     899                      .dwattr $C$DW$76, DW_AT_name("CMPLPMXSEL")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   18

     900                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_CMPLPMXSEL")
     901                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
     902                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     903              
     904              $C$DW$77        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$34)
     906                      .dwattr $C$DW$77, DW_AT_name("CMPHNMXSEL")
     907                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_CMPHNMXSEL")
     908                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
     909                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     910              
     911              $C$DW$78        .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$38)
     913                      .dwattr $C$DW$78, DW_AT_name("CMPLNMXSEL")
     914                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_CMPLNMXSEL")
     915                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x87]
     916                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     917              
     918              $C$DW$79        .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
     920                      .dwattr $C$DW$79, DW_AT_name("ADCDACLOOPBACK")
     921                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_ADCDACLOOPBACK")
     922                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
     923                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     924              
     925              $C$DW$80        .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$28)
     927                      .dwattr $C$DW$80, DW_AT_name("rsvd5")
     928                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd5")
     929                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
     930                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     931              
     932              $C$DW$81        .dwtag  DW_TAG_member
     933                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$44)
     934                      .dwattr $C$DW$81, DW_AT_name("LOCK")
     935                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_LOCK")
     936                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
     937                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     938              
     939              $C$DW$82        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$29)
     941                      .dwattr $C$DW$82, DW_AT_name("rsvd6")
     942                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd6")
     943                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
     944                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     945              
     946              $C$DW$83        .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$24)
     948                      .dwattr $C$DW$83, DW_AT_name("AGPIOCTRLA")
     949                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_AGPIOCTRLA")
     950                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
     951                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     952              
     953                      .dwendtag $C$DW$T$30
     954              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   19

     955              $C$DW$84        .dwtag  DW_TAG_TI_far_type
     956                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$30)
     957              
     958              $C$DW$T$49      .dwtag  DW_TAG_volatile_type
     959                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$84)
     960              
     961              
     962              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     963                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFCTL_BITS")
     964                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     965              $C$DW$85        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$85, DW_AT_name("ANAREFSEL")
     968                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_ANAREFSEL")
     969                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0f)
     970                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     971                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     973              
     974              $C$DW$86        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$86, DW_AT_name("rsvd1")
     977                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd1")
     978                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0e)
     979                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     980                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$87        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$87, DW_AT_name("rsvd2")
     986                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd2")
     987                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0d)
     988                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     989                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     991              
     992              $C$DW$88        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$88, DW_AT_name("rsvd3")
     995                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd3")
     996                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08)
     997                      .dwattr $C$DW$88, DW_AT_bit_size(0x05)
     998                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001              $C$DW$89        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$89, DW_AT_name("ANAREF2P5SEL")
    1004                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ANAREF2P5SEL")
    1005                      .dwattr $C$DW$89, DW_AT_bit_offset(0x07)
    1006                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1007                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1009              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   20

    1010              $C$DW$90        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$90, DW_AT_name("rsvd4")
    1013                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd4")
    1014                      .dwattr $C$DW$90, DW_AT_bit_offset(0x06)
    1015                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1018              
    1019              $C$DW$91        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$91, DW_AT_name("rsvd5")
    1022                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd5")
    1023                      .dwattr $C$DW$91, DW_AT_bit_offset(0x05)
    1024                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1025                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1027              
    1028              $C$DW$92        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$92, DW_AT_name("rsvd6")
    1031                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd6")
    1032                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1033                      .dwattr $C$DW$92, DW_AT_bit_size(0x05)
    1034                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1036              
    1037                      .dwendtag $C$DW$T$31
    1038              
    1039              
    1040              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1041                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFCTL_REG")
    1042                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1043              $C$DW$93        .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1045                      .dwattr $C$DW$93, DW_AT_name("all")
    1046                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
    1047                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1048                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1049              
    1050              $C$DW$94        .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$31)
    1052                      .dwattr $C$DW$94, DW_AT_name("bit")
    1053                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
    1054                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057                      .dwendtag $C$DW$T$32
    1058              
    1059              
    1060              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1061                      .dwattr $C$DW$T$33, DW_AT_name("CMPHNMXSEL_BITS")
    1062                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1063              $C$DW$95        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   21

    1065                      .dwattr $C$DW$95, DW_AT_name("CMP1HNMXSEL")
    1066                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_CMP1HNMXSEL")
    1067                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f)
    1068                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1069                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1071              
    1072              $C$DW$96        .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$96, DW_AT_name("CMP2HNMXSEL")
    1075                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_CMP2HNMXSEL")
    1076                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0e)
    1077                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1078                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1080              
    1081              $C$DW$97        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1083                      .dwattr $C$DW$97, DW_AT_name("CMP3HNMXSEL")
    1084                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_CMP3HNMXSEL")
    1085                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0d)
    1086                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1087                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1088                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1089              
    1090              $C$DW$98        .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$98, DW_AT_name("CMP4HNMXSEL")
    1093                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_CMP4HNMXSEL")
    1094                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1095                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1096                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1098              
    1099              $C$DW$99        .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
    1102                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
    1103                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0b)
    1104                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1105                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1107              
    1108              $C$DW$100       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1110                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
    1111                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    1112                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0a)
    1113                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1114                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1116              
    1117              $C$DW$101       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$101, DW_AT_name("rsvd3")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   22

    1120                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd3")
    1121                      .dwattr $C$DW$101, DW_AT_bit_offset(0x09)
    1122                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1123                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1125              
    1126              $C$DW$102       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$102, DW_AT_name("rsvd4")
    1129                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd4")
    1130                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1131                      .dwattr $C$DW$102, DW_AT_bit_size(0x09)
    1132                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1134              
    1135                      .dwendtag $C$DW$T$33
    1136              
    1137              
    1138              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1139                      .dwattr $C$DW$T$34, DW_AT_name("CMPHNMXSEL_REG")
    1140                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1141              $C$DW$103       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1143                      .dwattr $C$DW$103, DW_AT_name("all")
    1144                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    1145                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1147              
    1148              $C$DW$104       .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$33)
    1150                      .dwattr $C$DW$104, DW_AT_name("bit")
    1151                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    1152                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155                      .dwendtag $C$DW$T$34
    1156              
    1157              
    1158              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1159                      .dwattr $C$DW$T$35, DW_AT_name("CMPHPMXSEL_BITS")
    1160                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1161              $C$DW$105       .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1163                      .dwattr $C$DW$105, DW_AT_name("CMP1HPMXSEL")
    1164                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_CMP1HPMXSEL")
    1165                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d)
    1166                      .dwattr $C$DW$105, DW_AT_bit_size(0x03)
    1167                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1169              
    1170              $C$DW$106       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1172                      .dwattr $C$DW$106, DW_AT_name("CMP2HPMXSEL")
    1173                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_CMP2HPMXSEL")
    1174                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   23

    1175                      .dwattr $C$DW$106, DW_AT_bit_size(0x03)
    1176                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1178              
    1179              $C$DW$107       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$107, DW_AT_name("CMP3HPMXSEL")
    1182                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CMP3HPMXSEL")
    1183                      .dwattr $C$DW$107, DW_AT_bit_offset(0x07)
    1184                      .dwattr $C$DW$107, DW_AT_bit_size(0x03)
    1185                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1186                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1187              
    1188              $C$DW$108       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$108, DW_AT_name("CMP4HPMXSEL")
    1191                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CMP4HPMXSEL")
    1192                      .dwattr $C$DW$108, DW_AT_bit_offset(0x04)
    1193                      .dwattr $C$DW$108, DW_AT_bit_size(0x03)
    1194                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1196              
    1197              $C$DW$109       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1199                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1200                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1201                      .dwattr $C$DW$109, DW_AT_bit_offset(0x01)
    1202                      .dwattr $C$DW$109, DW_AT_bit_size(0x03)
    1203                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1205              
    1206              $C$DW$110       .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1208                      .dwattr $C$DW$110, DW_AT_name("rsvd2")
    1209                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd2")
    1210                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1211                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1212                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1214              
    1215              $C$DW$111       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$111, DW_AT_name("rsvd3")
    1218                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd3")
    1219                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0d)
    1220                      .dwattr $C$DW$111, DW_AT_bit_size(0x03)
    1221                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1222                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224              $C$DW$112       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1226                      .dwattr $C$DW$112, DW_AT_name("rsvd4")
    1227                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd4")
    1228                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0a)
    1229                      .dwattr $C$DW$112, DW_AT_bit_size(0x03)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   24

    1230                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1231                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1232              
    1233              $C$DW$113       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$113, DW_AT_name("rsvd5")
    1236                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd5")
    1237                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    1238                      .dwattr $C$DW$113, DW_AT_bit_size(0x0a)
    1239                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1240                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242                      .dwendtag $C$DW$T$35
    1243              
    1244              
    1245              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1246                      .dwattr $C$DW$T$36, DW_AT_name("CMPHPMXSEL_REG")
    1247                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1248              $C$DW$114       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    1250                      .dwattr $C$DW$114, DW_AT_name("all")
    1251                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    1252                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1254              
    1255              $C$DW$115       .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$35)
    1257                      .dwattr $C$DW$115, DW_AT_name("bit")
    1258                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    1259                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262                      .dwendtag $C$DW$T$36
    1263              
    1264              
    1265              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1266                      .dwattr $C$DW$T$37, DW_AT_name("CMPLNMXSEL_BITS")
    1267                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1268              $C$DW$116       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$116, DW_AT_name("CMP1LNMXSEL")
    1271                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_CMP1LNMXSEL")
    1272                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0f)
    1273                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1274                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1276              
    1277              $C$DW$117       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$117, DW_AT_name("CMP2LNMXSEL")
    1280                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_CMP2LNMXSEL")
    1281                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0e)
    1282                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1283                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   25

    1285              
    1286              $C$DW$118       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1288                      .dwattr $C$DW$118, DW_AT_name("CMP3LNMXSEL")
    1289                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CMP3LNMXSEL")
    1290                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0d)
    1291                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1292                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1294              
    1295              $C$DW$119       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1297                      .dwattr $C$DW$119, DW_AT_name("CMP4LNMXSEL")
    1298                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CMP4LNMXSEL")
    1299                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0c)
    1300                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1301                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1302                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304              $C$DW$120       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1306                      .dwattr $C$DW$120, DW_AT_name("rsvd1")
    1307                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd1")
    1308                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0b)
    1309                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1310                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1312              
    1313              $C$DW$121       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$121, DW_AT_name("rsvd2")
    1316                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd2")
    1317                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0a)
    1318                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1319                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1320                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1321              
    1322              $C$DW$122       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1324                      .dwattr $C$DW$122, DW_AT_name("rsvd3")
    1325                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd3")
    1326                      .dwattr $C$DW$122, DW_AT_bit_offset(0x09)
    1327                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1328                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1330              
    1331              $C$DW$123       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1333                      .dwattr $C$DW$123, DW_AT_name("rsvd4")
    1334                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd4")
    1335                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    1336                      .dwattr $C$DW$123, DW_AT_bit_size(0x09)
    1337                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1338                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1339              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   26

    1340                      .dwendtag $C$DW$T$37
    1341              
    1342              
    1343              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1344                      .dwattr $C$DW$T$38, DW_AT_name("CMPLNMXSEL_REG")
    1345                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1346              $C$DW$124       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1348                      .dwattr $C$DW$124, DW_AT_name("all")
    1349                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    1350                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1352              
    1353              $C$DW$125       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$37)
    1355                      .dwattr $C$DW$125, DW_AT_name("bit")
    1356                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    1357                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360                      .dwendtag $C$DW$T$38
    1361              
    1362              
    1363              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1364                      .dwattr $C$DW$T$39, DW_AT_name("CMPLPMXSEL_BITS")
    1365                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1366              $C$DW$126       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$126, DW_AT_name("CMP1LPMXSEL")
    1369                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_CMP1LPMXSEL")
    1370                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d)
    1371                      .dwattr $C$DW$126, DW_AT_bit_size(0x03)
    1372                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$127       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$127, DW_AT_name("CMP2LPMXSEL")
    1378                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_CMP2LPMXSEL")
    1379                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0a)
    1380                      .dwattr $C$DW$127, DW_AT_bit_size(0x03)
    1381                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1383              
    1384              $C$DW$128       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$128, DW_AT_name("CMP3LPMXSEL")
    1387                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_CMP3LPMXSEL")
    1388                      .dwattr $C$DW$128, DW_AT_bit_offset(0x07)
    1389                      .dwattr $C$DW$128, DW_AT_bit_size(0x03)
    1390                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1392              
    1393              $C$DW$129       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   27

    1395                      .dwattr $C$DW$129, DW_AT_name("CMP4LPMXSEL")
    1396                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CMP4LPMXSEL")
    1397                      .dwattr $C$DW$129, DW_AT_bit_offset(0x04)
    1398                      .dwattr $C$DW$129, DW_AT_bit_size(0x03)
    1399                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$130       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    1405                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    1406                      .dwattr $C$DW$130, DW_AT_bit_offset(0x01)
    1407                      .dwattr $C$DW$130, DW_AT_bit_size(0x03)
    1408                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$131       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$131, DW_AT_name("rsvd2")
    1414                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd2")
    1415                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1416                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1417                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420              $C$DW$132       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$132, DW_AT_name("rsvd3")
    1423                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd3")
    1424                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0d)
    1425                      .dwattr $C$DW$132, DW_AT_bit_size(0x03)
    1426                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1427                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429              $C$DW$133       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1431                      .dwattr $C$DW$133, DW_AT_name("rsvd4")
    1432                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd4")
    1433                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a)
    1434                      .dwattr $C$DW$133, DW_AT_bit_size(0x03)
    1435                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1436                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1437              
    1438              $C$DW$134       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$134, DW_AT_name("rsvd5")
    1441                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd5")
    1442                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    1443                      .dwattr $C$DW$134, DW_AT_bit_size(0x0a)
    1444                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1445                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1446              
    1447                      .dwendtag $C$DW$T$39
    1448              
    1449              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   28

    1450              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1451                      .dwattr $C$DW$T$40, DW_AT_name("CMPLPMXSEL_REG")
    1452                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1453              $C$DW$135       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
    1455                      .dwattr $C$DW$135, DW_AT_name("all")
    1456                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    1457                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460              $C$DW$136       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$39)
    1462                      .dwattr $C$DW$136, DW_AT_name("bit")
    1463                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    1464                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1466              
    1467                      .dwendtag $C$DW$T$40
    1468              
    1469              
    1470              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1471                      .dwattr $C$DW$T$41, DW_AT_name("CONFIGLOCK_BITS")
    1472                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    1473              $C$DW$137       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1475                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    1476                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    1477                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0f)
    1478                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1479                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1480                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482              $C$DW$138       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1484                      .dwattr $C$DW$138, DW_AT_name("rsvd2")
    1485                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd2")
    1486                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0e)
    1487                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1488                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1490              
    1491              $C$DW$139       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$139, DW_AT_name("rsvd3")
    1494                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd3")
    1495                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0d)
    1496                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1497                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1499              
    1500              $C$DW$140       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1502                      .dwattr $C$DW$140, DW_AT_name("AGPIOCTRL")
    1503                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_AGPIOCTRL")
    1504                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   29

    1505                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1506                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1508              
    1509              $C$DW$141       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1511                      .dwattr $C$DW$141, DW_AT_name("rsvd4")
    1512                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd4")
    1513                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0b)
    1514                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1515                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1517              
    1518              $C$DW$142       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1520                      .dwattr $C$DW$142, DW_AT_name("rsvd5")
    1521                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd5")
    1522                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    1523                      .dwattr $C$DW$142, DW_AT_bit_size(0x0b)
    1524                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1526              
    1527              $C$DW$143       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1529                      .dwattr $C$DW$143, DW_AT_name("rsvd6")
    1530                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd6")
    1531                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    1532                      .dwattr $C$DW$143, DW_AT_bit_size(0x10)
    1533                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1534                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1535              
    1536                      .dwendtag $C$DW$T$41
    1537              
    1538              
    1539              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1540                      .dwattr $C$DW$T$42, DW_AT_name("CONFIGLOCK_REG")
    1541                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    1542              $C$DW$144       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$21)
    1544                      .dwattr $C$DW$144, DW_AT_name("all")
    1545                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_all")
    1546                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549              $C$DW$145       .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$41)
    1551                      .dwattr $C$DW$145, DW_AT_name("bit")
    1552                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_bit")
    1553                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1555              
    1556                      .dwendtag $C$DW$T$42
    1557              
    1558              
    1559              $C$DW$T$43      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   30

    1560                      .dwattr $C$DW$T$43, DW_AT_name("LOCK_BITS")
    1561                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    1562              $C$DW$146       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$146, DW_AT_name("TSNSCTL")
    1565                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_TSNSCTL")
    1566                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0f)
    1567                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1568                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1570              
    1571              $C$DW$147       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1573                      .dwattr $C$DW$147, DW_AT_name("ANAREFCTL")
    1574                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ANAREFCTL")
    1575                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0e)
    1576                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1577                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1578                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1579              
    1580              $C$DW$148       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1582                      .dwattr $C$DW$148, DW_AT_name("VMONCTL")
    1583                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_VMONCTL")
    1584                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0d)
    1585                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1586                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1588              
    1589              $C$DW$149       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1591                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    1592                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    1593                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0c)
    1594                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1595                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1596                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1597              
    1598              $C$DW$150       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1600                      .dwattr $C$DW$150, DW_AT_name("rsvd2")
    1601                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd2")
    1602                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0b)
    1603                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1604                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1606              
    1607              $C$DW$151       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1609                      .dwattr $C$DW$151, DW_AT_name("CMPHPMXSEL")
    1610                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_CMPHPMXSEL")
    1611                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0a)
    1612                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1613                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   31

    1615              
    1616              $C$DW$152       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1618                      .dwattr $C$DW$152, DW_AT_name("CMPLPMXSEL")
    1619                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_CMPLPMXSEL")
    1620                      .dwattr $C$DW$152, DW_AT_bit_offset(0x09)
    1621                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1622                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1623                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1624              
    1625              $C$DW$153       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1627                      .dwattr $C$DW$153, DW_AT_name("CMPHNMXSEL")
    1628                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_CMPHNMXSEL")
    1629                      .dwattr $C$DW$153, DW_AT_bit_offset(0x08)
    1630                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1631                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1633              
    1634              $C$DW$154       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1636                      .dwattr $C$DW$154, DW_AT_name("CMPLNMXSEL")
    1637                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_CMPLNMXSEL")
    1638                      .dwattr $C$DW$154, DW_AT_bit_offset(0x07)
    1639                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1640                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1642              
    1643              $C$DW$155       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1645                      .dwattr $C$DW$155, DW_AT_name("VREGCTL")
    1646                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_VREGCTL")
    1647                      .dwattr $C$DW$155, DW_AT_bit_offset(0x06)
    1648                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1649                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1651              
    1652              $C$DW$156       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1654                      .dwattr $C$DW$156, DW_AT_name("rsvd3")
    1655                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd3")
    1656                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    1657                      .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    1658                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1659                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1660              
    1661              $C$DW$157       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1663                      .dwattr $C$DW$157, DW_AT_name("rsvd4")
    1664                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd4")
    1665                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00)
    1666                      .dwattr $C$DW$157, DW_AT_bit_size(0x10)
    1667                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1668                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1669              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{4B1BFA3F-B1EE-4114-A51B-89921B25CED2} PAGE   32

    1670                      .dwendtag $C$DW$T$43
    1671              
    1672              
    1673              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1674                      .dwattr $C$DW$T$44, DW_AT_name("LOCK_REG")
    1675                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1676              $C$DW$158       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$21)
    1678                      .dwattr $C$DW$158, DW_AT_name("all")
    1679                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    1680                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1682              
    1683              $C$DW$159       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$43)
    1685                      .dwattr $C$DW$159, DW_AT_name("bit")
    1686                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    1687                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690                      .dwendtag $C$DW$T$44
    1691              
    1692              
    1693              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1694                      .dwattr $C$DW$T$45, DW_AT_name("TSNSCTL_BITS")
    1695                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1696              $C$DW$160       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$160, DW_AT_name("ENABLE")
    1699                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ENABLE")
    1700                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f)
    1701                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    1702                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1703                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1704              
    1705              $C$DW$161       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$161, DW_AT_name("rsvd1")
    1708                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd1")
    1709                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    1710                      .dwattr $C$DW$161, DW_AT_bit_size(0x0f)
    1711                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1713              
    1714                      .dwendtag $C$DW$T$45
    1715              
    1716              
    1717              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1718                      .dwattr $C$DW$T$46, DW_AT_name("TSNSCTL_REG")
