TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DeviceSupport/source/f28003x_pievect.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PIE_RESERVED_ISR")

    1489                      .global _CLB1_ISR
    1490                      .global _CLB2_ISR
    1491                      .global _CLB3_ISR
    1492                      .global _CLB4_ISR
    1493                      .global _SPIA_RX_ISR
    1494                      .global _SPIA_TX_ISR
    1495                      .global _SPIB_RX_ISR
    1496                      .global _SPIB_TX_ISR
    1497                      .global _DMA_CH1_ISR
    1498                      .global _DMA_CH2_ISR
    1499                      .global _DMA_CH3_ISR
    1500                      .global _DMA_CH4_ISR
    1501                      .global _DMA_CH5_ISR
    1502                      .global _DMA_CH6_ISR
    1503                      .global _I2CA_ISR
    1504                      .global _I2CA_FIFO_ISR
    1505                      .global _I2CB_ISR
    1506                      .global _I2CB_FIFO_ISR
    1507                      .global _SCIA_RX_ISR
    1508                      .global _SCIA_TX_ISR
    1509                      .global _SCIB_RX_ISR
    1510                      .global _SCIB_TX_ISR
    1511                      .global _CANA0_ISR
    1512                      .global _CANA1_ISR
    1513                      .global _ADCA_EVT_ISR
    1514                      .global _ADCA2_ISR
    1515                      .global _ADCA3_ISR
    1516                      .global _ADCA4_ISR
    1517                      .global _ADCB_EVT_ISR
    1518                      .global _ADCB2_ISR
    1519                      .global _ADCB3_ISR
    1520                      .global _ADCB4_ISR
    1521                      .global _CLA1_1_ISR
    1522                      .global _CLA1_2_ISR
    1523                      .global _CLA1_3_ISR
    1524                      .global _CLA1_4_ISR
    1525                      .global _CLA1_5_ISR
    1526                      .global _CLA1_6_ISR
    1527                      .global _CLA1_7_ISR
    1528                      .global _CLA1_8_ISR
    1529                      .global _XINT3_ISR
    1530                      .global _XINT4_ISR
    1531                      .global _XINT5_ISR
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   33

    1532                      .global _MPOST_ISR
    1533                      .global _FMC_ISR
    1534                      .global _FPU_OVERFLOW_ISR
    1535                      .global _FPU_UNDERFLOW_ISR
    1536                      .global _SYS_ERR_ISR
    1537                      .global _ECAP3_2_ISR
    1538                      .global _SDFM1_ISR
    1539                      .global _SDFM2_ISR
    1540                      .global _SDFM1DR1_ISR
    1541                      .global _SDFM1DR2_ISR
    1542                      .global _SDFM1DR3_ISR
    1543                      .global _SDFM1DR4_ISR
    1544                      .global _SDFM2DR1_ISR
    1545                      .global _SDFM2DR2_ISR
    1546                      .global _SDFM2DR3_ISR
    1547                      .global _SDFM2DR4_ISR
    1548                      .global _FSITXA1_ISR
    1549                      .global _FSITXA2_ISR
    1550                      .global _FSIRXA1_ISR
    1551                      .global _FSIRXA2_ISR
    1552                      .global _DCC0_ISR
    1553                      .global _LINA_0_ISR
    1554                      .global _LINA_1_ISR
    1555                      .global _LINB_0_ISR
    1556                      .global _LINB_1_ISR
    1557                      .global _PMBUSA_ISR
    1558                      .global _DCC1_ISR
    1559                      .global _MCAN_0_ISR
    1560                      .global _MCAN_1_ISR
    1561                      .global _MCAN_ECC_ISR
    1562                      .global _MCAN_WAKE_ISR
    1563                      .global _BGCRC_ISR
    1564                      .global _HICA_ISR
    1565                      .global _ADCC_EVT_ISR
    1566                      .global _ADCC2_ISR
    1567                      .global _ADCC3_ISR
    1568                      .global _ADCC4_ISR
    1569                      .global _RAM_CORR_ERR_ISR
    1570                      .global _FLASH_CORR_ERR_ISR
    1571                      .global _RAM_ACC_VIOL_ISR
    1572                      .global _AES_SINTREQUEST_ISR
    1573                      .global _BGCRC_CLA1_ISR
    1574                      .global _CLA_OVERFLOW_ISR
    1575                      .global _CLA_UNDERFLOW_ISR
    1576                      .global _PieCtrlRegs
    1577                      .global _PieVectTable
    1578              
    1579              ;***************************************************************
    1580              ;* TYPE INFORMATION                                            *
    1581              ;***************************************************************
    1582              
    1583              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1584                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    1585                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1586              $C$DW$145       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   34

    1587                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1588                      .dwattr $C$DW$145, DW_AT_name("ACK1")
    1589                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ACK1")
    1590                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0f)
    1591                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1592                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1594              
    1595              $C$DW$146       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1597                      .dwattr $C$DW$146, DW_AT_name("ACK2")
    1598                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ACK2")
    1599                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0e)
    1600                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1601                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1603              
    1604              $C$DW$147       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1606                      .dwattr $C$DW$147, DW_AT_name("ACK3")
    1607                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ACK3")
    1608                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0d)
    1609                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1610                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1611                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1612              
    1613              $C$DW$148       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1615                      .dwattr $C$DW$148, DW_AT_name("ACK4")
    1616                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ACK4")
    1617                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    1618                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1619                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1620                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1621              
    1622              $C$DW$149       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$149, DW_AT_name("ACK5")
    1625                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ACK5")
    1626                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0b)
    1627                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1628                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1630              
    1631              $C$DW$150       .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1633                      .dwattr $C$DW$150, DW_AT_name("ACK6")
    1634                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ACK6")
    1635                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0a)
    1636                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1637                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1639              
    1640              $C$DW$151       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   35

    1642                      .dwattr $C$DW$151, DW_AT_name("ACK7")
    1643                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ACK7")
    1644                      .dwattr $C$DW$151, DW_AT_bit_offset(0x09)
    1645                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1646                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1647                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1648              
    1649              $C$DW$152       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1651                      .dwattr $C$DW$152, DW_AT_name("ACK8")
    1652                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ACK8")
    1653                      .dwattr $C$DW$152, DW_AT_bit_offset(0x08)
    1654                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1655                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1656                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1657              
    1658              $C$DW$153       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1660                      .dwattr $C$DW$153, DW_AT_name("ACK9")
    1661                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ACK9")
    1662                      .dwattr $C$DW$153, DW_AT_bit_offset(0x07)
    1663                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1664                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1666              
    1667              $C$DW$154       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$154, DW_AT_name("ACK10")
    1670                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ACK10")
    1671                      .dwattr $C$DW$154, DW_AT_bit_offset(0x06)
    1672                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1673                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1675              
    1676              $C$DW$155       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1678                      .dwattr $C$DW$155, DW_AT_name("ACK11")
    1679                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ACK11")
    1680                      .dwattr $C$DW$155, DW_AT_bit_offset(0x05)
    1681                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1682                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1684              
    1685              $C$DW$156       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1687                      .dwattr $C$DW$156, DW_AT_name("ACK12")
    1688                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ACK12")
    1689                      .dwattr $C$DW$156, DW_AT_bit_offset(0x04)
    1690                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1691                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1693              
    1694              $C$DW$157       .dwtag  DW_TAG_member
    1695                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1696                      .dwattr $C$DW$157, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   36

    1697                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd1")
    1698                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00)
    1699                      .dwattr $C$DW$157, DW_AT_bit_size(0x04)
    1700                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1702              
    1703                      .dwendtag $C$DW$T$20
    1704              
    1705              
    1706              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1707                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1708                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1709              $C$DW$158       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1711                      .dwattr $C$DW$158, DW_AT_name("all")
    1712                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    1713                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716              $C$DW$159       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    1718                      .dwattr $C$DW$159, DW_AT_name("bit")
    1719                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    1720                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1721                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1722              
    1723                      .dwendtag $C$DW$T$21
    1724              
    1725              
    1726              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1727                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1728                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1729              $C$DW$160       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1731                      .dwattr $C$DW$160, DW_AT_name("ENPIE")
    1732                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ENPIE")
    1733                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f)
    1734                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    1735                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1737              
    1738              $C$DW$161       .dwtag  DW_TAG_member
    1739                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1740                      .dwattr $C$DW$161, DW_AT_name("PIEVECT")
    1741                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PIEVECT")
    1742                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    1743                      .dwattr $C$DW$161, DW_AT_bit_size(0x0f)
    1744                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1745                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1746              
    1747                      .dwendtag $C$DW$T$22
    1748              
    1749              
    1750              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1751                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   37

    1752                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1753              $C$DW$162       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1755                      .dwattr $C$DW$162, DW_AT_name("all")
    1756                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_all")
    1757                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$163       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
    1762                      .dwattr $C$DW$163, DW_AT_name("bit")
    1763                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_bit")
    1764                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1765                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1766              
    1767                      .dwendtag $C$DW$T$23
    1768              
    1769              
    1770              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1771                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
    1772                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1773              $C$DW$164       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1775                      .dwattr $C$DW$164, DW_AT_name("INTx1")
    1776                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_INTx1")
    1777                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0f)
    1778                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1779                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1781              
    1782              $C$DW$165       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1784                      .dwattr $C$DW$165, DW_AT_name("INTx2")
    1785                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_INTx2")
    1786                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0e)
    1787                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1788                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1789                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1790              
    1791              $C$DW$166       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1793                      .dwattr $C$DW$166, DW_AT_name("INTx3")
    1794                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_INTx3")
    1795                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0d)
    1796                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    1797                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1798                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800              $C$DW$167       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1802                      .dwattr $C$DW$167, DW_AT_name("INTx4")
    1803                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INTx4")
    1804                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0c)
    1805                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    1806                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   38

    1807                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1808              
    1809              $C$DW$168       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1811                      .dwattr $C$DW$168, DW_AT_name("INTx5")
    1812                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INTx5")
    1813                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0b)
    1814                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    1815                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1816                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1817              
    1818              $C$DW$169       .dwtag  DW_TAG_member
    1819                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1820                      .dwattr $C$DW$169, DW_AT_name("INTx6")
    1821                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INTx6")
    1822                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0a)
    1823                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    1824                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1825                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1826              
    1827              $C$DW$170       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1829                      .dwattr $C$DW$170, DW_AT_name("INTx7")
    1830                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INTx7")
    1831                      .dwattr $C$DW$170, DW_AT_bit_offset(0x09)
    1832                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    1833                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1835              
    1836              $C$DW$171       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1838                      .dwattr $C$DW$171, DW_AT_name("INTx8")
    1839                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INTx8")
    1840                      .dwattr $C$DW$171, DW_AT_bit_offset(0x08)
    1841                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    1842                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1843                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1844              
    1845              $C$DW$172       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1847                      .dwattr $C$DW$172, DW_AT_name("INTx9")
    1848                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTx9")
    1849                      .dwattr $C$DW$172, DW_AT_bit_offset(0x07)
    1850                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    1851                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1852                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1853              
    1854              $C$DW$173       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1856                      .dwattr $C$DW$173, DW_AT_name("INTx10")
    1857                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_INTx10")
    1858                      .dwattr $C$DW$173, DW_AT_bit_offset(0x06)
    1859                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    1860                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   39

    1862              
    1863              $C$DW$174       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1865                      .dwattr $C$DW$174, DW_AT_name("INTx11")
    1866                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INTx11")
    1867                      .dwattr $C$DW$174, DW_AT_bit_offset(0x05)
    1868                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    1869                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1870                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1871              
    1872              $C$DW$175       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1874                      .dwattr $C$DW$175, DW_AT_name("INTx12")
    1875                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTx12")
    1876                      .dwattr $C$DW$175, DW_AT_bit_offset(0x04)
    1877                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    1878                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1879                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1880              
    1881              $C$DW$176       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1883                      .dwattr $C$DW$176, DW_AT_name("INTx13")
    1884                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_INTx13")
    1885                      .dwattr $C$DW$176, DW_AT_bit_offset(0x03)
    1886                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    1887                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1888                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1889              
    1890              $C$DW$177       .dwtag  DW_TAG_member
    1891                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1892                      .dwattr $C$DW$177, DW_AT_name("INTx14")
    1893                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_INTx14")
    1894                      .dwattr $C$DW$177, DW_AT_bit_offset(0x02)
    1895                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    1896                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1897                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1898              
    1899              $C$DW$178       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1901                      .dwattr $C$DW$178, DW_AT_name("INTx15")
    1902                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_INTx15")
    1903                      .dwattr $C$DW$178, DW_AT_bit_offset(0x01)
    1904                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    1905                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1906                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1907              
    1908              $C$DW$179       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1910                      .dwattr $C$DW$179, DW_AT_name("INTx16")
    1911                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_INTx16")
    1912                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    1913                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    1914                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1915                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1916              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   40

    1917                      .dwendtag $C$DW$T$24
    1918              
    1919              
    1920              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1921                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
    1922                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1923              $C$DW$180       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1925                      .dwattr $C$DW$180, DW_AT_name("all")
    1926                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    1927                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1929              
    1930              $C$DW$181       .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$24)
    1932                      .dwattr $C$DW$181, DW_AT_name("bit")
    1933                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    1934                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1936              
    1937                      .dwendtag $C$DW$T$25
    1938              
    1939              
    1940              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1941                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
    1942                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1943              $C$DW$182       .dwtag  DW_TAG_member
    1944                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1945                      .dwattr $C$DW$182, DW_AT_name("INTx1")
    1946                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_INTx1")
    1947                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0f)
    1948                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    1949                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1951              
    1952              $C$DW$183       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1954                      .dwattr $C$DW$183, DW_AT_name("INTx2")
    1955                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_INTx2")
    1956                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0e)
    1957                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    1958                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1960              
    1961              $C$DW$184       .dwtag  DW_TAG_member
    1962                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1963                      .dwattr $C$DW$184, DW_AT_name("INTx3")
    1964                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_INTx3")
    1965                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0d)
    1966                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    1967                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1968                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1969              
    1970              $C$DW$185       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   41

    1972                      .dwattr $C$DW$185, DW_AT_name("INTx4")
    1973                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_INTx4")
    1974                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0c)
    1975                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    1976                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1978              
    1979              $C$DW$186       .dwtag  DW_TAG_member
    1980                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1981                      .dwattr $C$DW$186, DW_AT_name("INTx5")
    1982                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_INTx5")
    1983                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0b)
    1984                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    1985                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1986                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1987              
    1988              $C$DW$187       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1990                      .dwattr $C$DW$187, DW_AT_name("INTx6")
    1991                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_INTx6")
    1992                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0a)
    1993                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    1994                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1995                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1996              
    1997              $C$DW$188       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1999                      .dwattr $C$DW$188, DW_AT_name("INTx7")
    2000                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_INTx7")
    2001                      .dwattr $C$DW$188, DW_AT_bit_offset(0x09)
    2002                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2003                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2004                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2005              
    2006              $C$DW$189       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2008                      .dwattr $C$DW$189, DW_AT_name("INTx8")
    2009                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_INTx8")
    2010                      .dwattr $C$DW$189, DW_AT_bit_offset(0x08)
    2011                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2012                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2013                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2014              
    2015              $C$DW$190       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2017                      .dwattr $C$DW$190, DW_AT_name("INTx9")
    2018                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_INTx9")
    2019                      .dwattr $C$DW$190, DW_AT_bit_offset(0x07)
    2020                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2021                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2023              
    2024              $C$DW$191       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2026                      .dwattr $C$DW$191, DW_AT_name("INTx10")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   42

    2027                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_INTx10")
    2028                      .dwattr $C$DW$191, DW_AT_bit_offset(0x06)
    2029                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2030                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2031                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2032              
    2033              $C$DW$192       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2035                      .dwattr $C$DW$192, DW_AT_name("INTx11")
    2036                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_INTx11")
    2037                      .dwattr $C$DW$192, DW_AT_bit_offset(0x05)
    2038                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2039                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2040                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2041              
    2042              $C$DW$193       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2044                      .dwattr $C$DW$193, DW_AT_name("INTx12")
    2045                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_INTx12")
    2046                      .dwattr $C$DW$193, DW_AT_bit_offset(0x04)
    2047                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2048                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2049                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2050              
    2051              $C$DW$194       .dwtag  DW_TAG_member
    2052                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2053                      .dwattr $C$DW$194, DW_AT_name("INTx13")
    2054                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_INTx13")
    2055                      .dwattr $C$DW$194, DW_AT_bit_offset(0x03)
    2056                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2057                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2059              
    2060              $C$DW$195       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2062                      .dwattr $C$DW$195, DW_AT_name("INTx14")
    2063                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_INTx14")
    2064                      .dwattr $C$DW$195, DW_AT_bit_offset(0x02)
    2065                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2066                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2067                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2068              
    2069              $C$DW$196       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2071                      .dwattr $C$DW$196, DW_AT_name("INTx15")
    2072                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_INTx15")
    2073                      .dwattr $C$DW$196, DW_AT_bit_offset(0x01)
    2074                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2075                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2076                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2077              
    2078              $C$DW$197       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2080                      .dwattr $C$DW$197, DW_AT_name("INTx16")
    2081                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_INTx16")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   43

    2082                      .dwattr $C$DW$197, DW_AT_bit_offset(0x00)
    2083                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2084                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2085                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2086              
    2087                      .dwendtag $C$DW$T$26
    2088              
    2089              
    2090              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2091                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
    2092                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2093              $C$DW$198       .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2095                      .dwattr $C$DW$198, DW_AT_name("all")
    2096                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_all")
    2097                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2098                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2099              
    2100              $C$DW$199       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$26)
    2102                      .dwattr $C$DW$199, DW_AT_name("bit")
    2103                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_bit")
    2104                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2105                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2106              
    2107                      .dwendtag $C$DW$T$27
    2108              
    2109              
    2110              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2111                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
    2112                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2113              $C$DW$200       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2115                      .dwattr $C$DW$200, DW_AT_name("INTx1")
    2116                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_INTx1")
    2117                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0f)
    2118                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2119                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2121              
    2122              $C$DW$201       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2124                      .dwattr $C$DW$201, DW_AT_name("INTx2")
    2125                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_INTx2")
    2126                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0e)
    2127                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2128                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2129                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2130              
    2131              $C$DW$202       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2133                      .dwattr $C$DW$202, DW_AT_name("INTx3")
    2134                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_INTx3")
    2135                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0d)
    2136                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   44

    2137                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2138                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2139              
    2140              $C$DW$203       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2142                      .dwattr $C$DW$203, DW_AT_name("INTx4")
    2143                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_INTx4")
    2144                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0c)
    2145                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2146                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2148              
    2149              $C$DW$204       .dwtag  DW_TAG_member
    2150                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2151                      .dwattr $C$DW$204, DW_AT_name("INTx5")
    2152                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTx5")
    2153                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0b)
    2154                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2155                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2157              
    2158              $C$DW$205       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2160                      .dwattr $C$DW$205, DW_AT_name("INTx6")
    2161                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_INTx6")
    2162                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0a)
    2163                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2164                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2165                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2166              
    2167              $C$DW$206       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2169                      .dwattr $C$DW$206, DW_AT_name("INTx7")
    2170                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_INTx7")
    2171                      .dwattr $C$DW$206, DW_AT_bit_offset(0x09)
    2172                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2173                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2174                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2175              
    2176              $C$DW$207       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2178                      .dwattr $C$DW$207, DW_AT_name("INTx8")
    2179                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_INTx8")
    2180                      .dwattr $C$DW$207, DW_AT_bit_offset(0x08)
    2181                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2182                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2183                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2184              
    2185              $C$DW$208       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2187                      .dwattr $C$DW$208, DW_AT_name("INTx9")
    2188                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_INTx9")
    2189                      .dwattr $C$DW$208, DW_AT_bit_offset(0x07)
    2190                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2191                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   45

    2192                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2193              
    2194              $C$DW$209       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$209, DW_AT_name("INTx10")
    2197                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_INTx10")
    2198                      .dwattr $C$DW$209, DW_AT_bit_offset(0x06)
    2199                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2200                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2201                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2202              
    2203              $C$DW$210       .dwtag  DW_TAG_member
    2204                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2205                      .dwattr $C$DW$210, DW_AT_name("INTx11")
    2206                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_INTx11")
    2207                      .dwattr $C$DW$210, DW_AT_bit_offset(0x05)
    2208                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2209                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2211              
    2212              $C$DW$211       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2214                      .dwattr $C$DW$211, DW_AT_name("INTx12")
    2215                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_INTx12")
    2216                      .dwattr $C$DW$211, DW_AT_bit_offset(0x04)
    2217                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2218                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2219                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2220              
    2221              $C$DW$212       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2223                      .dwattr $C$DW$212, DW_AT_name("INTx13")
    2224                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_INTx13")
    2225                      .dwattr $C$DW$212, DW_AT_bit_offset(0x03)
    2226                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2227                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2228                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2229              
    2230              $C$DW$213       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2232                      .dwattr $C$DW$213, DW_AT_name("INTx14")
    2233                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_INTx14")
    2234                      .dwattr $C$DW$213, DW_AT_bit_offset(0x02)
    2235                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2236                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2237                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2238              
    2239              $C$DW$214       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2241                      .dwattr $C$DW$214, DW_AT_name("INTx15")
    2242                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_INTx15")
    2243                      .dwattr $C$DW$214, DW_AT_bit_offset(0x01)
    2244                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2245                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2246                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   46

    2247              
    2248              $C$DW$215       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2250                      .dwattr $C$DW$215, DW_AT_name("INTx16")
    2251                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_INTx16")
    2252                      .dwattr $C$DW$215, DW_AT_bit_offset(0x00)
    2253                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2254                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2256              
    2257                      .dwendtag $C$DW$T$28
    2258              
    2259              
    2260              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2261                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
    2262                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2263              $C$DW$216       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2265                      .dwattr $C$DW$216, DW_AT_name("all")
    2266                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_all")
    2267                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2268                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2269              
    2270              $C$DW$217       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$28)
    2272                      .dwattr $C$DW$217, DW_AT_name("bit")
    2273                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_bit")
    2274                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2276              
    2277                      .dwendtag $C$DW$T$29
    2278              
    2279              
    2280              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2281                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
    2282                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2283              $C$DW$218       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2285                      .dwattr $C$DW$218, DW_AT_name("INTx1")
    2286                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_INTx1")
    2287                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0f)
    2288                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2289                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2290                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2291              
    2292              $C$DW$219       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2294                      .dwattr $C$DW$219, DW_AT_name("INTx2")
    2295                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_INTx2")
    2296                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0e)
    2297                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    2298                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2299                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2300              
    2301              $C$DW$220       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   47

    2302                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2303                      .dwattr $C$DW$220, DW_AT_name("INTx3")
    2304                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_INTx3")
    2305                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0d)
    2306                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    2307                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2309              
    2310              $C$DW$221       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2312                      .dwattr $C$DW$221, DW_AT_name("INTx4")
    2313                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_INTx4")
    2314                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0c)
    2315                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2316                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2317                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2318              
    2319              $C$DW$222       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2321                      .dwattr $C$DW$222, DW_AT_name("INTx5")
    2322                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_INTx5")
    2323                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0b)
    2324                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2325                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2326                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2327              
    2328              $C$DW$223       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2330                      .dwattr $C$DW$223, DW_AT_name("INTx6")
    2331                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_INTx6")
    2332                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0a)
    2333                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2334                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2335                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2336              
    2337              $C$DW$224       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2339                      .dwattr $C$DW$224, DW_AT_name("INTx7")
    2340                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_INTx7")
    2341                      .dwattr $C$DW$224, DW_AT_bit_offset(0x09)
    2342                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2343                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2344                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2345              
    2346              $C$DW$225       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2348                      .dwattr $C$DW$225, DW_AT_name("INTx8")
    2349                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_INTx8")
    2350                      .dwattr $C$DW$225, DW_AT_bit_offset(0x08)
    2351                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2352                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2353                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2354              
    2355              $C$DW$226       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   48

    2357                      .dwattr $C$DW$226, DW_AT_name("INTx9")
    2358                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_INTx9")
    2359                      .dwattr $C$DW$226, DW_AT_bit_offset(0x07)
    2360                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    2361                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2362                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2363              
    2364              $C$DW$227       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2366                      .dwattr $C$DW$227, DW_AT_name("INTx10")
    2367                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_INTx10")
    2368                      .dwattr $C$DW$227, DW_AT_bit_offset(0x06)
    2369                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    2370                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2372              
    2373              $C$DW$228       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2375                      .dwattr $C$DW$228, DW_AT_name("INTx11")
    2376                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_INTx11")
    2377                      .dwattr $C$DW$228, DW_AT_bit_offset(0x05)
    2378                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2379                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2380                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2381              
    2382              $C$DW$229       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2384                      .dwattr $C$DW$229, DW_AT_name("INTx12")
    2385                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_INTx12")
    2386                      .dwattr $C$DW$229, DW_AT_bit_offset(0x04)
    2387                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2388                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2389                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2390              
    2391              $C$DW$230       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2393                      .dwattr $C$DW$230, DW_AT_name("INTx13")
    2394                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_INTx13")
    2395                      .dwattr $C$DW$230, DW_AT_bit_offset(0x03)
    2396                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    2397                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2398                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2399              
    2400              $C$DW$231       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2402                      .dwattr $C$DW$231, DW_AT_name("INTx14")
    2403                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_INTx14")
    2404                      .dwattr $C$DW$231, DW_AT_bit_offset(0x02)
    2405                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    2406                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2407                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2408              
    2409              $C$DW$232       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2411                      .dwattr $C$DW$232, DW_AT_name("INTx15")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   49

    2412                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_INTx15")
    2413                      .dwattr $C$DW$232, DW_AT_bit_offset(0x01)
    2414                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    2415                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2416                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2417              
    2418              $C$DW$233       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2420                      .dwattr $C$DW$233, DW_AT_name("INTx16")
    2421                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_INTx16")
    2422                      .dwattr $C$DW$233, DW_AT_bit_offset(0x00)
    2423                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    2424                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2425                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2426              
    2427                      .dwendtag $C$DW$T$30
    2428              
    2429              
    2430              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2431                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    2432                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2433              $C$DW$234       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2435                      .dwattr $C$DW$234, DW_AT_name("all")
    2436                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_all")
    2437                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2438                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2439              
    2440              $C$DW$235       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$30)
    2442                      .dwattr $C$DW$235, DW_AT_name("bit")
    2443                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_bit")
    2444                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2445                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2446              
    2447                      .dwendtag $C$DW$T$31
    2448              
    2449              
    2450              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2451                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    2452                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2453              $C$DW$236       .dwtag  DW_TAG_member
    2454                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2455                      .dwattr $C$DW$236, DW_AT_name("INTx1")
    2456                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_INTx1")
    2457                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0f)
    2458                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    2459                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2460                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2461              
    2462              $C$DW$237       .dwtag  DW_TAG_member
    2463                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2464                      .dwattr $C$DW$237, DW_AT_name("INTx2")
    2465                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_INTx2")
    2466                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   50

    2467                      .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    2468                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2469                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2470              
    2471              $C$DW$238       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2473                      .dwattr $C$DW$238, DW_AT_name("INTx3")
    2474                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_INTx3")
    2475                      .dwattr $C$DW$238, DW_AT_bit_offset(0x0d)
    2476                      .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    2477                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2478                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2479              
    2480              $C$DW$239       .dwtag  DW_TAG_member
    2481                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2482                      .dwattr $C$DW$239, DW_AT_name("INTx4")
    2483                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_INTx4")
    2484                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0c)
    2485                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    2486                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2487                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2488              
    2489              $C$DW$240       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2491                      .dwattr $C$DW$240, DW_AT_name("INTx5")
    2492                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_INTx5")
    2493                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0b)
    2494                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    2495                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2496                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2497              
    2498              $C$DW$241       .dwtag  DW_TAG_member
    2499                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2500                      .dwattr $C$DW$241, DW_AT_name("INTx6")
    2501                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_INTx6")
    2502                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0a)
    2503                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    2504                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2505                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2506              
    2507              $C$DW$242       .dwtag  DW_TAG_member
    2508                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2509                      .dwattr $C$DW$242, DW_AT_name("INTx7")
    2510                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_INTx7")
    2511                      .dwattr $C$DW$242, DW_AT_bit_offset(0x09)
    2512                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    2513                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2514                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2515              
    2516              $C$DW$243       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2518                      .dwattr $C$DW$243, DW_AT_name("INTx8")
    2519                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_INTx8")
    2520                      .dwattr $C$DW$243, DW_AT_bit_offset(0x08)
    2521                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   51

    2522                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2524              
    2525              $C$DW$244       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2527                      .dwattr $C$DW$244, DW_AT_name("INTx9")
    2528                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_INTx9")
    2529                      .dwattr $C$DW$244, DW_AT_bit_offset(0x07)
    2530                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    2531                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2533              
    2534              $C$DW$245       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2536                      .dwattr $C$DW$245, DW_AT_name("INTx10")
    2537                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_INTx10")
    2538                      .dwattr $C$DW$245, DW_AT_bit_offset(0x06)
    2539                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    2540                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2541                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2542              
    2543              $C$DW$246       .dwtag  DW_TAG_member
    2544                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2545                      .dwattr $C$DW$246, DW_AT_name("INTx11")
    2546                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_INTx11")
    2547                      .dwattr $C$DW$246, DW_AT_bit_offset(0x05)
    2548                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
    2549                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2551              
    2552              $C$DW$247       .dwtag  DW_TAG_member
    2553                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2554                      .dwattr $C$DW$247, DW_AT_name("INTx12")
    2555                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_INTx12")
    2556                      .dwattr $C$DW$247, DW_AT_bit_offset(0x04)
    2557                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    2558                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2559                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2560              
    2561              $C$DW$248       .dwtag  DW_TAG_member
    2562                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2563                      .dwattr $C$DW$248, DW_AT_name("INTx13")
    2564                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_INTx13")
    2565                      .dwattr $C$DW$248, DW_AT_bit_offset(0x03)
    2566                      .dwattr $C$DW$248, DW_AT_bit_size(0x01)
    2567                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2568                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2569              
    2570              $C$DW$249       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2572                      .dwattr $C$DW$249, DW_AT_name("INTx14")
    2573                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_INTx14")
    2574                      .dwattr $C$DW$249, DW_AT_bit_offset(0x02)
    2575                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    2576                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   52

    2577                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2578              
    2579              $C$DW$250       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2581                      .dwattr $C$DW$250, DW_AT_name("INTx15")
    2582                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_INTx15")
    2583                      .dwattr $C$DW$250, DW_AT_bit_offset(0x01)
    2584                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    2585                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2586                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2587              
    2588              $C$DW$251       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2590                      .dwattr $C$DW$251, DW_AT_name("INTx16")
    2591                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_INTx16")
    2592                      .dwattr $C$DW$251, DW_AT_bit_offset(0x00)
    2593                      .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    2594                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2595                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2596              
    2597                      .dwendtag $C$DW$T$32
    2598              
    2599              
    2600              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2601                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
    2602                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2603              $C$DW$252       .dwtag  DW_TAG_member
    2604                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2605                      .dwattr $C$DW$252, DW_AT_name("all")
    2606                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_all")
    2607                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2608                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2609              
    2610              $C$DW$253       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$32)
    2612                      .dwattr $C$DW$253, DW_AT_name("bit")
    2613                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_bit")
    2614                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2616              
    2617                      .dwendtag $C$DW$T$33
    2618              
    2619              
    2620              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2621                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    2622                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2623              $C$DW$254       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    2625                      .dwattr $C$DW$254, DW_AT_name("INTx1")
    2626                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_INTx1")
    2627                      .dwattr $C$DW$254, DW_AT_bit_offset(0x0f)
    2628                      .dwattr $C$DW$254, DW_AT_bit_size(0x01)
    2629                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2630                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2631              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   53

    2632              $C$DW$255       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    2634                      .dwattr $C$DW$255, DW_AT_name("INTx2")
    2635                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_INTx2")
    2636                      .dwattr $C$DW$255, DW_AT_bit_offset(0x0e)
    2637                      .dwattr $C$DW$255, DW_AT_bit_size(0x01)
    2638                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2639                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2640              
    2641              $C$DW$256       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    2643                      .dwattr $C$DW$256, DW_AT_name("INTx3")
    2644                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_INTx3")
    2645                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0d)
    2646                      .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    2647                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2648                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2649              
    2650              $C$DW$257       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2652                      .dwattr $C$DW$257, DW_AT_name("INTx4")
    2653                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_INTx4")
    2654                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0c)
    2655                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    2656                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2657                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2658              
    2659              $C$DW$258       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2661                      .dwattr $C$DW$258, DW_AT_name("INTx5")
    2662                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_INTx5")
    2663                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0b)
    2664                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    2665                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668              $C$DW$259       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2670                      .dwattr $C$DW$259, DW_AT_name("INTx6")
    2671                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_INTx6")
    2672                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0a)
    2673                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    2674                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2675                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2676              
    2677              $C$DW$260       .dwtag  DW_TAG_member
    2678                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2679                      .dwattr $C$DW$260, DW_AT_name("INTx7")
    2680                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_INTx7")
    2681                      .dwattr $C$DW$260, DW_AT_bit_offset(0x09)
    2682                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    2683                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2684                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2685              
    2686              $C$DW$261       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   54

    2687                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2688                      .dwattr $C$DW$261, DW_AT_name("INTx8")
    2689                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_INTx8")
    2690                      .dwattr $C$DW$261, DW_AT_bit_offset(0x08)
    2691                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    2692                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2693                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2694              
    2695              $C$DW$262       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2697                      .dwattr $C$DW$262, DW_AT_name("INTx9")
    2698                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INTx9")
    2699                      .dwattr $C$DW$262, DW_AT_bit_offset(0x07)
    2700                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    2701                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2702                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2703              
    2704              $C$DW$263       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2706                      .dwattr $C$DW$263, DW_AT_name("INTx10")
    2707                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_INTx10")
    2708                      .dwattr $C$DW$263, DW_AT_bit_offset(0x06)
    2709                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    2710                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2711                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2712              
    2713              $C$DW$264       .dwtag  DW_TAG_member
    2714                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    2715                      .dwattr $C$DW$264, DW_AT_name("INTx11")
    2716                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INTx11")
    2717                      .dwattr $C$DW$264, DW_AT_bit_offset(0x05)
    2718                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    2719                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2720                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2721              
    2722              $C$DW$265       .dwtag  DW_TAG_member
    2723                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2724                      .dwattr $C$DW$265, DW_AT_name("INTx12")
    2725                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INTx12")
    2726                      .dwattr $C$DW$265, DW_AT_bit_offset(0x04)
    2727                      .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    2728                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2729                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2730              
    2731              $C$DW$266       .dwtag  DW_TAG_member
    2732                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2733                      .dwattr $C$DW$266, DW_AT_name("INTx13")
    2734                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_INTx13")
    2735                      .dwattr $C$DW$266, DW_AT_bit_offset(0x03)
    2736                      .dwattr $C$DW$266, DW_AT_bit_size(0x01)
    2737                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2738                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2739              
    2740              $C$DW$267       .dwtag  DW_TAG_member
    2741                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   55

    2742                      .dwattr $C$DW$267, DW_AT_name("INTx14")
    2743                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_INTx14")
    2744                      .dwattr $C$DW$267, DW_AT_bit_offset(0x02)
    2745                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    2746                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2747                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2748              
    2749              $C$DW$268       .dwtag  DW_TAG_member
    2750                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    2751                      .dwattr $C$DW$268, DW_AT_name("INTx15")
    2752                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_INTx15")
    2753                      .dwattr $C$DW$268, DW_AT_bit_offset(0x01)
    2754                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    2755                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2756                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2757              
    2758              $C$DW$269       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    2760                      .dwattr $C$DW$269, DW_AT_name("INTx16")
    2761                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_INTx16")
    2762                      .dwattr $C$DW$269, DW_AT_bit_offset(0x00)
    2763                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    2764                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2765                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2766              
    2767                      .dwendtag $C$DW$T$34
    2768              
    2769              
    2770              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2771                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    2772                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2773              $C$DW$270       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    2775                      .dwattr $C$DW$270, DW_AT_name("all")
    2776                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_all")
    2777                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2778                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2779              
    2780              $C$DW$271       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$34)
    2782                      .dwattr $C$DW$271, DW_AT_name("bit")
    2783                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_bit")
    2784                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2785                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2786              
    2787                      .dwendtag $C$DW$T$35
    2788              
    2789              
    2790              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2791                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    2792                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2793              $C$DW$272       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    2795                      .dwattr $C$DW$272, DW_AT_name("INTx1")
    2796                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INTx1")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E6713915-E020-40D4-AD26-5143A6535D2C} PAGE   56

    2797                      .dwattr $C$DW$272, DW_AT_bit_offset(0x0f)
    2798                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    2799                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2800                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2801              
    2802              $C$DW$273       .dwtag  DW_TAG_member
    2803                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    2804                      .dwattr $C$DW$273, DW_AT_name("INTx2")
    2805                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_INTx2")
    2806                      .dwattr $C$DW$273, DW_AT_bit_offset(0x0e)
    2807                      .dwattr $C$DW$273, DW_AT_bit_size(0x01)
    2808                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2809                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2810              
    2811              $C$DW$274       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    2813                      .dwattr $C$DW$274, DW_AT_name("INTx3")
    2814                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_INTx3")
    2815                      .dwattr $C$DW$274, DW_AT_bit_offset(0x0d)
    2816                      .dwattr $C$DW$274, DW_AT_bit_size(0x01)
    2817                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2818                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2819              
    2820              $C$DW$275       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2822                      .dwattr $C$DW$275, DW_AT_name("INTx4")
    2823                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INTx4")
    2824                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0c)
    2825                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    2826                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2827                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2828              
    2829              $C$DW$276       .dwtag  DW_TAG_member
    2830                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2831                      .dwattr $C$DW$276, DW_AT_name("INTx5")
    2832                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INTx5")
    2833                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0b)
    2834                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    2835                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2836                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2837              
    2838              $C$DW$277       .dwtag  DW_TAG_member
    2839                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2840                      .dwattr $C$DW$277, DW_AT_name("INTx6")
    2841                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INTx6")
    2842                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0a)
    2843                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    2844                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2845                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2846              
    2847              $C$DW$278       .dwtag  DW_TAG_member
    2848                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    2849                      .dwattr $C$DW$278, DW_AT_name("INTx7")
    2850                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INTx7")
