TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DeviceSupport/source/f28003x_cputimers.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("CpuTimer0Regs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CpuTimer0Regs")

     252                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 149,column 5,is_stmt,isa 0
     253 00000003 E203          MOV32     *+XAR4[4],R0H         ; [CPU_FPU] |149| 
         00000004 00E4 
     254                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 152,column 5,is_stmt,isa 0
     255 00000005 E688          F32TOI32  R0H,R2H               ; [CPU_FPU] |152| 
         00000006 0010 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE    6

     256                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 150,column 5,is_stmt,isa 0
     257 00000007 E203          MOV32     *+XAR4[6],R1H         ; [CPU_FPU] |150| 
         00000008 01F4 
     258                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 152,column 5,is_stmt,isa 0
     259 00000009 E203          MOV32     *+XAR5[2],R0H         ; [CPU_FPU] |152| 
         0000000a 00D5 
     260                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 157,column 5,is_stmt,isa 0
     261 0000000b 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |157| 
     262 0000000c 2BF5          MOV       *+XAR5[6],#0          ; [CPU_ALU] |157| 
     263                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 158,column 5,is_stmt,isa 0
     264 0000000d 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |158| 
     265 0000000e 2BFD          MOV       *+XAR5[7],#0          ; [CPU_ALU] |158| 
     266                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 167,column 5,is_stmt,isa 0
     267 0000000f 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |167| 
     268 00000010 1AE5          OR        *+XAR5[4],#0x0010     ; [CPU_ALU] |167| 
         00000011 0010 
     269                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 172,column 5,is_stmt,isa 0
     270 00000012 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |172| 
     271 00000013 1AE5          OR        *+XAR5[4],#0x0020     ; [CPU_ALU] |172| 
         00000014 0020 
     272                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 173,column 5,is_stmt,isa 0
     273 00000015 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |173| 
     274 00000016 18E5          AND       *+XAR5[4],#0xfbff     ; [CPU_ALU] |173| 
         00000017 FBFF 
     275                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 178,column 5,is_stmt,isa 0
     276 00000018 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |178| 
     277 00000019 18E5          AND       *+XAR5[4],#0xf7ff     ; [CPU_ALU] |178| 
         0000001a F7FF 
     278                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 183,column 5,is_stmt,isa 0
     279 0000001b 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |183| 
     280                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 188,column 5,is_stmt,isa 0
     281 0000001c 0200          MOVB      ACC,#0                ; [CPU_ALU] |188| 
     282                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 183,column 5,is_stmt,isa 0
     283 0000001d 1AE5          OR        *+XAR5[4],#0x4000     ; [CPU_ALU] |183| 
         0000001e 4000 
     284                      .dwpsn  file "../DeviceSupport/source/f28003x_cputimers.c",line 188,column 5,is_stmt,isa 0
     285 0000001f 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_ALU] |188| 
     286              $C$DW$16        .dwtag  DW_TAG_TI_branch
     287                      .dwattr $C$DW$16, DW_AT_low_pc(0x00)
     288                      .dwattr $C$DW$16, DW_AT_TI_return
     289              
     290 00000020 0006          LRETR     ; [CPU_ALU] 
     291                      ; return occurs ; [] 
     292                      .dwattr $C$DW$9, DW_AT_TI_end_file("../DeviceSupport/source/f28003x_cputimers.c")
     293                      .dwattr $C$DW$9, DW_AT_TI_end_line(0xbd)
     294                      .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     295                      .dwendentry
     296                      .dwendtag $C$DW$9
     297              
     298              ;**************************************************************
     299              ;* UNDEFINED EXTERNAL REFERENCES                              *
     300              ;**************************************************************
     301                      .global _CpuTimer0Regs
     302                      .global _CpuTimer1Regs
     303                      .global _CpuTimer2Regs
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE    7

     304              
     305              ;***************************************************************
     306              ;* TYPE INFORMATION                                            *
     307              ;***************************************************************
     308              
     309              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     310                      .dwattr $C$DW$T$20, DW_AT_name("CPUTIMER_REGS")
     311                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     312              $C$DW$17        .dwtag  DW_TAG_member
     313                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$30)
     314                      .dwattr $C$DW$17, DW_AT_name("TIM")
     315                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_TIM")
     316                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     317                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     318              
     319              $C$DW$18        .dwtag  DW_TAG_member
     320                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$26)
     321                      .dwattr $C$DW$18, DW_AT_name("PRD")
     322                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_PRD")
     323                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     324                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     325              
     326              $C$DW$19        .dwtag  DW_TAG_member
     327                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$28)
     328                      .dwattr $C$DW$19, DW_AT_name("TCR")
     329                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_TCR")
     330                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     331                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     332              
     333              $C$DW$20        .dwtag  DW_TAG_member
     334                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     335                      .dwattr $C$DW$20, DW_AT_name("rsvd1")
     336                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_rsvd1")
     337                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     338                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     339              
     340              $C$DW$21        .dwtag  DW_TAG_member
     341                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$34)
     342                      .dwattr $C$DW$21, DW_AT_name("TPR")
     343                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_TPR")
     344                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     345                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     346              
     347              $C$DW$22        .dwtag  DW_TAG_member
     348                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$32)
     349                      .dwattr $C$DW$22, DW_AT_name("TPRH")
     350                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_TPRH")
     351                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     352                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     353              
     354                      .dwendtag $C$DW$T$20
     355              
     356              $C$DW$23        .dwtag  DW_TAG_TI_far_type
     357                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
     358              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE    8

     359              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
     360                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$23)
     361              
     362              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     363                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     364                      .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     365              
     366              
     367              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     368                      .dwattr $C$DW$T$24, DW_AT_name("CPUTIMER_VARS")
     369                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     370              $C$DW$24        .dwtag  DW_TAG_member
     371                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     372                      .dwattr $C$DW$24, DW_AT_name("RegsAddr")
     373                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_RegsAddr")
     374                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     375                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     376              
     377              $C$DW$25        .dwtag  DW_TAG_member
     378                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$23)
     379                      .dwattr $C$DW$25, DW_AT_name("InterruptCount")
     380                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_InterruptCount")
     381                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     382                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     383              
     384              $C$DW$26        .dwtag  DW_TAG_member
     385                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$16)
     386                      .dwattr $C$DW$26, DW_AT_name("CPUFreqInMHz")
     387                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_CPUFreqInMHz")
     388                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     389                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     390              
     391              $C$DW$27        .dwtag  DW_TAG_member
     392                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$16)
     393                      .dwattr $C$DW$27, DW_AT_name("PeriodInUSec")
     394                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_PeriodInUSec")
     395                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     396                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     397              
     398                      .dwendtag $C$DW$T$24
     399              
     400              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     401                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
     402                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     403              
     404              $C$DW$28        .dwtag  DW_TAG_TI_far_type
     405                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$35)
     406              
     407              $C$DW$T$36      .dwtag  DW_TAG_const_type
     408                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$28)
     409              
     410              
     411              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     412                      .dwattr $C$DW$T$25, DW_AT_name("PRD_BITS")
     413                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE    9

     414              $C$DW$29        .dwtag  DW_TAG_member
     415                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     416                      .dwattr $C$DW$29, DW_AT_name("LSW")
     417                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_LSW")
     418                      .dwattr $C$DW$29, DW_AT_bit_offset(0x00)
     419                      .dwattr $C$DW$29, DW_AT_bit_size(0x10)
     420                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     421                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     422              
     423              $C$DW$30        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     425                      .dwattr $C$DW$30, DW_AT_name("MSW")
     426                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_MSW")
     427                      .dwattr $C$DW$30, DW_AT_bit_offset(0x00)
     428                      .dwattr $C$DW$30, DW_AT_bit_size(0x10)
     429                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     430                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     431              
     432                      .dwendtag $C$DW$T$25
     433              
     434              
     435              $C$DW$T$26      .dwtag  DW_TAG_union_type
     436                      .dwattr $C$DW$T$26, DW_AT_name("PRD_REG")
     437                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     438              $C$DW$31        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
     440                      .dwattr $C$DW$31, DW_AT_name("all")
     441                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_all")
     442                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     443                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     444              
     445              $C$DW$32        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$25)
     447                      .dwattr $C$DW$32, DW_AT_name("bit")
     448                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_bit")
     449                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     451              
     452                      .dwendtag $C$DW$T$26
     453              
     454              
     455              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     456                      .dwattr $C$DW$T$27, DW_AT_name("TCR_BITS")
     457                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     458              $C$DW$33        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     460                      .dwattr $C$DW$33, DW_AT_name("rsvd1")
     461                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd1")
     462                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0c)
     463                      .dwattr $C$DW$33, DW_AT_bit_size(0x04)
     464                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     465                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     466              
     467              $C$DW$34        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE   10

     469                      .dwattr $C$DW$34, DW_AT_name("TSS")
     470                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_TSS")
     471                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0b)
     472                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     473                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     475              
     476              $C$DW$35        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     478                      .dwattr $C$DW$35, DW_AT_name("TRB")
     479                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_TRB")
     480                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a)
     481                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     482                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     484              
     485              $C$DW$36        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     487                      .dwattr $C$DW$36, DW_AT_name("rsvd2")
     488                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd2")
     489                      .dwattr $C$DW$36, DW_AT_bit_offset(0x06)
     490                      .dwattr $C$DW$36, DW_AT_bit_size(0x04)
     491                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     492                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     493              
     494              $C$DW$37        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     496                      .dwattr $C$DW$37, DW_AT_name("SOFT")
     497                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_SOFT")
     498                      .dwattr $C$DW$37, DW_AT_bit_offset(0x05)
     499                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     500                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     501                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     502              
     503              $C$DW$38        .dwtag  DW_TAG_member
     504                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     505                      .dwattr $C$DW$38, DW_AT_name("FREE")
     506                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_FREE")
     507                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
     508                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     509                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     510                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     511              
     512              $C$DW$39        .dwtag  DW_TAG_member
     513                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     514                      .dwattr $C$DW$39, DW_AT_name("rsvd3")
     515                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd3")
     516                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02)
     517                      .dwattr $C$DW$39, DW_AT_bit_size(0x02)
     518                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     519                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     520              
     521              $C$DW$40        .dwtag  DW_TAG_member
     522                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     523                      .dwattr $C$DW$40, DW_AT_name("TIE")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE   11

     524                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_TIE")
     525                      .dwattr $C$DW$40, DW_AT_bit_offset(0x01)
     526                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     527                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     529              
     530              $C$DW$41        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     532                      .dwattr $C$DW$41, DW_AT_name("TIF")
     533                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_TIF")
     534                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     535                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     536                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     537                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     538              
     539                      .dwendtag $C$DW$T$27
     540              
     541              
     542              $C$DW$T$28      .dwtag  DW_TAG_union_type
     543                      .dwattr $C$DW$T$28, DW_AT_name("TCR_REG")
     544                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     545              $C$DW$42        .dwtag  DW_TAG_member
     546                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     547                      .dwattr $C$DW$42, DW_AT_name("all")
     548                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     549                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     551              
     552              $C$DW$43        .dwtag  DW_TAG_member
     553                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$27)
     554                      .dwattr $C$DW$43, DW_AT_name("bit")
     555                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     556                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     558              
     559                      .dwendtag $C$DW$T$28
     560              
     561              
     562              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     563                      .dwattr $C$DW$T$29, DW_AT_name("TIM_BITS")
     564                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     565              $C$DW$44        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     567                      .dwattr $C$DW$44, DW_AT_name("LSW")
     568                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_LSW")
     569                      .dwattr $C$DW$44, DW_AT_bit_offset(0x00)
     570                      .dwattr $C$DW$44, DW_AT_bit_size(0x10)
     571                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     573              
     574              $C$DW$45        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     576                      .dwattr $C$DW$45, DW_AT_name("MSW")
     577                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_MSW")
     578                      .dwattr $C$DW$45, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE   12

     579                      .dwattr $C$DW$45, DW_AT_bit_size(0x10)
     580                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     581                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     582              
     583                      .dwendtag $C$DW$T$29
     584              
     585              
     586              $C$DW$T$30      .dwtag  DW_TAG_union_type
     587                      .dwattr $C$DW$T$30, DW_AT_name("TIM_REG")
     588                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     589              $C$DW$46        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$23)
     591                      .dwattr $C$DW$46, DW_AT_name("all")
     592                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_all")
     593                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     594                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     595              
     596              $C$DW$47        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$29)
     598                      .dwattr $C$DW$47, DW_AT_name("bit")
     599                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_bit")
     600                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     601                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     602              
     603                      .dwendtag $C$DW$T$30
     604              
     605              
     606              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     607                      .dwattr $C$DW$T$31, DW_AT_name("TPRH_BITS")
     608                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     609              $C$DW$48        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     611                      .dwattr $C$DW$48, DW_AT_name("TDDRH")
     612                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_TDDRH")
     613                      .dwattr $C$DW$48, DW_AT_bit_offset(0x08)
     614                      .dwattr $C$DW$48, DW_AT_bit_size(0x08)
     615                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     617              
     618              $C$DW$49        .dwtag  DW_TAG_member
     619                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     620                      .dwattr $C$DW$49, DW_AT_name("PSCH")
     621                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_PSCH")
     622                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     623                      .dwattr $C$DW$49, DW_AT_bit_size(0x08)
     624                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     626              
     627                      .dwendtag $C$DW$T$31
     628              
     629              
     630              $C$DW$T$32      .dwtag  DW_TAG_union_type
     631                      .dwattr $C$DW$T$32, DW_AT_name("TPRH_REG")
     632                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     633              $C$DW$50        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE   13

     634                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     635                      .dwattr $C$DW$50, DW_AT_name("all")
     636                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_all")
     637                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     638                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     639              
     640              $C$DW$51        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$31)
     642                      .dwattr $C$DW$51, DW_AT_name("bit")
     643                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bit")
     644                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     645                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     646              
     647                      .dwendtag $C$DW$T$32
     648              
     649              
     650              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     651                      .dwattr $C$DW$T$33, DW_AT_name("TPR_BITS")
     652                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     653              $C$DW$52        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$52, DW_AT_name("TDDR")
     656                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_TDDR")
     657                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
     658                      .dwattr $C$DW$52, DW_AT_bit_size(0x08)
     659                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$53        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$53, DW_AT_name("PSC")
     665                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PSC")
     666                      .dwattr $C$DW$53, DW_AT_bit_offset(0x00)
     667                      .dwattr $C$DW$53, DW_AT_bit_size(0x08)
     668                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     670              
     671                      .dwendtag $C$DW$T$33
     672              
     673              
     674              $C$DW$T$34      .dwtag  DW_TAG_union_type
     675                      .dwattr $C$DW$T$34, DW_AT_name("TPR_REG")
     676                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     677              $C$DW$54        .dwtag  DW_TAG_member
     678                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     679                      .dwattr $C$DW$54, DW_AT_name("all")
     680                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_all")
     681                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     682                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     683              
     684              $C$DW$55        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$33)
     686                      .dwattr $C$DW$55, DW_AT_name("bit")
     687                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_bit")
     688                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE   14

     689                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     690              
     691                      .dwendtag $C$DW$T$34
     692              
     693              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     694                      .dwattr $C$DW$T$2, DW_AT_name("void")
     695              
     696              $C$DW$T$4       .dwtag  DW_TAG_base_type
     697                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     698                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     699                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     700              
     701              $C$DW$T$5       .dwtag  DW_TAG_base_type
     702                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     703                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     704                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     705              
     706              $C$DW$T$6       .dwtag  DW_TAG_base_type
     707                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     708                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     709                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     710              
     711              $C$DW$T$7       .dwtag  DW_TAG_base_type
     712                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     713                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     714                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     715              
     716              $C$DW$T$8       .dwtag  DW_TAG_base_type
     717                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     718                      .dwattr $C$DW$T$8, DW_AT_name("short")
     719                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     720              
     721              $C$DW$T$9       .dwtag  DW_TAG_base_type
     722                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     723                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     724                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     725              
     726              $C$DW$T$10      .dwtag  DW_TAG_base_type
     727                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     728                      .dwattr $C$DW$T$10, DW_AT_name("int")
     729                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     730              
     731              $C$DW$T$11      .dwtag  DW_TAG_base_type
     732                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     733                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     734                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     735              
     736              $C$DW$T$19      .dwtag  DW_TAG_typedef
     737                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
     738                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
     739                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     740              
     741              $C$DW$T$12      .dwtag  DW_TAG_base_type
     742                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     743                      .dwattr $C$DW$T$12, DW_AT_name("long")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{1813476D-6B39-4B6C-B3C5-5CDC90E98CF6} PAGE   15

     744                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     745              
