TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{33E7BAAF-8016-40CD-B5B4-AE212D6F314F} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:58 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../inc/fsm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

     985              $C$DW$42        .dwtag  DW_TAG_enumerator
     986                      .dwattr $C$DW$42, DW_AT_name("EXTERNAL")
     987                      .dwattr $C$DW$42, DW_AT_const_value(0x02)
     988              
     989              $C$DW$43        .dwtag  DW_TAG_enumerator
     990                      .dwattr $C$DW$43, DW_AT_name("NORMAL")
     991                      .dwattr $C$DW$43, DW_AT_const_value(0x03)
     992              
     993              $C$DW$44        .dwtag  DW_TAG_enumerator
     994                      .dwattr $C$DW$44, DW_AT_name("DISCHARGING")
     995                      .dwattr $C$DW$44, DW_AT_const_value(0x04)
     996              
     997              $C$DW$45        .dwtag  DW_TAG_enumerator
     998                      .dwattr $C$DW$45, DW_AT_name("FAULT")
     999                      .dwattr $C$DW$45, DW_AT_const_value(0x05)
    1000              
    1001                      .dwendtag $C$DW$T$22
    1002              
    1003              $C$DW$T$23      .dwtag  DW_TAG_typedef
    1004                      .dwattr $C$DW$T$23, DW_AT_name("PowerState")
    1005                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1006                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1007              
    1008              
    1009              $C$DW$T$24      .dwtag  DW_TAG_enumeration_type
    1010                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1011              $C$DW$46        .dwtag  DW_TAG_enumerator
    1012                      .dwattr $C$DW$46, DW_AT_name("PRECHARGING")
    1013                      .dwattr $C$DW$46, DW_AT_const_value(0x00)
    1014              
    1015              $C$DW$47        .dwtag  DW_TAG_enumerator
    1016                      .dwattr $C$DW$47, DW_AT_name("CHARGING")
    1017                      .dwattr $C$DW$47, DW_AT_const_value(0x01)
    1018              
    1019              $C$DW$48        .dwtag  DW_TAG_enumerator
    1020                      .dwattr $C$DW$48, DW_AT_name("CHARGED")
    1021                      .dwattr $C$DW$48, DW_AT_const_value(0x02)
    1022              
    1023                      .dwendtag $C$DW$T$24
    1024              
    1025              $C$DW$T$25      .dwtag  DW_TAG_typedef
    1026                      .dwattr $C$DW$T$25, DW_AT_name("BatteryState")
    1027                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1028                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1029              
    1030              
    1031              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    1032                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1033              $C$DW$49        .dwtag  DW_TAG_enumerator
    1034                      .dwattr $C$DW$49, DW_AT_name("FSMERR_NONE")
    1035                      .dwattr $C$DW$49, DW_AT_const_value(0x00)
    1036              
    1037              $C$DW$50        .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{33E7BAAF-8016-40CD-B5B4-AE212D6F314F} PAGE   23

    1038                      .dwattr $C$DW$50, DW_AT_name("FSMERR_SHORT_CIRCUIT")
    1039                      .dwattr $C$DW$50, DW_AT_const_value(0x01)
    1040              
    1041              $C$DW$51        .dwtag  DW_TAG_enumerator
    1042                      .dwattr $C$DW$51, DW_AT_name("FSMERR_BATT_UV")
    1043                      .dwattr $C$DW$51, DW_AT_const_value(0x02)
    1044              
    1045              $C$DW$52        .dwtag  DW_TAG_enumerator
    1046                      .dwattr $C$DW$52, DW_AT_name("FSMERR_BATT_OV")
    1047                      .dwattr $C$DW$52, DW_AT_const_value(0x04)
    1048              
    1049              $C$DW$53        .dwtag  DW_TAG_enumerator
    1050                      .dwattr $C$DW$53, DW_AT_name("FSMERR_USB_UV")
    1051                      .dwattr $C$DW$53, DW_AT_const_value(0x08)
    1052              
    1053              $C$DW$54        .dwtag  DW_TAG_enumerator
    1054                      .dwattr $C$DW$54, DW_AT_name("FSMERR_USB_OV")
    1055                      .dwattr $C$DW$54, DW_AT_const_value(0x10)
    1056              
    1057              $C$DW$55        .dwtag  DW_TAG_enumerator
    1058                      .dwattr $C$DW$55, DW_AT_name("FSMERR_UNKNOWN_PWR_STATE")
    1059                      .dwattr $C$DW$55, DW_AT_const_value(0x20)
    1060              
    1061              $C$DW$56        .dwtag  DW_TAG_enumerator
    1062                      .dwattr $C$DW$56, DW_AT_name("FSMERR_UNKNOWN_BATT_STATE")
    1063                      .dwattr $C$DW$56, DW_AT_const_value(0x40)
    1064              
    1065              $C$DW$57        .dwtag  DW_TAG_enumerator
    1066                      .dwattr $C$DW$57, DW_AT_name("FSMERR_ERR")
    1067                      .dwattr $C$DW$57, DW_AT_const_value(0x80)
    1068              
    1069                      .dwendtag $C$DW$T$26
    1070              
    1071              $C$DW$T$27      .dwtag  DW_TAG_typedef
    1072                      .dwattr $C$DW$T$27, DW_AT_name("FSM_ERR_t")
    1073                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1074                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1075              
    1076              
    1077              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1078                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x0a)
    1079              $C$DW$58        .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$16)
    1081                      .dwattr $C$DW$58, DW_AT_name("maxVoltage")
    1082                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_maxVoltage")
    1083                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1085              
    1086              $C$DW$59        .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$16)
    1088                      .dwattr $C$DW$59, DW_AT_name("nominalVoltage")
    1089                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_nominalVoltage")
    1090                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1091                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1092              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{33E7BAAF-8016-40CD-B5B4-AE212D6F314F} PAGE   24

    1093              $C$DW$60        .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$16)
    1095                      .dwattr $C$DW$60, DW_AT_name("lowVoltage")
    1096                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_lowVoltage")
    1097                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1098                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$61        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$16)
    1102                      .dwattr $C$DW$61, DW_AT_name("minVoltage")
    1103                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_minVoltage")
    1104                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1105                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1106              
    1107              $C$DW$62        .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$16)
    1109                      .dwattr $C$DW$62, DW_AT_name("noVoltage")
    1110                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_noVoltage")
    1111                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1112                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1113              
    1114                      .dwendtag $C$DW$T$19
    1115              
    1116              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1117                      .dwattr $C$DW$T$28, DW_AT_name("USBVoltageRange")
    1118                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1120              
    1121              
    1122              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1123                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x16)
    1124              $C$DW$63        .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$16)
    1126                      .dwattr $C$DW$63, DW_AT_name("capacity")
    1127                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_capacity")
    1128                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1130              
    1131              $C$DW$64        .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$16)
    1133                      .dwattr $C$DW$64, DW_AT_name("voltage")
    1134                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_voltage")
    1135                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1136                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138              $C$DW$65        .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$16)
    1140                      .dwattr $C$DW$65, DW_AT_name("nominalVoltage")
    1141                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_nominalVoltage")
    1142                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1143                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145              $C$DW$66        .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$16)
    1147                      .dwattr $C$DW$66, DW_AT_name("prechargeVoltage")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{33E7BAAF-8016-40CD-B5B4-AE212D6F314F} PAGE   25

    1148                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_prechargeVoltage")
    1149                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1150                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1151              
    1152              $C$DW$67        .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$16)
    1154                      .dwattr $C$DW$67, DW_AT_name("overVoltage")
    1155                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_overVoltage")
    1156                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1157                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159              $C$DW$68        .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$16)
    1161                      .dwattr $C$DW$68, DW_AT_name("underVoltage")
    1162                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_underVoltage")
    1163                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1164                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1165              
    1166              $C$DW$69        .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$16)
    1168                      .dwattr $C$DW$69, DW_AT_name("noVoltage")
    1169                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_noVoltage")
    1170                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1171                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$70        .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$16)
    1175                      .dwattr $C$DW$70, DW_AT_name("prechargeCurrent")
    1176                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_prechargeCurrent")
    1177                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1178                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$71        .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$16)
    1182                      .dwattr $C$DW$71, DW_AT_name("chargeCurrent")
    1183                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_chargeCurrent")
    1184                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1185                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1186              
    1187              $C$DW$72        .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$16)
    1189                      .dwattr $C$DW$72, DW_AT_name("dischargeCurrent")
    1190                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_dischargeCurrent")
    1191                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1192                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1193              
    1194              $C$DW$73        .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$16)
    1196                      .dwattr $C$DW$73, DW_AT_name("cutoffCurrent")
    1197                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_cutoffCurrent")
    1198                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1199                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1200              
    1201                      .dwendtag $C$DW$T$20
    1202              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{33E7BAAF-8016-40CD-B5B4-AE212D6F314F} PAGE   26

    1203              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1204                      .dwattr $C$DW$T$29, DW_AT_name("Battery_t")
    1205                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$20)
    1206                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1207              
    1208              
    1209              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1210                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x12)
    1211              $C$DW$74        .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$16)
    1213                      .dwattr $C$DW$74, DW_AT_name("value")
    1214                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_value")
    1215                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1217              
    1218              $C$DW$75        .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$16)
    1220                      .dwattr $C$DW$75, DW_AT_name("ref")
    1221                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_ref")
    1222                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1223                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225              $C$DW$76        .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$16)
    1227                      .dwattr $C$DW$76, DW_AT_name("error")
    1228                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_error")
    1229                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1230                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1231              
    1232              $C$DW$77        .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$16)
    1234                      .dwattr $C$DW$77, DW_AT_name("error_old")
    1235                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_error_old")
    1236                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1237                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1238              
    1239              $C$DW$78        .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$16)
    1241                      .dwattr $C$DW$78, DW_AT_name("Kp")
    1242                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Kp")
    1243                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1244                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1245              
    1246              $C$DW$79        .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$16)
    1248                      .dwattr $C$DW$79, DW_AT_name("Ki")
    1249                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_Ki")
    1250                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1251                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1252              
    1253              $C$DW$80        .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$16)
    1255                      .dwattr $C$DW$80, DW_AT_name("output")
    1256                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_output")
    1257                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{33E7BAAF-8016-40CD-B5B4-AE212D6F314F} PAGE   27

    1258                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1259              
    1260              $C$DW$81        .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$16)
    1262                      .dwattr $C$DW$81, DW_AT_name("min")
    1263                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_min")
    1264                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1265                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1266              
    1267              $C$DW$82        .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$16)
    1269                      .dwattr $C$DW$82, DW_AT_name("max")
    1270                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_max")
    1271                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1272                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1273              
    1274                      .dwendtag $C$DW$T$21
    1275              
    1276              $C$DW$T$30      .dwtag  DW_TAG_typedef
    1277                      .dwattr $C$DW$T$30, DW_AT_name("PIDControl_t")
    1278                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$21)
    1279                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1280              
    1281              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1282                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1283              
    1284              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1285                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1286                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1287                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1288              
    1289              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1290                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1291                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1292                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1293              
    1294              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1295                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1296                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1297                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1298              
    1299              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1300                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1301                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1302                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1303              
    1304              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1305                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1306                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1307                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1308              
    1309              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1310                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1311                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1312                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{33E7BAAF-8016-40CD-B5B4-AE212D6F314F} PAGE   28

    1313              
    1314              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1315                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1316                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1317                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1318              
    1319              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1320                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1321                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1322                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1323              
    1324              $C$DW$T$46      .dwtag  DW_TAG_typedef
    1325                      .dwattr $C$DW$T$46, DW_AT_name("__uint16_t")
    1326                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$11)
    1327                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1328              
    1329              $C$DW$T$47      .dwtag  DW_TAG_typedef
    1330                      .dwattr $C$DW$T$47, DW_AT_name("uint16_t")
    1331                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
