TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:57 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{89372B91-31D5-4E9F-8E0A-818B20518B35} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:57 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../inc/globals.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1
      18 00000000 FFF6          .field          -$C$IR_1,16
      19 00000001 0000-         .field          _usbPower+0,32
         00000002 0000 
      20 00000003 0000          .xfloat $strtod("0x1.5p+2")             ; _usbPower._maxVoltage @ 0
         00000004 40A8 
      21 00000005 0000          .xfloat $strtod("0x1.4p+2")             ; _usbPower._nominalVoltage @ 32
         00000006 40A0 
      22 00000007 3333          .xfloat $strtod("0x1.366666p+2")                ; _usbPower._lowVoltage @ 64
         00000008 409B 
      23 00000009 0000          .xfloat $strtod("0x1.3p+2")             ; _usbPower._minVoltage @ 96
         0000000a 4098 
      24 0000000b 0000          .xfloat $strtod("0x1p+2")               ; _usbPower._noVoltage @ 128
         0000000c 4080 
      25        000A  $C$IR_1:        .set    10
      26              
      27 0000000d               .sect   ".cinit"
      28                      .align  1
      29 0000000d FFEA          .field          -$C$IR_2,16
      30 0000000e 000A-         .field          _battery+0,32
         0000000f 0000 
      31 00000010 C000          .xfloat $strtod("0x1.8d8p+11")          ; _battery._capacity @ 0
         00000011 4546 
      32 00000012 0000          .xfloat $strtod("0x1p+2")               ; _battery._voltage @ 32
         00000013 4080 
      33 00000014 CCCD          .xfloat $strtod("0x1.d9999ap+1")                ; _battery._nominalVoltage @ 64
         00000015 406C 
      34 00000016 0000          .xfloat $strtod("0x1.8p+1")             ; _battery._prechargeVoltage @ 96
         00000017 4040 
      35 00000018 6666          .xfloat $strtod("0x1.0cccccp+2")                ; _battery._overVoltage @ 128
         00000019 4086 
      36 0000001a 0000          .xfloat $strtod("0x1p+1")               ; _battery._underVoltage @ 160
         0000001b 4000 
      37 0000001c 0000          .xfloat $strtod("0x1p-1")               ; _battery._noVoltage @ 192
         0000001d 3F00 
      38 0000001e 999A          .xfloat $strtod("0x1.333334p-2")                ; _battery._prechargeCurrent @ 224
         0000001f 3E99 
      39 00000020 0000          .xfloat $strtod("0x1p+0")               ; _battery._chargeCurrent @ 256
         00000021 3F80 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:57 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{89372B91-31D5-4E9F-8E0A-818B20518B35} PAGE    2

      40 00000022 0000          .xfloat $strtod("0x1.8p+2")             ; _battery._dischargeCurrent @ 288
         00000023 40C0 
      41 00000024 D70A          .xfloat $strtod("0x1.47ae14p-4")                ; _battery._cutoffCurrent @ 320
         00000025 3DA3 
      42        0016  $C$IR_2:        .set    22
      43              
      44                      .global _usbPower
      45 00000000       _usbPower:      .usect  ".ebss",10,1,1
      46              $C$DW$1 .dwtag  DW_TAG_variable
      47                      .dwattr $C$DW$1, DW_AT_name("usbPower")
      48                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_usbPower")
      49                      .dwattr $C$DW$1, DW_AT_location[DW_OP_addr _usbPower]
      50                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$21)
      51                      .dwattr $C$DW$1, DW_AT_external
      52              
      53                      .global _battery
      54 0000000a       _battery:       .usect  ".ebss",22,1,1
      55              $C$DW$2 .dwtag  DW_TAG_variable
      56                      .dwattr $C$DW$2, DW_AT_name("battery")
      57                      .dwattr $C$DW$2, DW_AT_TI_symbol_name("_battery")
      58                      .dwattr $C$DW$2, DW_AT_location[DW_OP_addr _battery]
      59                      .dwattr $C$DW$2, DW_AT_type(*$C$DW$T$22)
      60                      .dwattr $C$DW$2, DW_AT_external
      61              
      62                      .sblock ".ebss"
      63              ;       D:\Programs\TI\ccs1281\ccs\tools\compiler\ti-cgt-c2000_22.6.1.LTS\bin\opt2000.exe C:\\Users\\Daniel\\
      64              ;       D:\Programs\TI\ccs1281\ccs\tools\compiler\ti-cgt-c2000_22.6.1.LTS\bin\ac2000.exe -@C:\\Users\\Daniel\
      65              
      66              ;***************************************************************
      67              ;* TYPE INFORMATION                                            *
      68              ;***************************************************************
      69              
      70              $C$DW$T$19      .dwtag  DW_TAG_structure_type
      71                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x0a)
      72              $C$DW$3 .dwtag  DW_TAG_member
      73                      .dwattr $C$DW$3, DW_AT_type(*$C$DW$T$16)
      74                      .dwattr $C$DW$3, DW_AT_name("maxVoltage")
      75                      .dwattr $C$DW$3, DW_AT_TI_symbol_name("_maxVoltage")
      76                      .dwattr $C$DW$3, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
      77                      .dwattr $C$DW$3, DW_AT_accessibility(DW_ACCESS_public)
      78              
      79              $C$DW$4 .dwtag  DW_TAG_member
      80                      .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$16)
      81                      .dwattr $C$DW$4, DW_AT_name("nominalVoltage")
      82                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_nominalVoltage")
      83                      .dwattr $C$DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
      84                      .dwattr $C$DW$4, DW_AT_accessibility(DW_ACCESS_public)
      85              
      86              $C$DW$5 .dwtag  DW_TAG_member
      87                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$16)
      88                      .dwattr $C$DW$5, DW_AT_name("lowVoltage")
      89                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_lowVoltage")
      90                      .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
      91                      .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
      92              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:57 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{89372B91-31D5-4E9F-8E0A-818B20518B35} PAGE    3

      93              $C$DW$6 .dwtag  DW_TAG_member
      94                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$16)
      95                      .dwattr $C$DW$6, DW_AT_name("minVoltage")
      96                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_minVoltage")
      97                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
      98                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
      99              
     100              $C$DW$7 .dwtag  DW_TAG_member
     101                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$16)
     102                      .dwattr $C$DW$7, DW_AT_name("noVoltage")
     103                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_noVoltage")
     104                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     105                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     106              
     107                      .dwendtag $C$DW$T$19
     108              
     109              $C$DW$T$21      .dwtag  DW_TAG_typedef
     110                      .dwattr $C$DW$T$21, DW_AT_name("USBVoltageRange")
     111                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$19)
     112                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     113              
     114              
     115              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     116                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x16)
     117              $C$DW$8 .dwtag  DW_TAG_member
     118                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$16)
     119                      .dwattr $C$DW$8, DW_AT_name("capacity")
     120                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_capacity")
     121                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     122                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     123              
     124              $C$DW$9 .dwtag  DW_TAG_member
     125                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$16)
     126                      .dwattr $C$DW$9, DW_AT_name("voltage")
     127                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_voltage")
     128                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     129                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     130              
     131              $C$DW$10        .dwtag  DW_TAG_member
     132                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$16)
     133                      .dwattr $C$DW$10, DW_AT_name("nominalVoltage")
     134                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_nominalVoltage")
     135                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     136                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     137              
     138              $C$DW$11        .dwtag  DW_TAG_member
     139                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$16)
     140                      .dwattr $C$DW$11, DW_AT_name("prechargeVoltage")
     141                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_prechargeVoltage")
     142                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     143                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     144              
     145              $C$DW$12        .dwtag  DW_TAG_member
     146                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$16)
     147                      .dwattr $C$DW$12, DW_AT_name("overVoltage")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:57 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{89372B91-31D5-4E9F-8E0A-818B20518B35} PAGE    4

     148                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_overVoltage")
     149                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     150                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     151              
     152              $C$DW$13        .dwtag  DW_TAG_member
     153                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$16)
     154                      .dwattr $C$DW$13, DW_AT_name("underVoltage")
     155                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_underVoltage")
     156                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     157                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     158              
     159              $C$DW$14        .dwtag  DW_TAG_member
     160                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$16)
     161                      .dwattr $C$DW$14, DW_AT_name("noVoltage")
     162                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_noVoltage")
     163                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     164                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     165              
     166              $C$DW$15        .dwtag  DW_TAG_member
     167                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$16)
     168                      .dwattr $C$DW$15, DW_AT_name("prechargeCurrent")
     169                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_prechargeCurrent")
     170                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     171                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     172              
     173              $C$DW$16        .dwtag  DW_TAG_member
     174                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$16)
     175                      .dwattr $C$DW$16, DW_AT_name("chargeCurrent")
     176                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_chargeCurrent")
     177                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     178                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     179              
     180              $C$DW$17        .dwtag  DW_TAG_member
     181                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$16)
     182                      .dwattr $C$DW$17, DW_AT_name("dischargeCurrent")
     183                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_dischargeCurrent")
     184                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     185                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     186              
     187              $C$DW$18        .dwtag  DW_TAG_member
     188                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$16)
     189                      .dwattr $C$DW$18, DW_AT_name("cutoffCurrent")
     190                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_cutoffCurrent")
     191                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     192                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     193              
     194                      .dwendtag $C$DW$T$20
     195              
     196              $C$DW$T$22      .dwtag  DW_TAG_typedef
     197                      .dwattr $C$DW$T$22, DW_AT_name("Battery_t")
     198                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
     199                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     200              
     201              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     202                      .dwattr $C$DW$T$2, DW_AT_name("void")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:57 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{89372B91-31D5-4E9F-8E0A-818B20518B35} PAGE    5

     203              
     204              $C$DW$T$4       .dwtag  DW_TAG_base_type
     205                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     206                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     207                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     208              
     209              $C$DW$T$5       .dwtag  DW_TAG_base_type
     210                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     211                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     212                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     213              
     214              $C$DW$T$6       .dwtag  DW_TAG_base_type
     215                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     216                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     217                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     218              
     219              $C$DW$T$7       .dwtag  DW_TAG_base_type
     220                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     221                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     222                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     223              
     224              $C$DW$T$8       .dwtag  DW_TAG_base_type
     225                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     226                      .dwattr $C$DW$T$8, DW_AT_name("short")
     227                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     228              
     229              $C$DW$T$9       .dwtag  DW_TAG_base_type
     230                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     231                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     232                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     233              
     234              $C$DW$T$10      .dwtag  DW_TAG_base_type
     235                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     236                      .dwattr $C$DW$T$10, DW_AT_name("int")
     237                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     238              
     239              $C$DW$T$11      .dwtag  DW_TAG_base_type
     240                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     241                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     242                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     243              
     244              $C$DW$T$12      .dwtag  DW_TAG_base_type
     245                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     246                      .dwattr $C$DW$T$12, DW_AT_name("long")
     247                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     248              
     249              $C$DW$T$13      .dwtag  DW_TAG_base_type
     250                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     251                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     252                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     253              
     254              $C$DW$T$14      .dwtag  DW_TAG_base_type
     255                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     256                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     257                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:57 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{89372B91-31D5-4E9F-8E0A-818B20518B35} PAGE    6

     258              
     259              $C$DW$T$15      .dwtag  DW_TAG_base_type
     260                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     261                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     262                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     263              
     264              $C$DW$T$16      .dwtag  DW_TAG_base_type
     265                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     266                      .dwattr $C$DW$T$16, DW_AT_name("float")
     267                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     268              
     269              $C$DW$T$17      .dwtag  DW_TAG_base_type
     270                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     271                      .dwattr $C$DW$T$17, DW_AT_name("double")
     272                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     273              
     274              $C$DW$T$18      .dwtag  DW_TAG_base_type
     275                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     276                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     277                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
     278              
     279                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     280                      .dwendtag $C$DW$CU
     281              

No Assembly Errors, No Assembly Warnings
