TMS320C2000 Assembler PC v22.6.1 Sat May 31 18:27:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{3359E8EE-B19E-4A22-A35D-225BB9D7ABAC} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Sat May 31 18:27:10 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../inc/pid.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

     550                      .dwcfi  cfa_offset, -2
     551                      .dwcfi  save_reg_to_mem, 26, 0
     552 00000000 761F-         MOVW      DP,#_VBoostReg+2      ; [CPU_ARAU] 
         00000001 0002 
TMS320C2000 Assembler PC v22.6.1 Sat May 31 18:27:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{3359E8EE-B19E-4A22-A35D-225BB9D7ABAC} PAGE   13

     553                      .dwpsn  file "../inc/pid.c",line 74,column 19,is_stmt,isa 0
     554 00000002 E2AF!         MOV32     R0H,@$BLOCKED(_VBoostReg)+2 ; [CPU_FPU] |74| 
         00000003 0002 
     555 00000004 761F!         MOVW      DP,#_VMain            ; [CPU_ARAU] 
         00000005 0000 
     556 00000006 8F00-         MOVL      XAR4,#_VBoostReg      ; [CPU_ARAU] |74| 
         00000007 0080 
     557 00000008 E2AF!         MOV32     R1H,@_VMain           ; [CPU_FPU] |74| 
         00000009 0100 
     558              $C$DW$33        .dwtag  DW_TAG_TI_branch
     559                      .dwattr $C$DW$33, DW_AT_low_pc(0x00)
     560                      .dwattr $C$DW$33, DW_AT_name("_PID")
     561                      .dwattr $C$DW$33, DW_AT_TI_call
     562              
     563 0000000a 7640+         LCR       #_PID                 ; [CPU_ALU] |74| 
         0000000b 0000 
     564                      ; call occurs [#_PID] ; [] |74| 
     565 0000000c 761F-         MOVW      DP,#_IBattReg+12      ; [CPU_ARAU] 
         0000000d 0000 
     566                      .dwpsn  file "../inc/pid.c",line 77,column 5,is_stmt,isa 0
     567 0000000e E2AF!         MOV32     R1H,@$BLOCKED(_IBattReg)+12 ; [CPU_FPU] |77| 
         0000000f 0130 
     568 00000010 E6AF          NEGF32    R1H,R1H               ; [CPU_FPU] |77| 
         00000011 0009 
     569 00000012 E700          MPYF32    R0H,R0H,R1H           ; [CPU_FPU] |77| 
         00000013 0040 
     570              $C$DW$34        .dwtag  DW_TAG_TI_branch
     571                      .dwattr $C$DW$34, DW_AT_low_pc(0x00)
     572                      .dwattr $C$DW$34, DW_AT_name("_ControlCurrent")
     573                      .dwattr $C$DW$34, DW_AT_TI_call
     574              
     575 00000014 7640+         LCR       #_ControlCurrent      ; [CPU_ALU] |77| 
         00000015 0000 
     576                      ; call occurs [#_ControlCurrent] ; [] |77| 
     577              $C$DW$35        .dwtag  DW_TAG_TI_branch
     578                      .dwattr $C$DW$35, DW_AT_low_pc(0x00)
     579                      .dwattr $C$DW$35, DW_AT_TI_return
     580              
     581 00000016 0006          LRETR     ; [CPU_ALU] 
     582                      ; return occurs ; [] 
     583                      .dwattr $C$DW$31, DW_AT_TI_end_file("../inc/pid.c")
     584                      .dwattr $C$DW$31, DW_AT_TI_end_line(0x4e)
     585                      .dwattr $C$DW$31, DW_AT_TI_end_column(0x01)
     586                      .dwendentry
     587                      .dwendtag $C$DW$31
     588              
     589              ;**************************************************************
     590              ;* UNDEFINED EXTERNAL REFERENCES                              *
     591              ;**************************************************************
     592                      .global _VMain
     593                      .global _VBatt
     594                      .global _IBatt
     595              
     596              ;***************************************************************
     597              ;* TYPE INFORMATION                                            *
TMS320C2000 Assembler PC v22.6.1 Sat May 31 18:27:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{3359E8EE-B19E-4A22-A35D-225BB9D7ABAC} PAGE   14

     598              ;***************************************************************
     599              
     600              $C$DW$T$20      .dwtag  DW_TAG_enumeration_type
     601                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     602              $C$DW$36        .dwtag  DW_TAG_enumerator
     603                      .dwattr $C$DW$36, DW_AT_name("EPWM_COUNTER_COMPARE_A")
     604                      .dwattr $C$DW$36, DW_AT_const_value(0x00)
     605              
     606              $C$DW$37        .dwtag  DW_TAG_enumerator
     607                      .dwattr $C$DW$37, DW_AT_name("EPWM_COUNTER_COMPARE_B")
     608                      .dwattr $C$DW$37, DW_AT_const_value(0x02)
     609              
     610              $C$DW$38        .dwtag  DW_TAG_enumerator
     611                      .dwattr $C$DW$38, DW_AT_name("EPWM_COUNTER_COMPARE_C")
     612                      .dwattr $C$DW$38, DW_AT_const_value(0x05)
     613              
     614              $C$DW$39        .dwtag  DW_TAG_enumerator
     615                      .dwattr $C$DW$39, DW_AT_name("EPWM_COUNTER_COMPARE_D")
     616                      .dwattr $C$DW$39, DW_AT_const_value(0x07)
     617              
     618                      .dwendtag $C$DW$T$20
     619              
     620              $C$DW$T$21      .dwtag  DW_TAG_typedef
     621                      .dwattr $C$DW$T$21, DW_AT_name("EPWM_CounterCompareModule")
     622                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     623                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     624              
     625              
     626              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     627                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x12)
     628              $C$DW$40        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$16)
     630                      .dwattr $C$DW$40, DW_AT_name("value")
     631                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_value")
     632                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     634              
     635              $C$DW$41        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$16)
     637                      .dwattr $C$DW$41, DW_AT_name("ref")
     638                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_ref")
     639                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     640                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     641              
     642              $C$DW$42        .dwtag  DW_TAG_member
     643                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$16)
     644                      .dwattr $C$DW$42, DW_AT_name("error")
     645                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_error")
     646                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     647                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     648              
     649              $C$DW$43        .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$16)
     651                      .dwattr $C$DW$43, DW_AT_name("error_old")
     652                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_error_old")
TMS320C2000 Assembler PC v22.6.1 Sat May 31 18:27:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{3359E8EE-B19E-4A22-A35D-225BB9D7ABAC} PAGE   15

     653                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     654                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     655              
     656              $C$DW$44        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$16)
     658                      .dwattr $C$DW$44, DW_AT_name("Kp")
     659                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_Kp")
     660                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     661                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     662              
     663              $C$DW$45        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$16)
     665                      .dwattr $C$DW$45, DW_AT_name("Ki")
     666                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Ki")
     667                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     668                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     669              
     670              $C$DW$46        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$16)
     672                      .dwattr $C$DW$46, DW_AT_name("output")
     673                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_output")
     674                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     675                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     676              
     677              $C$DW$47        .dwtag  DW_TAG_member
     678                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$16)
     679                      .dwattr $C$DW$47, DW_AT_name("min")
     680                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_min")
     681                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     682                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     683              
     684              $C$DW$48        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$16)
     686                      .dwattr $C$DW$48, DW_AT_name("max")
     687                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_max")
     688                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     689                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     690              
     691                      .dwendtag $C$DW$T$19
     692              
     693              $C$DW$T$22      .dwtag  DW_TAG_typedef
     694                      .dwattr $C$DW$T$22, DW_AT_name("PIDControl_t")
     695                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
     696                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     697              
     698              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     699                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     700                      .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
     701              
     702              $C$DW$49        .dwtag  DW_TAG_TI_far_type
     703                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$23)
     704              
     705              $C$DW$T$24      .dwtag  DW_TAG_const_type
     706                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$49)
     707              
TMS320C2000 Assembler PC v22.6.1 Sat May 31 18:27:10 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{3359E8EE-B19E-4A22-A35D-225BB9D7ABAC} PAGE   16

     708              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     709                      .dwattr $C$DW$T$2, DW_AT_name("void")
     710              
     711              $C$DW$T$4       .dwtag  DW_TAG_base_type
     712                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     713                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     714                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     715              
     716              $C$DW$T$5       .dwtag  DW_TAG_base_type
     717                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     718                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     719                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     720              
     721              $C$DW$T$6       .dwtag  DW_TAG_base_type
     722                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     723                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     724                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     725              
     726              $C$DW$T$7       .dwtag  DW_TAG_base_type
     727                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     728                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     729                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     730              
     731              $C$DW$T$8       .dwtag  DW_TAG_base_type
     732                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     733                      .dwattr $C$DW$T$8, DW_AT_name("short")
     734                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     735              
     736              $C$DW$T$9       .dwtag  DW_TAG_base_type
     737                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     738                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     739                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     740              
     741              $C$DW$T$10      .dwtag  DW_TAG_base_type
     742                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     743                      .dwattr $C$DW$T$10, DW_AT_name("int")
     744                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     745              
     746              $C$DW$T$11      .dwtag  DW_TAG_base_type
     747                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     748                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
