TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{7BC0698F-D70C-4FF6-BF2E-08A528555F02} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:55 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../MUCI/MUCI.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("MUCI_CalcCheckSum")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_MUCI_CalcCheckSum")

    3620                      .dwattr $C$DW$260, DW_AT_name("MUCI_PACKET_SEND_LENGTH_LOWBYTE")
    3621                      .dwattr $C$DW$260, DW_AT_const_value(0x11)
    3622              
    3623              $C$DW$261       .dwtag  DW_TAG_enumerator
    3624                      .dwattr $C$DW$261, DW_AT_name("MUCI_PACKET_SEND_DATA")
    3625                      .dwattr $C$DW$261, DW_AT_const_value(0x12)
    3626              
    3627              $C$DW$262       .dwtag  DW_TAG_enumerator
    3628                      .dwattr $C$DW$262, DW_AT_name("MUCI_PACKET_SEND_CRC_LOWBYTE")
    3629                      .dwattr $C$DW$262, DW_AT_const_value(0x13)
    3630              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{7BC0698F-D70C-4FF6-BF2E-08A528555F02} PAGE   71

    3631              $C$DW$263       .dwtag  DW_TAG_enumerator
    3632                      .dwattr $C$DW$263, DW_AT_name("MUCI_PACKET_SEND_CRC_HIGHBYTE")
    3633                      .dwattr $C$DW$263, DW_AT_const_value(0x14)
    3634              
    3635              $C$DW$264       .dwtag  DW_TAG_enumerator
    3636                      .dwattr $C$DW$264, DW_AT_name("MUCI_PACKET_SEND_ETX")
    3637                      .dwattr $C$DW$264, DW_AT_const_value(0x15)
    3638              
    3639              $C$DW$265       .dwtag  DW_TAG_enumerator
    3640                      .dwattr $C$DW$265, DW_AT_name("MUCI_PACKET_SEND_FINISHED")
    3641                      .dwattr $C$DW$265, DW_AT_const_value(0x16)
    3642              
    3643                      .dwendtag $C$DW$T$27
    3644              
    3645              $C$DW$T$28      .dwtag  DW_TAG_typedef
    3646                      .dwattr $C$DW$T$28, DW_AT_name("MUCI_PacketState")
    3647                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3648                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3649              
    3650              
    3651              $C$DW$T$30      .dwtag  DW_TAG_enumeration_type
    3652                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    3653              $C$DW$266       .dwtag  DW_TAG_enumerator
    3654                      .dwattr $C$DW$266, DW_AT_name("MUCI_DEVICESTATE_APP_RUN")
    3655                      .dwattr $C$DW$266, DW_AT_const_value(0x00)
    3656              
    3657              $C$DW$267       .dwtag  DW_TAG_enumerator
    3658                      .dwattr $C$DW$267, DW_AT_name("MUCI_DEVICESTATE_BOOT_RUN_CHK_OK")
    3659                      .dwattr $C$DW$267, DW_AT_const_value(0x01)
    3660              
    3661              $C$DW$268       .dwtag  DW_TAG_enumerator
    3662                      .dwattr $C$DW$268, DW_AT_name("MUCI_DEVICESTATE_BOOT_RUN_CHK_NOK")
    3663                      .dwattr $C$DW$268, DW_AT_const_value(0x02)
    3664              
    3665              $C$DW$269       .dwtag  DW_TAG_enumerator
    3666                      .dwattr $C$DW$269, DW_AT_name("MUCI_DEVICESTATE_FLASHAPI_RUN")
    3667                      .dwattr $C$DW$269, DW_AT_const_value(0x03)
    3668              
    3669                      .dwendtag $C$DW$T$30
    3670              
    3671              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3672                      .dwattr $C$DW$T$31, DW_AT_name("MUCI_ApplicationState_t")
    3673                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3674                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3675              
    3676              $C$DW$270       .dwtag  DW_TAG_TI_far_type
    3677                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$31)
    3678              
    3679              $C$DW$T$34      .dwtag  DW_TAG_const_type
    3680                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$270)
    3681              
    3682              
    3683              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    3684                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3685              $C$DW$271       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{7BC0698F-D70C-4FF6-BF2E-08A528555F02} PAGE   72

    3686                      .dwattr $C$DW$271, DW_AT_name("MUCI_ERROR_NO_ERROR")
    3687                      .dwattr $C$DW$271, DW_AT_const_value(0x00)
    3688              
    3689              $C$DW$272       .dwtag  DW_TAG_enumerator
    3690                      .dwattr $C$DW$272, DW_AT_name("MUCI_ERROR_BUFFER_OVERFLOW")
    3691                      .dwattr $C$DW$272, DW_AT_const_value(0x01)
    3692              
    3693              $C$DW$273       .dwtag  DW_TAG_enumerator
    3694                      .dwattr $C$DW$273, DW_AT_name("MUCI_ERROR_BUFFER_NO_MORE_DATA")
    3695                      .dwattr $C$DW$273, DW_AT_const_value(0x02)
    3696              
    3697                      .dwendtag $C$DW$T$37
    3698              
    3699              $C$DW$T$38      .dwtag  DW_TAG_typedef
    3700                      .dwattr $C$DW$T$38, DW_AT_name("MUCI_ErrorTypes_t")
    3701                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3702                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3703              
    3704              
    3705              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3706                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x409)
    3707              $C$DW$274       .dwtag  DW_TAG_member
    3708                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    3709                      .dwattr $C$DW$274, DW_AT_name("Address")
    3710                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_Address")
    3711                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3712                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3713              
    3714              $C$DW$275       .dwtag  DW_TAG_member
    3715                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$22)
    3716                      .dwattr $C$DW$275, DW_AT_name("Command")
    3717                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_Command")
    3718                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3719                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3720              
    3721              $C$DW$276       .dwtag  DW_TAG_member
    3722                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    3723                      .dwattr $C$DW$276, DW_AT_name("Key")
    3724                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_Key")
    3725                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3726                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3727              
    3728              $C$DW$277       .dwtag  DW_TAG_member
    3729                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$24)
    3730                      .dwattr $C$DW$277, DW_AT_name("DataLength")
    3731                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_DataLength")
    3732                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3733                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3734              
    3735              $C$DW$278       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$25)
    3737                      .dwattr $C$DW$278, DW_AT_name("Data")
    3738                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_Data")
    3739                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3740                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{7BC0698F-D70C-4FF6-BF2E-08A528555F02} PAGE   73

    3741              
    3742              $C$DW$279       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$24)
    3744                      .dwattr $C$DW$279, DW_AT_name("DataPointer")
    3745                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_DataPointer")
    3746                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
    3747                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3748              
    3749              $C$DW$280       .dwtag  DW_TAG_member
    3750                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$24)
    3751                      .dwattr $C$DW$280, DW_AT_name("CRC")
    3752                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_CRC")
    3753                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    3754                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3755              
    3756              $C$DW$281       .dwtag  DW_TAG_member
    3757                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$26)
    3758                      .dwattr $C$DW$281, DW_AT_name("DLEWas")
    3759                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_DLEWas")
    3760                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    3761                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3762              
    3763              $C$DW$282       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$28)
    3765                      .dwattr $C$DW$282, DW_AT_name("State")
    3766                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_State")
    3767                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    3768                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3769              
    3770              $C$DW$283       .dwtag  DW_TAG_member
    3771                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$28)
    3772                      .dwattr $C$DW$283, DW_AT_name("NextState")
    3773                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_NextState")
    3774                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
    3775                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3776              
    3777                      .dwendtag $C$DW$T$29
    3778              
    3779              $C$DW$T$39      .dwtag  DW_TAG_typedef
    3780                      .dwattr $C$DW$T$39, DW_AT_name("MUCI_Packet_t")
    3781                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$29)
    3782                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3783              
    3784              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3785                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3786                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3787              
    3788              $C$DW$284       .dwtag  DW_TAG_TI_far_type
    3789                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$40)
    3790              
    3791              $C$DW$T$65      .dwtag  DW_TAG_const_type
    3792                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$284)
    3793              
    3794              
    3795              $C$DW$T$32      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{7BC0698F-D70C-4FF6-BF2E-08A528555F02} PAGE   74

    3796                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    3797              $C$DW$285       .dwtag  DW_TAG_member
    3798                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    3799                      .dwattr $C$DW$285, DW_AT_name("DeviceAddress")
    3800                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_DeviceAddress")
    3801                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3802                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3803              
    3804              $C$DW$286       .dwtag  DW_TAG_member
    3805                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$31)
    3806                      .dwattr $C$DW$286, DW_AT_name("ApplicationState")
    3807                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_ApplicationState")
    3808                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3809                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3810              
    3811                      .dwendtag $C$DW$T$32
    3812              
    3813              $C$DW$T$68      .dwtag  DW_TAG_typedef
    3814                      .dwattr $C$DW$T$68, DW_AT_name("MUCI_Config_t")
    3815                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$32)
    3816                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3817              
    3818              
    3819              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3820                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    3821              $C$DW$287       .dwtag  DW_TAG_member
    3822                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$24)
    3823                      .dwattr $C$DW$287, DW_AT_name("NotEnoughSpaceInTheBuffer")
    3824                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_NotEnoughSpaceInTheBuffer")
    3825                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3826                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3827              
    3828              $C$DW$288       .dwtag  DW_TAG_member
    3829                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$24)
    3830                      .dwattr $C$DW$288, DW_AT_name("WrongCRC")
    3831                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_WrongCRC")
    3832                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3833                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3834              
    3835              $C$DW$289       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$24)
    3837                      .dwattr $C$DW$289, DW_AT_name("NoETXCharacterReceived")
    3838                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_NoETXCharacterReceived")
    3839                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3840                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3841              
    3842              $C$DW$290       .dwtag  DW_TAG_member
    3843                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$24)
    3844                      .dwattr $C$DW$290, DW_AT_name("GoodPacketReceived")
    3845                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_GoodPacketReceived")
    3846                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3847                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3848              
    3849              $C$DW$291       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{7BC0698F-D70C-4FF6-BF2E-08A528555F02} PAGE   75

    3851                      .dwattr $C$DW$291, DW_AT_name("WTF")
    3852                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_WTF")
    3853                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3854                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3855              
    3856              $C$DW$292       .dwtag  DW_TAG_member
    3857                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$24)
    3858                      .dwattr $C$DW$292, DW_AT_name("NotSupportedCommand")
    3859                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_NotSupportedCommand")
    3860                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3861                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3862              
    3863                      .dwendtag $C$DW$T$33
    3864              
    3865              $C$DW$T$69      .dwtag  DW_TAG_typedef
    3866                      .dwattr $C$DW$T$69, DW_AT_name("MUCI_Counters_t")
    3867                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$33)
    3868                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3869              
    3870              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3871                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3872              
    3873              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3874                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3875                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3876                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3877              
    3878              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3879                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3880                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3881                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3882              
    3883              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3884                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3885                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3886                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3887              
    3888              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3889                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3890                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3891                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3892              
    3893              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3894                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3895                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3896                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3897              
    3898              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3899                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3900                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3901                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3902              
    3903              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3904                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3905                      .dwattr $C$DW$T$10, DW_AT_name("int")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{7BC0698F-D70C-4FF6-BF2E-08A528555F02} PAGE   76

    3906                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3907              
    3908              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3909                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3910                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3911                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    3912              
    3913              $C$DW$T$23      .dwtag  DW_TAG_typedef
    3914                      .dwattr $C$DW$T$23, DW_AT_name("__uint16_t")
    3915                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$11)
    3916                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3917              
    3918              $C$DW$T$24      .dwtag  DW_TAG_typedef
    3919                      .dwattr $C$DW$T$24, DW_AT_name("uint16_t")
    3920                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
