TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{99D9EF17-E887-444A-9D4A-24D30781BD40} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:55 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../MUCI/MUCI_Recorder.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

     728 00000000       _MUCI_Recorder_Background:
     729                      .dwcfi  cfa_offset, -2
     730                      .dwcfi  save_reg_to_mem, 26, 0
     731 00000000 761F-         MOVW      DP,#_MUCI_RecorderParameter+16 ; [CPU_ARAU] 
         00000001 0000 
     732                      .dwpsn  file "../MUCI/MUCI_Recorder.c",line 213,column 3,is_stmt,isa 0
     733 00000002 9214!         MOV       AL,@$BLOCKED(_MUCI_RecorderParameter)+16 ; [CPU_ALU] |213| 
     734 00000003 5201          CMPB      AL,#1                 ; [CPU_ALU] |213| 
     735 00000004 6111          B         $C$L29,EQ             ; [CPU_ALU] |213| 
     736                      ; branchcc occurs ; [] |213| 
     737 00000005 5205          CMPB      AL,#5                 ; [CPU_ALU] |213| 
     738 00000006 610C          B         $C$L28,EQ             ; [CPU_ALU] |213| 
     739                      ; branchcc occurs ; [] |213| 
     740 00000007 5206          CMPB      AL,#6                 ; [CPU_ALU] |213| 
     741 00000008 6107          B         $C$L27,EQ             ; [CPU_ALU] |213| 
     742                      ; branchcc occurs ; [] |213| 
     743 00000009 5207          CMPB      AL,#7                 ; [CPU_ALU] |213| 
     744 0000000a 600D          B         $C$L30,NEQ            ; [CPU_ALU] |213| 
     745                      ; branchcc occurs ; [] |213| 
     746                      .dwcfi  remember_state
     747                      .dwpsn  file "../MUCI/MUCI_Recorder.c",line 224,column 9,is_stmt,isa 0
     748 0000000b 2B1B!         MOV       @$BLOCKED(_MUCI_RecorderParameter)+23,#0 ; [CPU_ALU] |224| 
     749                      .dwpsn  file "../MUCI/MUCI_Recorder.c",line 225,column 9,is_stmt,isa 0
     750 0000000c 56BF!         MOVB      @$BLOCKED(_MUCI_RecorderParameter)+16,#2,UNC ; [CPU_ALU] |225| 
         0000000d 0214 
     751              $C$DW$23        .dwtag  DW_TAG_TI_branch
     752                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     753                      .dwattr $C$DW$23, DW_AT_TI_return
     754              
     755 0000000e 0006          LRETR     ; [CPU_ALU] 
     756                      ; return occurs ; [] 
     757                      .dwcfi  restore_state
     758 0000000f       $C$L27:    
     759                      .dwcfi  remember_state
     760                      .dwpsn  file "../MUCI/MUCI_Recorder.c",line 221,column 9,is_stmt,isa 0
     761 0000000f 56BF!         MOVB      @$BLOCKED(_MUCI_RecorderParameter)+16,#7,UNC ; [CPU_ALU] |221| 
         00000010 0714 
     762              $C$DW$24        .dwtag  DW_TAG_TI_branch
     763                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     764                      .dwattr $C$DW$24, DW_AT_TI_return
     765              
     766 00000011 0006          LRETR     ; [CPU_ALU] 
     767                      ; return occurs ; [] 
     768                      .dwcfi  restore_state
     769 00000012       $C$L28:    
     770                      .dwcfi  remember_state
     771                      .dwpsn  file "../MUCI/MUCI_Recorder.c",line 228,column 9,is_stmt,isa 0
     772 00000012 56BF!         MOVB      @$BLOCKED(_MUCI_RecorderParameter)+16,#3,UNC ; [CPU_ALU] |228| 
         00000013 0314 
     773              $C$DW$25        .dwtag  DW_TAG_TI_branch
     774                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     775                      .dwattr $C$DW$25, DW_AT_TI_return
     776              
     777 00000014 0006          LRETR     ; [CPU_ALU] 
     778                      ; return occurs ; [] 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{99D9EF17-E887-444A-9D4A-24D30781BD40} PAGE   16

     779                      .dwcfi  restore_state
     780 00000015       $C$L29:    
     781                      .dwpsn  file "../MUCI/MUCI_Recorder.c",line 217,column 9,is_stmt,isa 0
     782 00000015 56BF!         MOVB      @$BLOCKED(_MUCI_RecorderParameter)+16,#6,UNC ; [CPU_ALU] |217| 
         00000016 0614 
     783              $C$L30:    
     784              $C$DW$26        .dwtag  DW_TAG_TI_branch
     785                      .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     786                      .dwattr $C$DW$26, DW_AT_TI_return
     787              
     788 00000017 0006          LRETR     ; [CPU_ALU] 
     789                      ; return occurs ; [] 
     790                      .dwattr $C$DW$22, DW_AT_TI_end_file("../MUCI/MUCI_Recorder.c")
     791                      .dwattr $C$DW$22, DW_AT_TI_end_line(0xe7)
     792                      .dwattr $C$DW$22, DW_AT_TI_end_column(0x01)
     793                      .dwendentry
     794                      .dwendtag $C$DW$22
     795              
     796              ;**************************************************************
     797              ;* UNDEFINED EXTERNAL REFERENCES                              *
     798              ;**************************************************************
     799                      .global _c_date
     800                      .global _c_time
     801              
     802              ;***************************************************************
     803              ;* TYPE INFORMATION                                            *
     804              ;***************************************************************
     805              
     806              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     807                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
     808              $C$DW$27        .dwtag  DW_TAG_member
     809                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
     810                      .dwattr $C$DW$27, DW_AT_name("val_addr")
     811                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_val_addr")
     812                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     813                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     814              
     815              $C$DW$28        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     817                      .dwattr $C$DW$28, DW_AT_name("sampled_date")
     818                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_sampled_date")
     819                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     820                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     821              
     822              $C$DW$29        .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$20)
     824                      .dwattr $C$DW$29, DW_AT_name("sampled_time")
     825                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_sampled_time")
     826                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     827                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     828              
     829              $C$DW$30        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
     831                      .dwattr $C$DW$30, DW_AT_name("sample_time")
     832                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_sample_time")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{99D9EF17-E887-444A-9D4A-24D30781BD40} PAGE   17

     833                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     834                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     835              
     836              $C$DW$31        .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
     838                      .dwattr $C$DW$31, DW_AT_name("trig_level")
     839                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_trig_level")
     840                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     841                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     842              
     843              $C$DW$32        .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$25)
     845                      .dwattr $C$DW$32, DW_AT_name("state")
     846                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_state")
     847                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     848                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     849              
     850              $C$DW$33        .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$25)
     852                      .dwattr $C$DW$33, DW_AT_name("start_idx")
     853                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_start_idx")
     854                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     855                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     856              
     857              $C$DW$34        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$25)
     859                      .dwattr $C$DW$34, DW_AT_name("trigger_ch")
     860                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_trigger_ch")
     861                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     862                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     863              
     864              $C$DW$35        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$25)
     866                      .dwattr $C$DW$35, DW_AT_name("pretrigger")
     867                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_pretrigger")
     868                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     869                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     870              
     871              $C$DW$36        .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$25)
     873                      .dwattr $C$DW$36, DW_AT_name("trig_slope")
     874                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_trig_slope")
     875                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     876                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     877              
     878              $C$DW$37        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$25)
     880                      .dwattr $C$DW$37, DW_AT_name("tnow")
     881                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_tnow")
     882                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     883                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     884              
     885              $C$DW$38        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$25)
     887                      .dwattr $C$DW$38, DW_AT_name("tlevel_type")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{99D9EF17-E887-444A-9D4A-24D30781BD40} PAGE   18

     888                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_tlevel_type")
     889                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     890                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     891              
     892              $C$DW$39        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$25)
     894                      .dwattr $C$DW$39, DW_AT_name("idx")
     895                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_idx")
     896                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     897                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     898              
     899              $C$DW$40        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$20)
     901                      .dwattr $C$DW$40, DW_AT_name("div")
     902                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_div")
     903                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     904                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     905              
     906              $C$DW$41        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$23)
     908                      .dwattr $C$DW$41, DW_AT_name("trig_ch_val_old")
     909                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_trig_ch_val_old")
     910                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     911                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     912              
     913              $C$DW$42        .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$23)
     915                      .dwattr $C$DW$42, DW_AT_name("trig_ch_val")
     916                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_trig_ch_val")
     917                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     918                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     919              
     920              $C$DW$43        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$25)
     922                      .dwattr $C$DW$43, DW_AT_name("trig_delay")
     923                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_trig_delay")
     924                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     925                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     926              
     927              $C$DW$44        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$25)
     929                      .dwattr $C$DW$44, DW_AT_name("end_idx")
     930                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_end_idx")
     931                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     932                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     933              
     934                      .dwendtag $C$DW$T$26
     935              
     936              $C$DW$T$27      .dwtag  DW_TAG_typedef
     937                      .dwattr $C$DW$T$27, DW_AT_name("MUCI_RecorderParameter_t")
     938                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     939                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     940              
     941              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     942                      .dwattr $C$DW$T$2, DW_AT_name("void")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{99D9EF17-E887-444A-9D4A-24D30781BD40} PAGE   19

     943              
     944              $C$DW$T$4       .dwtag  DW_TAG_base_type
     945                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     946                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     947                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     948              
     949              $C$DW$T$5       .dwtag  DW_TAG_base_type
     950                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     951                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     952                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     953              
     954              $C$DW$T$6       .dwtag  DW_TAG_base_type
     955                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     956                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     957                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     958              
     959              $C$DW$T$7       .dwtag  DW_TAG_base_type
     960                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     961                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     962                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     963              
     964              $C$DW$T$8       .dwtag  DW_TAG_base_type
     965                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     966                      .dwattr $C$DW$T$8, DW_AT_name("short")
     967                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     968              
     969              $C$DW$T$9       .dwtag  DW_TAG_base_type
     970                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     971                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     972                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     973              
     974              $C$DW$T$10      .dwtag  DW_TAG_base_type
     975                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     976                      .dwattr $C$DW$T$10, DW_AT_name("int")
     977                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     978              
     979              $C$DW$T$35      .dwtag  DW_TAG_typedef
     980                      .dwattr $C$DW$T$35, DW_AT_name("__int16_t")
     981                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$10)
     982                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     983              
     984              $C$DW$T$36      .dwtag  DW_TAG_typedef
     985                      .dwattr $C$DW$T$36, DW_AT_name("int16_t")
     986                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
     987                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     988              
     989              $C$DW$T$11      .dwtag  DW_TAG_base_type
     990                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     991                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
