TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FAB6F8A9-7121-4A2D-984F-1266BAA80FB6} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:55 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../MUCI/MUCI_MonitorCommands.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("MUCI_bsp_Reboot")

    4756              $C$DW$287       .dwtag  DW_TAG_enumerator
    4757                      .dwattr $C$DW$287, DW_AT_name("MUCI_ERROR_NO_ERROR")
    4758                      .dwattr $C$DW$287, DW_AT_const_value(0x00)
    4759              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FAB6F8A9-7121-4A2D-984F-1266BAA80FB6} PAGE   92

    4760              $C$DW$288       .dwtag  DW_TAG_enumerator
    4761                      .dwattr $C$DW$288, DW_AT_name("MUCI_ERROR_BUFFER_OVERFLOW")
    4762                      .dwattr $C$DW$288, DW_AT_const_value(0x01)
    4763              
    4764              $C$DW$289       .dwtag  DW_TAG_enumerator
    4765                      .dwattr $C$DW$289, DW_AT_name("MUCI_ERROR_BUFFER_NO_MORE_DATA")
    4766                      .dwattr $C$DW$289, DW_AT_const_value(0x02)
    4767              
    4768                      .dwendtag $C$DW$T$39
    4769              
    4770              $C$DW$T$40      .dwtag  DW_TAG_typedef
    4771                      .dwattr $C$DW$T$40, DW_AT_name("MUCI_ErrorTypes_t")
    4772                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4773                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4774              
    4775              
    4776              $C$DW$T$73      .dwtag  DW_TAG_enumeration_type
    4777                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
    4778              $C$DW$290       .dwtag  DW_TAG_enumerator
    4779                      .dwattr $C$DW$290, DW_AT_name("MUCI_TYPE_BOOL")
    4780                      .dwattr $C$DW$290, DW_AT_const_value(0x00)
    4781              
    4782              $C$DW$291       .dwtag  DW_TAG_enumerator
    4783                      .dwattr $C$DW$291, DW_AT_name("MUCI_TYPE_CHAR")
    4784                      .dwattr $C$DW$291, DW_AT_const_value(0x01)
    4785              
    4786              $C$DW$292       .dwtag  DW_TAG_enumerator
    4787                      .dwattr $C$DW$292, DW_AT_name("MUCI_TYPE_UINT8")
    4788                      .dwattr $C$DW$292, DW_AT_const_value(0x02)
    4789              
    4790              $C$DW$293       .dwtag  DW_TAG_enumerator
    4791                      .dwattr $C$DW$293, DW_AT_name("MUCI_TYPE_INT8")
    4792                      .dwattr $C$DW$293, DW_AT_const_value(0x03)
    4793              
    4794              $C$DW$294       .dwtag  DW_TAG_enumerator
    4795                      .dwattr $C$DW$294, DW_AT_name("MUCI_TYPE_UINT16")
    4796                      .dwattr $C$DW$294, DW_AT_const_value(0x04)
    4797              
    4798              $C$DW$295       .dwtag  DW_TAG_enumerator
    4799                      .dwattr $C$DW$295, DW_AT_name("MUCI_TYPE_INT16")
    4800                      .dwattr $C$DW$295, DW_AT_const_value(0x05)
    4801              
    4802              $C$DW$296       .dwtag  DW_TAG_enumerator
    4803                      .dwattr $C$DW$296, DW_AT_name("MUCI_TYPE_UINT32")
    4804                      .dwattr $C$DW$296, DW_AT_const_value(0x06)
    4805              
    4806              $C$DW$297       .dwtag  DW_TAG_enumerator
    4807                      .dwattr $C$DW$297, DW_AT_name("MUCI_TYPE_INT32")
    4808                      .dwattr $C$DW$297, DW_AT_const_value(0x07)
    4809              
    4810              $C$DW$298       .dwtag  DW_TAG_enumerator
    4811                      .dwattr $C$DW$298, DW_AT_name("MUCI_TYPE_FLOAT")
    4812                      .dwattr $C$DW$298, DW_AT_const_value(0x08)
    4813              
    4814              $C$DW$299       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FAB6F8A9-7121-4A2D-984F-1266BAA80FB6} PAGE   93

    4815                      .dwattr $C$DW$299, DW_AT_name("MUCI_TYPE_UINT64")
    4816                      .dwattr $C$DW$299, DW_AT_const_value(0x09)
    4817              
    4818              $C$DW$300       .dwtag  DW_TAG_enumerator
    4819                      .dwattr $C$DW$300, DW_AT_name("MUCI_TYPE_INT64")
    4820                      .dwattr $C$DW$300, DW_AT_const_value(0x0a)
    4821              
    4822              $C$DW$301       .dwtag  DW_TAG_enumerator
    4823                      .dwattr $C$DW$301, DW_AT_name("MUCI_TYPE_DOUBLE")
    4824                      .dwattr $C$DW$301, DW_AT_const_value(0x0b)
    4825              
    4826              $C$DW$302       .dwtag  DW_TAG_enumerator
    4827                      .dwattr $C$DW$302, DW_AT_name("MUCI_TYPE_STRING")
    4828                      .dwattr $C$DW$302, DW_AT_const_value(0x0c)
    4829              
    4830              $C$DW$303       .dwtag  DW_TAG_enumerator
    4831                      .dwattr $C$DW$303, DW_AT_name("MUCI_TYPE_COUNT")
    4832                      .dwattr $C$DW$303, DW_AT_const_value(0x0d)
    4833              
    4834                      .dwendtag $C$DW$T$73
    4835              
    4836              $C$DW$T$74      .dwtag  DW_TAG_typedef
    4837                      .dwattr $C$DW$T$74, DW_AT_name("MUCI_Types_t")
    4838                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    4839                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4840              
    4841              
    4842              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4843                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x409)
    4844              $C$DW$304       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    4846                      .dwattr $C$DW$304, DW_AT_name("Address")
    4847                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_Address")
    4848                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4849                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4850              
    4851              $C$DW$305       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$22)
    4853                      .dwattr $C$DW$305, DW_AT_name("Command")
    4854                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_Command")
    4855                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4856                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4857              
    4858              $C$DW$306       .dwtag  DW_TAG_member
    4859                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    4860                      .dwattr $C$DW$306, DW_AT_name("Key")
    4861                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_Key")
    4862                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4863                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4864              
    4865              $C$DW$307       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$24)
    4867                      .dwattr $C$DW$307, DW_AT_name("DataLength")
    4868                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_DataLength")
    4869                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FAB6F8A9-7121-4A2D-984F-1266BAA80FB6} PAGE   94

    4870                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4871              
    4872              $C$DW$308       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$25)
    4874                      .dwattr $C$DW$308, DW_AT_name("Data")
    4875                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_Data")
    4876                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4877                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4878              
    4879              $C$DW$309       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$24)
    4881                      .dwattr $C$DW$309, DW_AT_name("DataPointer")
    4882                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_DataPointer")
    4883                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
    4884                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4885              
    4886              $C$DW$310       .dwtag  DW_TAG_member
    4887                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$24)
    4888                      .dwattr $C$DW$310, DW_AT_name("CRC")
    4889                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_CRC")
    4890                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    4891                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4892              
    4893              $C$DW$311       .dwtag  DW_TAG_member
    4894                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$26)
    4895                      .dwattr $C$DW$311, DW_AT_name("DLEWas")
    4896                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_DLEWas")
    4897                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    4898                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4899              
    4900              $C$DW$312       .dwtag  DW_TAG_member
    4901                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$28)
    4902                      .dwattr $C$DW$312, DW_AT_name("State")
    4903                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_State")
    4904                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    4905                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4906              
    4907              $C$DW$313       .dwtag  DW_TAG_member
    4908                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$28)
    4909                      .dwattr $C$DW$313, DW_AT_name("NextState")
    4910                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_NextState")
    4911                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
    4912                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4913              
    4914                      .dwendtag $C$DW$T$29
    4915              
    4916              $C$DW$T$41      .dwtag  DW_TAG_typedef
    4917                      .dwattr $C$DW$T$41, DW_AT_name("MUCI_Packet_t")
    4918                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$29)
    4919                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4920              
    4921              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    4922                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4923                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    4924              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FAB6F8A9-7121-4A2D-984F-1266BAA80FB6} PAGE   95

    4925              $C$DW$314       .dwtag  DW_TAG_TI_far_type
    4926                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$42)
    4927              
    4928              $C$DW$T$75      .dwtag  DW_TAG_const_type
    4929                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$314)
    4930              
    4931              
    4932              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4933                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x14)
    4934              $C$DW$315       .dwtag  DW_TAG_member
    4935                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$30)
    4936                      .dwattr $C$DW$315, DW_AT_name("name")
    4937                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_name")
    4938                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4939                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4940              
    4941              $C$DW$316       .dwtag  DW_TAG_member
    4942                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$24)
    4943                      .dwattr $C$DW$316, DW_AT_name("unit")
    4944                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_unit")
    4945                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4946                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4947              
    4948              $C$DW$317       .dwtag  DW_TAG_member
    4949                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$24)
    4950                      .dwattr $C$DW$317, DW_AT_name("type")
    4951                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_type")
    4952                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4953                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4954              
    4955              $C$DW$318       .dwtag  DW_TAG_member
    4956                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$32)
    4957                      .dwattr $C$DW$318, DW_AT_name("ptr")
    4958                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_ptr")
    4959                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4960                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4961              
    4962              $C$DW$319       .dwtag  DW_TAG_member
    4963                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$32)
    4964                      .dwattr $C$DW$319, DW_AT_name("pmax")
    4965                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_pmax")
    4966                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4967                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4968              
    4969              $C$DW$320       .dwtag  DW_TAG_member
    4970                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$32)
    4971                      .dwattr $C$DW$320, DW_AT_name("pmin")
    4972                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_pmin")
    4973                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4974                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4975              
    4976                      .dwendtag $C$DW$T$33
    4977              
    4978              $C$DW$T$84      .dwtag  DW_TAG_typedef
    4979                      .dwattr $C$DW$T$84, DW_AT_name("var_type")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FAB6F8A9-7121-4A2D-984F-1266BAA80FB6} PAGE   96

    4980                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$33)
    4981                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4982              
    4983              $C$DW$321       .dwtag  DW_TAG_TI_far_type
    4984                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$84)
    4985              
    4986              $C$DW$T$85      .dwtag  DW_TAG_const_type
    4987                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$321)
    4988              
    4989              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4990                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    4991                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    4992              
    4993              
    4994              $C$DW$T$87      .dwtag  DW_TAG_array_type
    4995                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4996                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4997                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x04)
    4998              $C$DW$322       .dwtag  DW_TAG_subrange_type
    4999                      .dwattr $C$DW$322, DW_AT_upper_bound(0x01)
    5000              
    5001                      .dwendtag $C$DW$T$87
    5002              
    5003              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    5004                      .dwattr $C$DW$T$2, DW_AT_name("void")
    5005              
    5006              
    5007              $C$DW$T$90      .dwtag  DW_TAG_subroutine_type
    5008                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    5009                      .dwendtag $C$DW$T$90
    5010              
    5011              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    5012                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    5013                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    5014              
    5015              $C$DW$T$4       .dwtag  DW_TAG_base_type
    5016                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    5017                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    5018                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    5019              
    5020              $C$DW$T$5       .dwtag  DW_TAG_base_type
    5021                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    5022                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    5023                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    5024              
    5025              $C$DW$T$6       .dwtag  DW_TAG_base_type
    5026                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5027                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    5028                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    5029              
    5030              $C$DW$T$7       .dwtag  DW_TAG_base_type
    5031                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    5032                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    5033                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    5034              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:55 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
