TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:58 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    1880              $C$DW$149       .dwtag  DW_TAG_enumerator
    1881                      .dwattr $C$DW$149, DW_AT_name("SYSCTL_PERIPH_CLK_CLB4")
    1882                      .dwattr $C$DW$149, DW_AT_const_value(0x311)
    1883              
    1884              $C$DW$150       .dwtag  DW_TAG_enumerator
    1885                      .dwattr $C$DW$150, DW_AT_name("SYSCTL_PERIPH_CLK_FSITXA")
    1886                      .dwattr $C$DW$150, DW_AT_const_value(0x12)
    1887              
    1888              $C$DW$151       .dwtag  DW_TAG_enumerator
    1889                      .dwattr $C$DW$151, DW_AT_name("SYSCTL_PERIPH_CLK_FSIRXA")
    1890                      .dwattr $C$DW$151, DW_AT_const_value(0x112)
    1891              
    1892              $C$DW$152       .dwtag  DW_TAG_enumerator
    1893                      .dwattr $C$DW$152, DW_AT_name("SYSCTL_PERIPH_CLK_LINA")
    1894                      .dwattr $C$DW$152, DW_AT_const_value(0x13)
    1895              
    1896              $C$DW$153       .dwtag  DW_TAG_enumerator
    1897                      .dwattr $C$DW$153, DW_AT_name("SYSCTL_PERIPH_CLK_LINB")
    1898                      .dwattr $C$DW$153, DW_AT_const_value(0x113)
    1899              
    1900              $C$DW$154       .dwtag  DW_TAG_enumerator
    1901                      .dwattr $C$DW$154, DW_AT_name("SYSCTL_PERIPH_CLK_PMBUSA")
    1902                      .dwattr $C$DW$154, DW_AT_const_value(0x14)
    1903              
    1904              $C$DW$155       .dwtag  DW_TAG_enumerator
    1905                      .dwattr $C$DW$155, DW_AT_name("SYSCTL_PERIPH_CLK_DCC0")
    1906                      .dwattr $C$DW$155, DW_AT_const_value(0x15)
    1907              
    1908              $C$DW$156       .dwtag  DW_TAG_enumerator
    1909                      .dwattr $C$DW$156, DW_AT_name("SYSCTL_PERIPH_CLK_DCC1")
    1910                      .dwattr $C$DW$156, DW_AT_const_value(0x115)
    1911              
    1912              $C$DW$157       .dwtag  DW_TAG_enumerator
    1913                      .dwattr $C$DW$157, DW_AT_name("SYSCTL_PERIPH_CLK_HICA")
    1914                      .dwattr $C$DW$157, DW_AT_const_value(0x19)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   39

    1915              
    1916              $C$DW$158       .dwtag  DW_TAG_enumerator
    1917                      .dwattr $C$DW$158, DW_AT_name("SYSCTL_PERIPH_CLK_AESA")
    1918                      .dwattr $C$DW$158, DW_AT_const_value(0x1a)
    1919              
    1920              $C$DW$159       .dwtag  DW_TAG_enumerator
    1921                      .dwattr $C$DW$159, DW_AT_name("SYSCTL_PERIPH_CLK_EPG1")
    1922                      .dwattr $C$DW$159, DW_AT_const_value(0x1b)
    1923              
    1924                      .dwendtag $C$DW$T$87
    1925              
    1926              $C$DW$T$88      .dwtag  DW_TAG_typedef
    1927                      .dwattr $C$DW$T$88, DW_AT_name("SysCtl_PeripheralPCLOCKCR")
    1928                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1929                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1930              
    1931              
    1932              $C$DW$T$89      .dwtag  DW_TAG_enumeration_type
    1933                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x01)
    1934              $C$DW$160       .dwtag  DW_TAG_enumerator
    1935                      .dwattr $C$DW$160, DW_AT_name("BOOT")
    1936                      .dwattr $C$DW$160, DW_AT_const_value(0x00)
    1937              
    1938              $C$DW$161       .dwtag  DW_TAG_enumerator
    1939                      .dwattr $C$DW$161, DW_AT_name("STANDBY")
    1940                      .dwattr $C$DW$161, DW_AT_const_value(0x01)
    1941              
    1942              $C$DW$162       .dwtag  DW_TAG_enumerator
    1943                      .dwattr $C$DW$162, DW_AT_name("EXTERNAL")
    1944                      .dwattr $C$DW$162, DW_AT_const_value(0x02)
    1945              
    1946              $C$DW$163       .dwtag  DW_TAG_enumerator
    1947                      .dwattr $C$DW$163, DW_AT_name("NORMAL")
    1948                      .dwattr $C$DW$163, DW_AT_const_value(0x03)
    1949              
    1950              $C$DW$164       .dwtag  DW_TAG_enumerator
    1951                      .dwattr $C$DW$164, DW_AT_name("DISCHARGING")
    1952                      .dwattr $C$DW$164, DW_AT_const_value(0x04)
    1953              
    1954              $C$DW$165       .dwtag  DW_TAG_enumerator
    1955                      .dwattr $C$DW$165, DW_AT_name("FAULT")
    1956                      .dwattr $C$DW$165, DW_AT_const_value(0x05)
    1957              
    1958                      .dwendtag $C$DW$T$89
    1959              
    1960              $C$DW$T$90      .dwtag  DW_TAG_typedef
    1961                      .dwattr $C$DW$T$90, DW_AT_name("PowerState")
    1962                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1963                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1964              
    1965              
    1966              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1967                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1968              $C$DW$166       .dwtag  DW_TAG_member
    1969                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   40

    1970                      .dwattr $C$DW$166, DW_AT_name("Main")
    1971                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_Main")
    1972                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1974              
    1975              $C$DW$167       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1977                      .dwattr $C$DW$167, DW_AT_name("Batt")
    1978                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_Batt")
    1979                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1980                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1981              
    1982              $C$DW$168       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    1984                      .dwattr $C$DW$168, DW_AT_name("Current")
    1985                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_Current")
    1986                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1987                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1988              
    1989              $C$DW$169       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1991                      .dwattr $C$DW$169, DW_AT_name("Ref")
    1992                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Ref")
    1993                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1994                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1995              
    1996                      .dwendtag $C$DW$T$21
    1997              
    1998              $C$DW$T$91      .dwtag  DW_TAG_typedef
    1999                      .dwattr $C$DW$T$91, DW_AT_name("adcStruct_t")
    2000                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$21)
    2001                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2002              
    2003              
    2004              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2005                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x03)
    2006              $C$DW$170       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2008                      .dwattr $C$DW$170, DW_AT_name("state")
    2009                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_state")
    2010                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2011                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2012              
    2013              $C$DW$171       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2015                      .dwattr $C$DW$171, DW_AT_name("enable")
    2016                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_enable")
    2017                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2018                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2019              
    2020              $C$DW$172       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    2022                      .dwattr $C$DW$172, DW_AT_name("disable")
    2023                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_disable")
    2024                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   41

    2025                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2026              
    2027                      .dwendtag $C$DW$T$23
    2028              
    2029              $C$DW$T$92      .dwtag  DW_TAG_typedef
    2030                      .dwattr $C$DW$T$92, DW_AT_name("State_t")
    2031                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$23)
    2032                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2033              
    2034              
    2035              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2036                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x05)
    2037              $C$DW$173       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2039                      .dwattr $C$DW$173, DW_AT_name("buck")
    2040                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_buck")
    2041                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2043              
    2044              $C$DW$174       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    2046                      .dwattr $C$DW$174, DW_AT_name("boost")
    2047                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_boost")
    2048                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2049                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2050              
    2051              $C$DW$175       .dwtag  DW_TAG_member
    2052                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    2053                      .dwattr $C$DW$175, DW_AT_name("current")
    2054                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_current")
    2055                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2056                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2057              
    2058              $C$DW$176       .dwtag  DW_TAG_member
    2059                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    2060                      .dwattr $C$DW$176, DW_AT_name("pwm")
    2061                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_pwm")
    2062                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2063                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2064              
    2065              $C$DW$177       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    2067                      .dwattr $C$DW$177, DW_AT_name("buckPwm")
    2068                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_buckPwm")
    2069                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2070                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2071              
    2072                      .dwendtag $C$DW$T$24
    2073              
    2074              $C$DW$T$93      .dwtag  DW_TAG_typedef
    2075                      .dwattr $C$DW$T$93, DW_AT_name("enable_t")
    2076                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$24)
    2077                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2078              
    2079              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   42

    2080              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2081                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x14)
    2082              $C$DW$178       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    2084                      .dwattr $C$DW$178, DW_AT_name("t")
    2085                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_t")
    2086                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2088              
    2089                      .dwendtag $C$DW$T$28
    2090              
    2091              $C$DW$T$96      .dwtag  DW_TAG_typedef
    2092                      .dwattr $C$DW$T$96, DW_AT_name("timer_t")
    2093                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$28)
    2094                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2095              
    2096              $C$DW$179       .dwtag  DW_TAG_TI_far_type
    2097                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$96)
    2098              
    2099              $C$DW$T$97      .dwtag  DW_TAG_volatile_type
    2100                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$179)
    2101              
    2102              
    2103              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2104                      .dwattr $C$DW$T$30, DW_AT_name("PIEACK_BITS")
    2105                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2106              $C$DW$180       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$29)
    2108                      .dwattr $C$DW$180, DW_AT_name("ACK1")
    2109                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ACK1")
    2110                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0f)
    2111                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2112                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2114              
    2115              $C$DW$181       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$29)
    2117                      .dwattr $C$DW$181, DW_AT_name("ACK2")
    2118                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ACK2")
    2119                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0e)
    2120                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2121                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2123              
    2124              $C$DW$182       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$29)
    2126                      .dwattr $C$DW$182, DW_AT_name("ACK3")
    2127                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ACK3")
    2128                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0d)
    2129                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2130                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2131                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2132              
    2133              $C$DW$183       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   43

    2135                      .dwattr $C$DW$183, DW_AT_name("ACK4")
    2136                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ACK4")
    2137                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0c)
    2138                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2139                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2141              
    2142              $C$DW$184       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$29)
    2144                      .dwattr $C$DW$184, DW_AT_name("ACK5")
    2145                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ACK5")
    2146                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0b)
    2147                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2148                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2149                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2150              
    2151              $C$DW$185       .dwtag  DW_TAG_member
    2152                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$29)
    2153                      .dwattr $C$DW$185, DW_AT_name("ACK6")
    2154                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ACK6")
    2155                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0a)
    2156                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2157                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2158                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2159              
    2160              $C$DW$186       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$29)
    2162                      .dwattr $C$DW$186, DW_AT_name("ACK7")
    2163                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ACK7")
    2164                      .dwattr $C$DW$186, DW_AT_bit_offset(0x09)
    2165                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2166                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2167                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2168              
    2169              $C$DW$187       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$29)
    2171                      .dwattr $C$DW$187, DW_AT_name("ACK8")
    2172                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ACK8")
    2173                      .dwattr $C$DW$187, DW_AT_bit_offset(0x08)
    2174                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2175                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2177              
    2178              $C$DW$188       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$29)
    2180                      .dwattr $C$DW$188, DW_AT_name("ACK9")
    2181                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ACK9")
    2182                      .dwattr $C$DW$188, DW_AT_bit_offset(0x07)
    2183                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2184                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2185                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2186              
    2187              $C$DW$189       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$29)
    2189                      .dwattr $C$DW$189, DW_AT_name("ACK10")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   44

    2190                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_ACK10")
    2191                      .dwattr $C$DW$189, DW_AT_bit_offset(0x06)
    2192                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2193                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2195              
    2196              $C$DW$190       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$29)
    2198                      .dwattr $C$DW$190, DW_AT_name("ACK11")
    2199                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_ACK11")
    2200                      .dwattr $C$DW$190, DW_AT_bit_offset(0x05)
    2201                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2202                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2203                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2204              
    2205              $C$DW$191       .dwtag  DW_TAG_member
    2206                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$29)
    2207                      .dwattr $C$DW$191, DW_AT_name("ACK12")
    2208                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_ACK12")
    2209                      .dwattr $C$DW$191, DW_AT_bit_offset(0x04)
    2210                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2211                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2213              
    2214              $C$DW$192       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$29)
    2216                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    2217                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    2218                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    2219                      .dwattr $C$DW$192, DW_AT_bit_size(0x04)
    2220                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2222              
    2223                      .dwendtag $C$DW$T$30
    2224              
    2225              
    2226              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2227                      .dwattr $C$DW$T$31, DW_AT_name("PIEACK_REG")
    2228                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2229              $C$DW$193       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$29)
    2231                      .dwattr $C$DW$193, DW_AT_name("all")
    2232                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_all")
    2233                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2234                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2235              
    2236              $C$DW$194       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$30)
    2238                      .dwattr $C$DW$194, DW_AT_name("bit")
    2239                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_bit")
    2240                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2241                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2242              
    2243                      .dwendtag $C$DW$T$31
    2244              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   45

    2245              
    2246              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2247                      .dwattr $C$DW$T$32, DW_AT_name("PIECTRL_BITS")
    2248                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2249              $C$DW$195       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$29)
    2251                      .dwattr $C$DW$195, DW_AT_name("ENPIE")
    2252                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_ENPIE")
    2253                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0f)
    2254                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2255                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$196       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$29)
    2260                      .dwattr $C$DW$196, DW_AT_name("PIEVECT")
    2261                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_PIEVECT")
    2262                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00)
    2263                      .dwattr $C$DW$196, DW_AT_bit_size(0x0f)
    2264                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2265                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2266              
    2267                      .dwendtag $C$DW$T$32
    2268              
    2269              
    2270              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2271                      .dwattr $C$DW$T$33, DW_AT_name("PIECTRL_REG")
    2272                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2273              $C$DW$197       .dwtag  DW_TAG_member
    2274                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$29)
    2275                      .dwattr $C$DW$197, DW_AT_name("all")
    2276                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_all")
    2277                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$198       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$32)
    2282                      .dwattr $C$DW$198, DW_AT_name("bit")
    2283                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_bit")
    2284                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2285                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2286              
    2287                      .dwendtag $C$DW$T$33
    2288              
    2289              
    2290              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2291                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER10_BITS")
    2292                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2293              $C$DW$199       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$29)
    2295                      .dwattr $C$DW$199, DW_AT_name("INTx1")
    2296                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_INTx1")
    2297                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0f)
    2298                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2299                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   46

    2300                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2301              
    2302              $C$DW$200       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$29)
    2304                      .dwattr $C$DW$200, DW_AT_name("INTx2")
    2305                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_INTx2")
    2306                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0e)
    2307                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2308                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2309                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2310              
    2311              $C$DW$201       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$29)
    2313                      .dwattr $C$DW$201, DW_AT_name("INTx3")
    2314                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_INTx3")
    2315                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0d)
    2316                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2317                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2318                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2319              
    2320              $C$DW$202       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$29)
    2322                      .dwattr $C$DW$202, DW_AT_name("INTx4")
    2323                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_INTx4")
    2324                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0c)
    2325                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2326                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2327                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2328              
    2329              $C$DW$203       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$29)
    2331                      .dwattr $C$DW$203, DW_AT_name("INTx5")
    2332                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_INTx5")
    2333                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0b)
    2334                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2335                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2336                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2337              
    2338              $C$DW$204       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$29)
    2340                      .dwattr $C$DW$204, DW_AT_name("INTx6")
    2341                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTx6")
    2342                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0a)
    2343                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2344                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2345                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2346              
    2347              $C$DW$205       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$29)
    2349                      .dwattr $C$DW$205, DW_AT_name("INTx7")
    2350                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_INTx7")
    2351                      .dwattr $C$DW$205, DW_AT_bit_offset(0x09)
    2352                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2353                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2354                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   47

    2355              
    2356              $C$DW$206       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$29)
    2358                      .dwattr $C$DW$206, DW_AT_name("INTx8")
    2359                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_INTx8")
    2360                      .dwattr $C$DW$206, DW_AT_bit_offset(0x08)
    2361                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2362                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2363                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2364              
    2365              $C$DW$207       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$29)
    2367                      .dwattr $C$DW$207, DW_AT_name("INTx9")
    2368                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_INTx9")
    2369                      .dwattr $C$DW$207, DW_AT_bit_offset(0x07)
    2370                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2371                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2373              
    2374              $C$DW$208       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$29)
    2376                      .dwattr $C$DW$208, DW_AT_name("INTx10")
    2377                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_INTx10")
    2378                      .dwattr $C$DW$208, DW_AT_bit_offset(0x06)
    2379                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2380                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383              $C$DW$209       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$29)
    2385                      .dwattr $C$DW$209, DW_AT_name("INTx11")
    2386                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_INTx11")
    2387                      .dwattr $C$DW$209, DW_AT_bit_offset(0x05)
    2388                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2389                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2390                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2391              
    2392              $C$DW$210       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$29)
    2394                      .dwattr $C$DW$210, DW_AT_name("INTx12")
    2395                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_INTx12")
    2396                      .dwattr $C$DW$210, DW_AT_bit_offset(0x04)
    2397                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2398                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2399                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$211       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$29)
    2403                      .dwattr $C$DW$211, DW_AT_name("INTx13")
    2404                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_INTx13")
    2405                      .dwattr $C$DW$211, DW_AT_bit_offset(0x03)
    2406                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2407                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2409              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   48

    2410              $C$DW$212       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$29)
    2412                      .dwattr $C$DW$212, DW_AT_name("INTx14")
    2413                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_INTx14")
    2414                      .dwattr $C$DW$212, DW_AT_bit_offset(0x02)
    2415                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2416                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419              $C$DW$213       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$29)
    2421                      .dwattr $C$DW$213, DW_AT_name("INTx15")
    2422                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_INTx15")
    2423                      .dwattr $C$DW$213, DW_AT_bit_offset(0x01)
    2424                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2425                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2426                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2427              
    2428              $C$DW$214       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$29)
    2430                      .dwattr $C$DW$214, DW_AT_name("INTx16")
    2431                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_INTx16")
    2432                      .dwattr $C$DW$214, DW_AT_bit_offset(0x00)
    2433                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2434                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2435                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2436              
    2437                      .dwendtag $C$DW$T$34
    2438              
    2439              
    2440              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2441                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER10_REG")
    2442                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2443              $C$DW$215       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$29)
    2445                      .dwattr $C$DW$215, DW_AT_name("all")
    2446                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_all")
    2447                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2448                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$216       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$34)
    2452                      .dwattr $C$DW$216, DW_AT_name("bit")
    2453                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_bit")
    2454                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2455                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2456              
    2457                      .dwendtag $C$DW$T$35
    2458              
    2459              
    2460              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2461                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER11_BITS")
    2462                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2463              $C$DW$217       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   49

    2465                      .dwattr $C$DW$217, DW_AT_name("INTx1")
    2466                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_INTx1")
    2467                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0f)
    2468                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2469                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2471              
    2472              $C$DW$218       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$29)
    2474                      .dwattr $C$DW$218, DW_AT_name("INTx2")
    2475                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_INTx2")
    2476                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0e)
    2477                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2478                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2480              
    2481              $C$DW$219       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$29)
    2483                      .dwattr $C$DW$219, DW_AT_name("INTx3")
    2484                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_INTx3")
    2485                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0d)
    2486                      .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    2487                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2488                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2489              
    2490              $C$DW$220       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$29)
    2492                      .dwattr $C$DW$220, DW_AT_name("INTx4")
    2493                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_INTx4")
    2494                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0c)
    2495                      .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    2496                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2497                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2498              
    2499              $C$DW$221       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$29)
    2501                      .dwattr $C$DW$221, DW_AT_name("INTx5")
    2502                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_INTx5")
    2503                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0b)
    2504                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2505                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2506                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2507              
    2508              $C$DW$222       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$29)
    2510                      .dwattr $C$DW$222, DW_AT_name("INTx6")
    2511                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_INTx6")
    2512                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0a)
    2513                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2514                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2516              
    2517              $C$DW$223       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$29)
    2519                      .dwattr $C$DW$223, DW_AT_name("INTx7")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   50

    2520                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_INTx7")
    2521                      .dwattr $C$DW$223, DW_AT_bit_offset(0x09)
    2522                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2523                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2525              
    2526              $C$DW$224       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$29)
    2528                      .dwattr $C$DW$224, DW_AT_name("INTx8")
    2529                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_INTx8")
    2530                      .dwattr $C$DW$224, DW_AT_bit_offset(0x08)
    2531                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2532                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2534              
    2535              $C$DW$225       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$29)
    2537                      .dwattr $C$DW$225, DW_AT_name("INTx9")
    2538                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_INTx9")
    2539                      .dwattr $C$DW$225, DW_AT_bit_offset(0x07)
    2540                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2541                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2543              
    2544              $C$DW$226       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$29)
    2546                      .dwattr $C$DW$226, DW_AT_name("INTx10")
    2547                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_INTx10")
    2548                      .dwattr $C$DW$226, DW_AT_bit_offset(0x06)
    2549                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    2550                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2551                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2552              
    2553              $C$DW$227       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$29)
    2555                      .dwattr $C$DW$227, DW_AT_name("INTx11")
    2556                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_INTx11")
    2557                      .dwattr $C$DW$227, DW_AT_bit_offset(0x05)
    2558                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    2559                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2560                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2561              
    2562              $C$DW$228       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$29)
    2564                      .dwattr $C$DW$228, DW_AT_name("INTx12")
    2565                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_INTx12")
    2566                      .dwattr $C$DW$228, DW_AT_bit_offset(0x04)
    2567                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2568                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2569                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2570              
    2571              $C$DW$229       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$29)
    2573                      .dwattr $C$DW$229, DW_AT_name("INTx13")
    2574                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_INTx13")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   51

    2575                      .dwattr $C$DW$229, DW_AT_bit_offset(0x03)
    2576                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2577                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2578                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2579              
    2580              $C$DW$230       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$29)
    2582                      .dwattr $C$DW$230, DW_AT_name("INTx14")
    2583                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_INTx14")
    2584                      .dwattr $C$DW$230, DW_AT_bit_offset(0x02)
    2585                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    2586                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2587                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2588              
    2589              $C$DW$231       .dwtag  DW_TAG_member
    2590                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$29)
    2591                      .dwattr $C$DW$231, DW_AT_name("INTx15")
    2592                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_INTx15")
    2593                      .dwattr $C$DW$231, DW_AT_bit_offset(0x01)
    2594                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    2595                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2596                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2597              
    2598              $C$DW$232       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$29)
    2600                      .dwattr $C$DW$232, DW_AT_name("INTx16")
    2601                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_INTx16")
    2602                      .dwattr $C$DW$232, DW_AT_bit_offset(0x00)
    2603                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    2604                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2605                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2606              
    2607                      .dwendtag $C$DW$T$36
    2608              
    2609              
    2610              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2611                      .dwattr $C$DW$T$37, DW_AT_name("PIEIER11_REG")
    2612                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2613              $C$DW$233       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$29)
    2615                      .dwattr $C$DW$233, DW_AT_name("all")
    2616                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_all")
    2617                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2618                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2619              
    2620              $C$DW$234       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$36)
    2622                      .dwattr $C$DW$234, DW_AT_name("bit")
    2623                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_bit")
    2624                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2625                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2626              
    2627                      .dwendtag $C$DW$T$37
    2628              
    2629              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   52

    2630              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2631                      .dwattr $C$DW$T$38, DW_AT_name("PIEIER12_BITS")
    2632                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2633              $C$DW$235       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$29)
    2635                      .dwattr $C$DW$235, DW_AT_name("INTx1")
    2636                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_INTx1")
    2637                      .dwattr $C$DW$235, DW_AT_bit_offset(0x0f)
    2638                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    2639                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2640                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2641              
    2642              $C$DW$236       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$29)
    2644                      .dwattr $C$DW$236, DW_AT_name("INTx2")
    2645                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_INTx2")
    2646                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0e)
    2647                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    2648                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2649                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2650              
    2651              $C$DW$237       .dwtag  DW_TAG_member
    2652                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$29)
    2653                      .dwattr $C$DW$237, DW_AT_name("INTx3")
    2654                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_INTx3")
    2655                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0d)
    2656                      .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    2657                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2658                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2659              
    2660              $C$DW$238       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$29)
    2662                      .dwattr $C$DW$238, DW_AT_name("INTx4")
    2663                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_INTx4")
    2664                      .dwattr $C$DW$238, DW_AT_bit_offset(0x0c)
    2665                      .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    2666                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2668              
    2669              $C$DW$239       .dwtag  DW_TAG_member
    2670                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$29)
    2671                      .dwattr $C$DW$239, DW_AT_name("INTx5")
    2672                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_INTx5")
    2673                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0b)
    2674                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    2675                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2677              
    2678              $C$DW$240       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$29)
    2680                      .dwattr $C$DW$240, DW_AT_name("INTx6")
    2681                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_INTx6")
    2682                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0a)
    2683                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    2684                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   53

    2685                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2686              
    2687              $C$DW$241       .dwtag  DW_TAG_member
    2688                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$29)
    2689                      .dwattr $C$DW$241, DW_AT_name("INTx7")
    2690                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_INTx7")
    2691                      .dwattr $C$DW$241, DW_AT_bit_offset(0x09)
    2692                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    2693                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2695              
    2696              $C$DW$242       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$29)
    2698                      .dwattr $C$DW$242, DW_AT_name("INTx8")
    2699                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_INTx8")
    2700                      .dwattr $C$DW$242, DW_AT_bit_offset(0x08)
    2701                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    2702                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2703                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2704              
    2705              $C$DW$243       .dwtag  DW_TAG_member
    2706                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$29)
    2707                      .dwattr $C$DW$243, DW_AT_name("INTx9")
    2708                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_INTx9")
    2709                      .dwattr $C$DW$243, DW_AT_bit_offset(0x07)
    2710                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    2711                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2712                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2713              
    2714              $C$DW$244       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$29)
    2716                      .dwattr $C$DW$244, DW_AT_name("INTx10")
    2717                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_INTx10")
    2718                      .dwattr $C$DW$244, DW_AT_bit_offset(0x06)
    2719                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    2720                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2722              
    2723              $C$DW$245       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$29)
    2725                      .dwattr $C$DW$245, DW_AT_name("INTx11")
    2726                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_INTx11")
    2727                      .dwattr $C$DW$245, DW_AT_bit_offset(0x05)
    2728                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    2729                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2731              
    2732              $C$DW$246       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$29)
    2734                      .dwattr $C$DW$246, DW_AT_name("INTx12")
    2735                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_INTx12")
    2736                      .dwattr $C$DW$246, DW_AT_bit_offset(0x04)
    2737                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
    2738                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2739                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   54

    2740              
    2741              $C$DW$247       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$29)
    2743                      .dwattr $C$DW$247, DW_AT_name("INTx13")
    2744                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_INTx13")
    2745                      .dwattr $C$DW$247, DW_AT_bit_offset(0x03)
    2746                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    2747                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2749              
    2750              $C$DW$248       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$29)
    2752                      .dwattr $C$DW$248, DW_AT_name("INTx14")
    2753                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_INTx14")
    2754                      .dwattr $C$DW$248, DW_AT_bit_offset(0x02)
    2755                      .dwattr $C$DW$248, DW_AT_bit_size(0x01)
    2756                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2757                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2758              
    2759              $C$DW$249       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$29)
    2761                      .dwattr $C$DW$249, DW_AT_name("INTx15")
    2762                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_INTx15")
    2763                      .dwattr $C$DW$249, DW_AT_bit_offset(0x01)
    2764                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    2765                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2766                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2767              
    2768              $C$DW$250       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$29)
    2770                      .dwattr $C$DW$250, DW_AT_name("INTx16")
    2771                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_INTx16")
    2772                      .dwattr $C$DW$250, DW_AT_bit_offset(0x00)
    2773                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    2774                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2776              
    2777                      .dwendtag $C$DW$T$38
    2778              
    2779              
    2780              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2781                      .dwattr $C$DW$T$39, DW_AT_name("PIEIER12_REG")
    2782                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2783              $C$DW$251       .dwtag  DW_TAG_member
    2784                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$29)
    2785                      .dwattr $C$DW$251, DW_AT_name("all")
    2786                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_all")
    2787                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2788                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2789              
    2790              $C$DW$252       .dwtag  DW_TAG_member
    2791                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$38)
    2792                      .dwattr $C$DW$252, DW_AT_name("bit")
    2793                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_bit")
    2794                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   55

    2795                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2796              
    2797                      .dwendtag $C$DW$T$39
    2798              
    2799              
    2800              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2801                      .dwattr $C$DW$T$40, DW_AT_name("PIEIER1_BITS")
    2802                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2803              $C$DW$253       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$29)
    2805                      .dwattr $C$DW$253, DW_AT_name("INTx1")
    2806                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_INTx1")
    2807                      .dwattr $C$DW$253, DW_AT_bit_offset(0x0f)
    2808                      .dwattr $C$DW$253, DW_AT_bit_size(0x01)
    2809                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2810                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2811              
    2812              $C$DW$254       .dwtag  DW_TAG_member
    2813                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$29)
    2814                      .dwattr $C$DW$254, DW_AT_name("INTx2")
    2815                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_INTx2")
    2816                      .dwattr $C$DW$254, DW_AT_bit_offset(0x0e)
    2817                      .dwattr $C$DW$254, DW_AT_bit_size(0x01)
    2818                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2819                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2820              
    2821              $C$DW$255       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$29)
    2823                      .dwattr $C$DW$255, DW_AT_name("INTx3")
    2824                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_INTx3")
    2825                      .dwattr $C$DW$255, DW_AT_bit_offset(0x0d)
    2826                      .dwattr $C$DW$255, DW_AT_bit_size(0x01)
    2827                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2828                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2829              
    2830              $C$DW$256       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$29)
    2832                      .dwattr $C$DW$256, DW_AT_name("INTx4")
    2833                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_INTx4")
    2834                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0c)
    2835                      .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    2836                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2837                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2838              
    2839              $C$DW$257       .dwtag  DW_TAG_member
    2840                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$29)
    2841                      .dwattr $C$DW$257, DW_AT_name("INTx5")
    2842                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_INTx5")
    2843                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0b)
    2844                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    2845                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2846                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2847              
    2848              $C$DW$258       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   56

    2850                      .dwattr $C$DW$258, DW_AT_name("INTx6")
    2851                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_INTx6")
    2852                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0a)
    2853                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    2854                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2855                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2856              
    2857              $C$DW$259       .dwtag  DW_TAG_member
    2858                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$29)
    2859                      .dwattr $C$DW$259, DW_AT_name("INTx7")
    2860                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_INTx7")
    2861                      .dwattr $C$DW$259, DW_AT_bit_offset(0x09)
    2862                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    2863                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2864                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2865              
    2866              $C$DW$260       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$29)
    2868                      .dwattr $C$DW$260, DW_AT_name("INTx8")
    2869                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_INTx8")
    2870                      .dwattr $C$DW$260, DW_AT_bit_offset(0x08)
    2871                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    2872                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2873                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2874              
    2875              $C$DW$261       .dwtag  DW_TAG_member
    2876                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$29)
    2877                      .dwattr $C$DW$261, DW_AT_name("INTx9")
    2878                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_INTx9")
    2879                      .dwattr $C$DW$261, DW_AT_bit_offset(0x07)
    2880                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    2881                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2882                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2883              
    2884              $C$DW$262       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$29)
    2886                      .dwattr $C$DW$262, DW_AT_name("INTx10")
    2887                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INTx10")
    2888                      .dwattr $C$DW$262, DW_AT_bit_offset(0x06)
    2889                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    2890                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2891                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2892              
    2893              $C$DW$263       .dwtag  DW_TAG_member
    2894                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$29)
    2895                      .dwattr $C$DW$263, DW_AT_name("INTx11")
    2896                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_INTx11")
    2897                      .dwattr $C$DW$263, DW_AT_bit_offset(0x05)
    2898                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    2899                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2900                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2901              
    2902              $C$DW$264       .dwtag  DW_TAG_member
    2903                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$29)
    2904                      .dwattr $C$DW$264, DW_AT_name("INTx12")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   57

    2905                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INTx12")
    2906                      .dwattr $C$DW$264, DW_AT_bit_offset(0x04)
    2907                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    2908                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2909                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2910              
    2911              $C$DW$265       .dwtag  DW_TAG_member
    2912                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$29)
    2913                      .dwattr $C$DW$265, DW_AT_name("INTx13")
    2914                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INTx13")
    2915                      .dwattr $C$DW$265, DW_AT_bit_offset(0x03)
    2916                      .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    2917                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2918                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2919              
    2920              $C$DW$266       .dwtag  DW_TAG_member
    2921                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$29)
    2922                      .dwattr $C$DW$266, DW_AT_name("INTx14")
    2923                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_INTx14")
    2924                      .dwattr $C$DW$266, DW_AT_bit_offset(0x02)
    2925                      .dwattr $C$DW$266, DW_AT_bit_size(0x01)
    2926                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2927                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2928              
    2929              $C$DW$267       .dwtag  DW_TAG_member
    2930                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$29)
    2931                      .dwattr $C$DW$267, DW_AT_name("INTx15")
    2932                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_INTx15")
    2933                      .dwattr $C$DW$267, DW_AT_bit_offset(0x01)
    2934                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    2935                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2936                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2937              
    2938              $C$DW$268       .dwtag  DW_TAG_member
    2939                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$29)
    2940                      .dwattr $C$DW$268, DW_AT_name("INTx16")
    2941                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_INTx16")
    2942                      .dwattr $C$DW$268, DW_AT_bit_offset(0x00)
    2943                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    2944                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2945                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2946              
    2947                      .dwendtag $C$DW$T$40
    2948              
    2949              
    2950              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2951                      .dwattr $C$DW$T$41, DW_AT_name("PIEIER1_REG")
    2952                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2953              $C$DW$269       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$29)
    2955                      .dwattr $C$DW$269, DW_AT_name("all")
    2956                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_all")
    2957                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2958                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2959              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   58

    2960              $C$DW$270       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$40)
    2962                      .dwattr $C$DW$270, DW_AT_name("bit")
    2963                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_bit")
    2964                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2965                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2966              
    2967                      .dwendtag $C$DW$T$41
    2968              
    2969              
    2970              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2971                      .dwattr $C$DW$T$42, DW_AT_name("PIEIER2_BITS")
    2972                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2973              $C$DW$271       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$29)
    2975                      .dwattr $C$DW$271, DW_AT_name("INTx1")
    2976                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INTx1")
    2977                      .dwattr $C$DW$271, DW_AT_bit_offset(0x0f)
    2978                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    2979                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2980                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2981              
    2982              $C$DW$272       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$29)
    2984                      .dwattr $C$DW$272, DW_AT_name("INTx2")
    2985                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INTx2")
    2986                      .dwattr $C$DW$272, DW_AT_bit_offset(0x0e)
    2987                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    2988                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2989                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2990              
    2991              $C$DW$273       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$29)
    2993                      .dwattr $C$DW$273, DW_AT_name("INTx3")
    2994                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_INTx3")
    2995                      .dwattr $C$DW$273, DW_AT_bit_offset(0x0d)
    2996                      .dwattr $C$DW$273, DW_AT_bit_size(0x01)
    2997                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2998                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2999              
    3000              $C$DW$274       .dwtag  DW_TAG_member
    3001                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$29)
    3002                      .dwattr $C$DW$274, DW_AT_name("INTx4")
    3003                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_INTx4")
    3004                      .dwattr $C$DW$274, DW_AT_bit_offset(0x0c)
    3005                      .dwattr $C$DW$274, DW_AT_bit_size(0x01)
    3006                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3007                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3008              
    3009              $C$DW$275       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$29)
    3011                      .dwattr $C$DW$275, DW_AT_name("INTx5")
    3012                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INTx5")
    3013                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0b)
    3014                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   59

    3015                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3016                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3017              
    3018              $C$DW$276       .dwtag  DW_TAG_member
    3019                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$29)
    3020                      .dwattr $C$DW$276, DW_AT_name("INTx6")
    3021                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INTx6")
    3022                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0a)
    3023                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    3024                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3026              
    3027              $C$DW$277       .dwtag  DW_TAG_member
    3028                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$29)
    3029                      .dwattr $C$DW$277, DW_AT_name("INTx7")
    3030                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INTx7")
    3031                      .dwattr $C$DW$277, DW_AT_bit_offset(0x09)
    3032                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    3033                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3034                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3035              
    3036              $C$DW$278       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$29)
    3038                      .dwattr $C$DW$278, DW_AT_name("INTx8")
    3039                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INTx8")
    3040                      .dwattr $C$DW$278, DW_AT_bit_offset(0x08)
    3041                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    3042                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3043                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3044              
    3045              $C$DW$279       .dwtag  DW_TAG_member
    3046                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$29)
    3047                      .dwattr $C$DW$279, DW_AT_name("INTx9")
    3048                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INTx9")
    3049                      .dwattr $C$DW$279, DW_AT_bit_offset(0x07)
    3050                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    3051                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3052                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3053              
    3054              $C$DW$280       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$29)
    3056                      .dwattr $C$DW$280, DW_AT_name("INTx10")
    3057                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INTx10")
    3058                      .dwattr $C$DW$280, DW_AT_bit_offset(0x06)
    3059                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    3060                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3061                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3062              
    3063              $C$DW$281       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$29)
    3065                      .dwattr $C$DW$281, DW_AT_name("INTx11")
    3066                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INTx11")
    3067                      .dwattr $C$DW$281, DW_AT_bit_offset(0x05)
    3068                      .dwattr $C$DW$281, DW_AT_bit_size(0x01)
    3069                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   60

    3070                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3071              
    3072              $C$DW$282       .dwtag  DW_TAG_member
    3073                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$29)
    3074                      .dwattr $C$DW$282, DW_AT_name("INTx12")
    3075                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_INTx12")
    3076                      .dwattr $C$DW$282, DW_AT_bit_offset(0x04)
    3077                      .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    3078                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3079                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3080              
    3081              $C$DW$283       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$29)
    3083                      .dwattr $C$DW$283, DW_AT_name("INTx13")
    3084                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_INTx13")
    3085                      .dwattr $C$DW$283, DW_AT_bit_offset(0x03)
    3086                      .dwattr $C$DW$283, DW_AT_bit_size(0x01)
    3087                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3088                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3089              
    3090              $C$DW$284       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$29)
    3092                      .dwattr $C$DW$284, DW_AT_name("INTx14")
    3093                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_INTx14")
    3094                      .dwattr $C$DW$284, DW_AT_bit_offset(0x02)
    3095                      .dwattr $C$DW$284, DW_AT_bit_size(0x01)
    3096                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3097                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3098              
    3099              $C$DW$285       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$29)
    3101                      .dwattr $C$DW$285, DW_AT_name("INTx15")
    3102                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_INTx15")
    3103                      .dwattr $C$DW$285, DW_AT_bit_offset(0x01)
    3104                      .dwattr $C$DW$285, DW_AT_bit_size(0x01)
    3105                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3106                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3107              
    3108              $C$DW$286       .dwtag  DW_TAG_member
    3109                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$29)
    3110                      .dwattr $C$DW$286, DW_AT_name("INTx16")
    3111                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_INTx16")
    3112                      .dwattr $C$DW$286, DW_AT_bit_offset(0x00)
    3113                      .dwattr $C$DW$286, DW_AT_bit_size(0x01)
    3114                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3115                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3116              
    3117                      .dwendtag $C$DW$T$42
    3118              
    3119              
    3120              $C$DW$T$43      .dwtag  DW_TAG_union_type
    3121                      .dwattr $C$DW$T$43, DW_AT_name("PIEIER2_REG")
    3122                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3123              $C$DW$287       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   61

    3125                      .dwattr $C$DW$287, DW_AT_name("all")
    3126                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_all")
    3127                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3128                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3129              
    3130              $C$DW$288       .dwtag  DW_TAG_member
    3131                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$42)
    3132                      .dwattr $C$DW$288, DW_AT_name("bit")
    3133                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_bit")
    3134                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3135                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3136              
    3137                      .dwendtag $C$DW$T$43
    3138              
    3139              
    3140              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3141                      .dwattr $C$DW$T$44, DW_AT_name("PIEIER3_BITS")
    3142                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    3143              $C$DW$289       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$29)
    3145                      .dwattr $C$DW$289, DW_AT_name("INTx1")
    3146                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_INTx1")
    3147                      .dwattr $C$DW$289, DW_AT_bit_offset(0x0f)
    3148                      .dwattr $C$DW$289, DW_AT_bit_size(0x01)
    3149                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3150                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3151              
    3152              $C$DW$290       .dwtag  DW_TAG_member
    3153                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$29)
    3154                      .dwattr $C$DW$290, DW_AT_name("INTx2")
    3155                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_INTx2")
    3156                      .dwattr $C$DW$290, DW_AT_bit_offset(0x0e)
    3157                      .dwattr $C$DW$290, DW_AT_bit_size(0x01)
    3158                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3159                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3160              
    3161              $C$DW$291       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$29)
    3163                      .dwattr $C$DW$291, DW_AT_name("INTx3")
    3164                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_INTx3")
    3165                      .dwattr $C$DW$291, DW_AT_bit_offset(0x0d)
    3166                      .dwattr $C$DW$291, DW_AT_bit_size(0x01)
    3167                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3168                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3169              
    3170              $C$DW$292       .dwtag  DW_TAG_member
    3171                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$29)
    3172                      .dwattr $C$DW$292, DW_AT_name("INTx4")
    3173                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_INTx4")
    3174                      .dwattr $C$DW$292, DW_AT_bit_offset(0x0c)
    3175                      .dwattr $C$DW$292, DW_AT_bit_size(0x01)
    3176                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3177                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3178              
    3179              $C$DW$293       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   62

    3180                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$29)
    3181                      .dwattr $C$DW$293, DW_AT_name("INTx5")
    3182                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_INTx5")
    3183                      .dwattr $C$DW$293, DW_AT_bit_offset(0x0b)
    3184                      .dwattr $C$DW$293, DW_AT_bit_size(0x01)
    3185                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3186                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3187              
    3188              $C$DW$294       .dwtag  DW_TAG_member
    3189                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$29)
    3190                      .dwattr $C$DW$294, DW_AT_name("INTx6")
    3191                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_INTx6")
    3192                      .dwattr $C$DW$294, DW_AT_bit_offset(0x0a)
    3193                      .dwattr $C$DW$294, DW_AT_bit_size(0x01)
    3194                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3195                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3196              
    3197              $C$DW$295       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$29)
    3199                      .dwattr $C$DW$295, DW_AT_name("INTx7")
    3200                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_INTx7")
    3201                      .dwattr $C$DW$295, DW_AT_bit_offset(0x09)
    3202                      .dwattr $C$DW$295, DW_AT_bit_size(0x01)
    3203                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3204                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3205              
    3206              $C$DW$296       .dwtag  DW_TAG_member
    3207                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$29)
    3208                      .dwattr $C$DW$296, DW_AT_name("INTx8")
    3209                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_INTx8")
    3210                      .dwattr $C$DW$296, DW_AT_bit_offset(0x08)
    3211                      .dwattr $C$DW$296, DW_AT_bit_size(0x01)
    3212                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3213                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3214              
    3215              $C$DW$297       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$29)
    3217                      .dwattr $C$DW$297, DW_AT_name("INTx9")
    3218                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_INTx9")
    3219                      .dwattr $C$DW$297, DW_AT_bit_offset(0x07)
    3220                      .dwattr $C$DW$297, DW_AT_bit_size(0x01)
    3221                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3222                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3223              
    3224              $C$DW$298       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$29)
    3226                      .dwattr $C$DW$298, DW_AT_name("INTx10")
    3227                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_INTx10")
    3228                      .dwattr $C$DW$298, DW_AT_bit_offset(0x06)
    3229                      .dwattr $C$DW$298, DW_AT_bit_size(0x01)
    3230                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3231                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3232              
    3233              $C$DW$299       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2D57DA14-F5FE-42F4-86A1-520DE9D1F218} PAGE   63

