TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../MUCI_bsp.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__error__")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___error__")

    1194              $C$DW$151       .dwtag  DW_TAG_enumerator
    1195                      .dwattr $C$DW$151, DW_AT_name("SCI_FIFO_RX4")
    1196                      .dwattr $C$DW$151, DW_AT_const_value(0x04)
    1197              
    1198              $C$DW$152       .dwtag  DW_TAG_enumerator
    1199                      .dwattr $C$DW$152, DW_AT_name("SCI_FIFO_RX5")
    1200                      .dwattr $C$DW$152, DW_AT_const_value(0x05)
    1201              
    1202              $C$DW$153       .dwtag  DW_TAG_enumerator
    1203                      .dwattr $C$DW$153, DW_AT_name("SCI_FIFO_RX6")
    1204                      .dwattr $C$DW$153, DW_AT_const_value(0x06)
    1205              
    1206              $C$DW$154       .dwtag  DW_TAG_enumerator
    1207                      .dwattr $C$DW$154, DW_AT_name("SCI_FIFO_RX7")
    1208                      .dwattr $C$DW$154, DW_AT_const_value(0x07)
    1209              
    1210              $C$DW$155       .dwtag  DW_TAG_enumerator
    1211                      .dwattr $C$DW$155, DW_AT_name("SCI_FIFO_RX8")
    1212                      .dwattr $C$DW$155, DW_AT_const_value(0x08)
    1213              
    1214              $C$DW$156       .dwtag  DW_TAG_enumerator
    1215                      .dwattr $C$DW$156, DW_AT_name("SCI_FIFO_RX9")
    1216                      .dwattr $C$DW$156, DW_AT_const_value(0x09)
    1217              
    1218              $C$DW$157       .dwtag  DW_TAG_enumerator
    1219                      .dwattr $C$DW$157, DW_AT_name("SCI_FIFO_RX10")
    1220                      .dwattr $C$DW$157, DW_AT_const_value(0x0a)
    1221              
    1222              $C$DW$158       .dwtag  DW_TAG_enumerator
    1223                      .dwattr $C$DW$158, DW_AT_name("SCI_FIFO_RX11")
    1224                      .dwattr $C$DW$158, DW_AT_const_value(0x0b)
    1225              
    1226              $C$DW$159       .dwtag  DW_TAG_enumerator
    1227                      .dwattr $C$DW$159, DW_AT_name("SCI_FIFO_RX12")
    1228                      .dwattr $C$DW$159, DW_AT_const_value(0x0c)
    1229              
    1230              $C$DW$160       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   24

    1231                      .dwattr $C$DW$160, DW_AT_name("SCI_FIFO_RX13")
    1232                      .dwattr $C$DW$160, DW_AT_const_value(0x0d)
    1233              
    1234              $C$DW$161       .dwtag  DW_TAG_enumerator
    1235                      .dwattr $C$DW$161, DW_AT_name("SCI_FIFO_RX14")
    1236                      .dwattr $C$DW$161, DW_AT_const_value(0x0e)
    1237              
    1238              $C$DW$162       .dwtag  DW_TAG_enumerator
    1239                      .dwattr $C$DW$162, DW_AT_name("SCI_FIFO_RX15")
    1240                      .dwattr $C$DW$162, DW_AT_const_value(0x0f)
    1241              
    1242              $C$DW$163       .dwtag  DW_TAG_enumerator
    1243                      .dwattr $C$DW$163, DW_AT_name("SCI_FIFO_RX16")
    1244                      .dwattr $C$DW$163, DW_AT_const_value(0x10)
    1245              
    1246                      .dwendtag $C$DW$T$48
    1247              
    1248              $C$DW$T$49      .dwtag  DW_TAG_typedef
    1249                      .dwattr $C$DW$T$49, DW_AT_name("SCI_RxFIFOLevel")
    1250                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1251                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1252              
    1253              
    1254              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    1255                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1256              $C$DW$164       .dwtag  DW_TAG_enumerator
    1257                      .dwattr $C$DW$164, DW_AT_name("MUCI_DEVICESTATE_APP_RUN")
    1258                      .dwattr $C$DW$164, DW_AT_const_value(0x00)
    1259              
    1260              $C$DW$165       .dwtag  DW_TAG_enumerator
    1261                      .dwattr $C$DW$165, DW_AT_name("MUCI_DEVICESTATE_BOOT_RUN_CHK_OK")
    1262                      .dwattr $C$DW$165, DW_AT_const_value(0x01)
    1263              
    1264              $C$DW$166       .dwtag  DW_TAG_enumerator
    1265                      .dwattr $C$DW$166, DW_AT_name("MUCI_DEVICESTATE_BOOT_RUN_CHK_NOK")
    1266                      .dwattr $C$DW$166, DW_AT_const_value(0x02)
    1267              
    1268              $C$DW$167       .dwtag  DW_TAG_enumerator
    1269                      .dwattr $C$DW$167, DW_AT_name("MUCI_DEVICESTATE_FLASHAPI_RUN")
    1270                      .dwattr $C$DW$167, DW_AT_const_value(0x03)
    1271              
    1272                      .dwendtag $C$DW$T$51
    1273              
    1274              $C$DW$T$52      .dwtag  DW_TAG_typedef
    1275                      .dwattr $C$DW$T$52, DW_AT_name("MUCI_ApplicationState_t")
    1276                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1277                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1278              
    1279              
    1280              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1281                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x409)
    1282              $C$DW$168       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    1284                      .dwattr $C$DW$168, DW_AT_name("Address")
    1285                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_Address")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   25

    1286                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289              $C$DW$169       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    1291                      .dwattr $C$DW$169, DW_AT_name("Command")
    1292                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Command")
    1293                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1294                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1295              
    1296              $C$DW$170       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    1298                      .dwattr $C$DW$170, DW_AT_name("Key")
    1299                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_Key")
    1300                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1301                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303              $C$DW$171       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    1305                      .dwattr $C$DW$171, DW_AT_name("DataLength")
    1306                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_DataLength")
    1307                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1308                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1309              
    1310              $C$DW$172       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$24)
    1312                      .dwattr $C$DW$172, DW_AT_name("Data")
    1313                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_Data")
    1314                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1315                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317              $C$DW$173       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    1319                      .dwattr $C$DW$173, DW_AT_name("DataPointer")
    1320                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_DataPointer")
    1321                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
    1322                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324              $C$DW$174       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    1326                      .dwattr $C$DW$174, DW_AT_name("CRC")
    1327                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_CRC")
    1328                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    1329                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1330              
    1331              $C$DW$175       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$25)
    1333                      .dwattr $C$DW$175, DW_AT_name("DLEWas")
    1334                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_DLEWas")
    1335                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    1336                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1337              
    1338              $C$DW$176       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    1340                      .dwattr $C$DW$176, DW_AT_name("State")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   26

    1341                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_State")
    1342                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    1343                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1344              
    1345              $C$DW$177       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    1347                      .dwattr $C$DW$177, DW_AT_name("NextState")
    1348                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_NextState")
    1349                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
    1350                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1351              
    1352                      .dwendtag $C$DW$T$28
    1353              
    1354              $C$DW$T$53      .dwtag  DW_TAG_typedef
    1355                      .dwattr $C$DW$T$53, DW_AT_name("MUCI_Packet_t")
    1356                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$28)
    1357                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1358              
    1359              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    1360                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1361                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    1362              
    1363              
    1364              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1365                      .dwattr $C$DW$T$30, DW_AT_name("SCSR_BITS")
    1366                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1367              $C$DW$178       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$29)
    1369                      .dwattr $C$DW$178, DW_AT_name("WDOVERRIDE")
    1370                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_WDOVERRIDE")
    1371                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0f)
    1372                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    1373                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1374                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1375              
    1376              $C$DW$179       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$29)
    1378                      .dwattr $C$DW$179, DW_AT_name("WDENINT")
    1379                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_WDENINT")
    1380                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    1381                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    1382                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$180       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$29)
    1387                      .dwattr $C$DW$180, DW_AT_name("WDINTS")
    1388                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_WDINTS")
    1389                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0d)
    1390                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    1391                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394              $C$DW$181       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   27

    1396                      .dwattr $C$DW$181, DW_AT_name("rsvd1")
    1397                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd1")
    1398                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00)
    1399                      .dwattr $C$DW$181, DW_AT_bit_size(0x0d)
    1400                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1402              
    1403                      .dwendtag $C$DW$T$30
    1404              
    1405              
    1406              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1407                      .dwattr $C$DW$T$31, DW_AT_name("SCSR_REG")
    1408                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1409              $C$DW$182       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$29)
    1411                      .dwattr $C$DW$182, DW_AT_name("all")
    1412                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_all")
    1413                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1415              
    1416              $C$DW$183       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$30)
    1418                      .dwattr $C$DW$183, DW_AT_name("bit")
    1419                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_bit")
    1420                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1422              
    1423                      .dwendtag $C$DW$T$31
    1424              
    1425              
    1426              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1427                      .dwattr $C$DW$T$32, DW_AT_name("WDCNTR_BITS")
    1428                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1429              $C$DW$184       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$29)
    1431                      .dwattr $C$DW$184, DW_AT_name("WDCNTR")
    1432                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_WDCNTR")
    1433                      .dwattr $C$DW$184, DW_AT_bit_offset(0x08)
    1434                      .dwattr $C$DW$184, DW_AT_bit_size(0x08)
    1435                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1437              
    1438              $C$DW$185       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$29)
    1440                      .dwattr $C$DW$185, DW_AT_name("rsvd1")
    1441                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd1")
    1442                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    1443                      .dwattr $C$DW$185, DW_AT_bit_size(0x08)
    1444                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1446              
    1447                      .dwendtag $C$DW$T$32
    1448              
    1449              
    1450              $C$DW$T$33      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   28

    1451                      .dwattr $C$DW$T$33, DW_AT_name("WDCNTR_REG")
    1452                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1453              $C$DW$186       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$29)
    1455                      .dwattr $C$DW$186, DW_AT_name("all")
    1456                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_all")
    1457                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460              $C$DW$187       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    1462                      .dwattr $C$DW$187, DW_AT_name("bit")
    1463                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_bit")
    1464                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1466              
    1467                      .dwendtag $C$DW$T$33
    1468              
    1469              
    1470              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1471                      .dwattr $C$DW$T$34, DW_AT_name("WDCR_BITS")
    1472                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1473              $C$DW$188       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$29)
    1475                      .dwattr $C$DW$188, DW_AT_name("WDPS")
    1476                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_WDPS")
    1477                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0d)
    1478                      .dwattr $C$DW$188, DW_AT_bit_size(0x03)
    1479                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1480                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482              $C$DW$189       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$29)
    1484                      .dwattr $C$DW$189, DW_AT_name("WDCHK")
    1485                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_WDCHK")
    1486                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0a)
    1487                      .dwattr $C$DW$189, DW_AT_bit_size(0x03)
    1488                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1490              
    1491              $C$DW$190       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$29)
    1493                      .dwattr $C$DW$190, DW_AT_name("WDDIS")
    1494                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_WDDIS")
    1495                      .dwattr $C$DW$190, DW_AT_bit_offset(0x09)
    1496                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    1497                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1499              
    1500              $C$DW$191       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$29)
    1502                      .dwattr $C$DW$191, DW_AT_name("WDFLG")
    1503                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_WDFLG")
    1504                      .dwattr $C$DW$191, DW_AT_bit_offset(0x08)
    1505                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   29

    1506                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1508              
    1509              $C$DW$192       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$29)
    1511                      .dwattr $C$DW$192, DW_AT_name("WDPRECLKDIV")
    1512                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_WDPRECLKDIV")
    1513                      .dwattr $C$DW$192, DW_AT_bit_offset(0x04)
    1514                      .dwattr $C$DW$192, DW_AT_bit_size(0x04)
    1515                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1517              
    1518              $C$DW$193       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$29)
    1520                      .dwattr $C$DW$193, DW_AT_name("rsvd1")
    1521                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd1")
    1522                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
    1523                      .dwattr $C$DW$193, DW_AT_bit_size(0x04)
    1524                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1526              
    1527                      .dwendtag $C$DW$T$34
    1528              
    1529              
    1530              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1531                      .dwattr $C$DW$T$35, DW_AT_name("WDCR_REG")
    1532                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1533              $C$DW$194       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$29)
    1535                      .dwattr $C$DW$194, DW_AT_name("all")
    1536                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    1537                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1539              
    1540              $C$DW$195       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$34)
    1542                      .dwattr $C$DW$195, DW_AT_name("bit")
    1543                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    1544                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1546              
    1547                      .dwendtag $C$DW$T$35
    1548              
    1549              
    1550              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1551                      .dwattr $C$DW$T$36, DW_AT_name("WDKEY_BITS")
    1552                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1553              $C$DW$196       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$29)
    1555                      .dwattr $C$DW$196, DW_AT_name("WDKEY")
    1556                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_WDKEY")
    1557                      .dwattr $C$DW$196, DW_AT_bit_offset(0x08)
    1558                      .dwattr $C$DW$196, DW_AT_bit_size(0x08)
    1559                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   30

    1561              
    1562              $C$DW$197       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$29)
    1564                      .dwattr $C$DW$197, DW_AT_name("rsvd1")
    1565                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd1")
    1566                      .dwattr $C$DW$197, DW_AT_bit_offset(0x00)
    1567                      .dwattr $C$DW$197, DW_AT_bit_size(0x08)
    1568                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1570              
    1571                      .dwendtag $C$DW$T$36
    1572              
    1573              
    1574              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1575                      .dwattr $C$DW$T$37, DW_AT_name("WDKEY_REG")
    1576                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1577              $C$DW$198       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$29)
    1579                      .dwattr $C$DW$198, DW_AT_name("all")
    1580                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_all")
    1581                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1583              
    1584              $C$DW$199       .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$36)
    1586                      .dwattr $C$DW$199, DW_AT_name("bit")
    1587                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_bit")
    1588                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591                      .dwendtag $C$DW$T$37
    1592              
    1593              
    1594              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1595                      .dwattr $C$DW$T$38, DW_AT_name("WDWCR_BITS")
    1596                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1597              $C$DW$200       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$29)
    1599                      .dwattr $C$DW$200, DW_AT_name("MIN")
    1600                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_MIN")
    1601                      .dwattr $C$DW$200, DW_AT_bit_offset(0x08)
    1602                      .dwattr $C$DW$200, DW_AT_bit_size(0x08)
    1603                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1604                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1605              
    1606              $C$DW$201       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$29)
    1608                      .dwattr $C$DW$201, DW_AT_name("FIRSTKEY")
    1609                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_FIRSTKEY")
    1610                      .dwattr $C$DW$201, DW_AT_bit_offset(0x07)
    1611                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    1612                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1614              
    1615              $C$DW$202       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   31

    1616                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$29)
    1617                      .dwattr $C$DW$202, DW_AT_name("rsvd1")
    1618                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd1")
    1619                      .dwattr $C$DW$202, DW_AT_bit_offset(0x00)
    1620                      .dwattr $C$DW$202, DW_AT_bit_size(0x07)
    1621                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1623              
    1624                      .dwendtag $C$DW$T$38
    1625              
    1626              
    1627              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1628                      .dwattr $C$DW$T$39, DW_AT_name("WDWCR_REG")
    1629                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1630              $C$DW$203       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$29)
    1632                      .dwattr $C$DW$203, DW_AT_name("all")
    1633                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_all")
    1634                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1636              
    1637              $C$DW$204       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$38)
    1639                      .dwattr $C$DW$204, DW_AT_name("bit")
    1640                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_bit")
    1641                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644                      .dwendtag $C$DW$T$39
    1645              
    1646              
    1647              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1648                      .dwattr $C$DW$T$42, DW_AT_name("WD_REGS")
    1649                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2b)
    1650              $C$DW$205       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$40)
    1652                      .dwattr $C$DW$205, DW_AT_name("rsvd1")
    1653                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd1")
    1654                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1656              
    1657              $C$DW$206       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$31)
    1659                      .dwattr $C$DW$206, DW_AT_name("SCSR")
    1660                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_SCSR")
    1661                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1662                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1663              
    1664              $C$DW$207       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$33)
    1666                      .dwattr $C$DW$207, DW_AT_name("WDCNTR")
    1667                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_WDCNTR")
    1668                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1669                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1670              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   32

    1671              $C$DW$208       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$29)
    1673                      .dwattr $C$DW$208, DW_AT_name("rsvd2")
    1674                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd2")
    1675                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1676                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1677              
    1678              $C$DW$209       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$37)
    1680                      .dwattr $C$DW$209, DW_AT_name("WDKEY")
    1681                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_WDKEY")
    1682                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1683                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1684              
    1685              $C$DW$210       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$41)
    1687                      .dwattr $C$DW$210, DW_AT_name("rsvd3")
    1688                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd3")
    1689                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1690                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1691              
    1692              $C$DW$211       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$35)
    1694                      .dwattr $C$DW$211, DW_AT_name("WDCR")
    1695                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_WDCR")
    1696                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1697                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699              $C$DW$212       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$39)
    1701                      .dwattr $C$DW$212, DW_AT_name("WDWCR")
    1702                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_WDWCR")
    1703                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1704                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1705              
    1706                      .dwendtag $C$DW$T$42
    1707              
    1708              $C$DW$213       .dwtag  DW_TAG_TI_far_type
    1709                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$42)
    1710              
    1711              $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1712                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$213)
    1713              
    1714              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1715                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1716              
    1717              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1718                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1719                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1720                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1721              
    1722              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1723                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1724                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1725                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{CF9A199C-233F-4AEE-BF8C-B4A04E4A06C9} PAGE   33

    1726              
    1727              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1728                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1729                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1730                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1731              
    1732              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1733                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1734                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1735                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1736              
    1737              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1738                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1739                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1740                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1741              
    1742              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1743                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1744                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1745                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1746              
    1747              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1748                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1749                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1750                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1751              
    1752              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1753                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1754                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1755                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1756              
    1757              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1758                      .dwattr $C$DW$T$29, DW_AT_name("Uint16")
    1759                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$11)
    1760                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1761              
    1762              
    1763              $C$DW$T$40      .dwtag  DW_TAG_array_type
    1764                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$29)
