TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C4FAC29-1686-4DDF-BE2B-8424816DCE93} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:54 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../Term_defs.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C4FAC29-1686-4DDF-BE2B-8424816DCE93} PAGE   37

    1898                      .dwattr $C$DW$41, DW_AT_external
    1899              
    1900                      .sblock ".ebss"
    1901                      .sblock ".ebss:_tabptr"
    1902                      .sblock ".ebss:_tabsize"
    1903              ;       D:\Programs\TI\ccs1281\ccs\tools\compiler\ti-cgt-c2000_22.6.1.LTS\bin\opt2000.exe C:\\Users\\Daniel\\
    1904              ;       D:\Programs\TI\ccs1281\ccs\tools\compiler\ti-cgt-c2000_22.6.1.LTS\bin\ac2000.exe -@C:\\Users\\Daniel\
    1905 00000000               .sect   ".text:_InitTermVars"
    1906                      .clink
    1907                      .global _InitTermVars
    1908              
    1909              $C$DW$42        .dwtag  DW_TAG_subprogram
    1910                      .dwattr $C$DW$42, DW_AT_name("InitTermVars")
    1911                      .dwattr $C$DW$42, DW_AT_low_pc(_InitTermVars)
    1912                      .dwattr $C$DW$42, DW_AT_high_pc(0x00)
    1913                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_InitTermVars")
    1914                      .dwattr $C$DW$42, DW_AT_external
    1915                      .dwattr $C$DW$42, DW_AT_TI_begin_file("../Term_defs.c")
    1916                      .dwattr $C$DW$42, DW_AT_TI_begin_line(0x81)
    1917                      .dwattr $C$DW$42, DW_AT_TI_begin_column(0x06)
    1918                      .dwattr $C$DW$42, DW_AT_TI_max_frame_size(-2)
    1919                      .dwpsn  file "../Term_defs.c",line 130,column 1,is_stmt,address _InitTermVars,isa 0
    1920              
    1921                      .dwfde $C$DW$CIE, _InitTermVars
    1922              
    1923              ;***************************************************************
    1924              ;* FNAME: _InitTermVars                 FR SIZE:   0           *
    1925              ;*                                                             *
    1926              ;* FUNCTION ENVIRONMENT                                        *
    1927              ;*                                                             *
    1928              ;* FUNCTION PROPERTIES                                         *
    1929              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1930              ;***************************************************************
    1931              
    1932 00000000       _InitTermVars:
    1933              ;* AR4   assigned to $O$C1
    1934                      .dwcfi  cfa_offset, -2
    1935                      .dwcfi  save_reg_to_mem, 26, 0
    1936 00000000 761F-         MOVW      DP,#_len_error_descriptor ; [CPU_ARAU] 
         00000001 0000 
    1937                      .dwpsn  file "../Term_defs.c",line 131,column 1,is_stmt,isa 0
    1938 00000002 8F00-         MOVL      XAR4,#_tabsize        ; [CPU_ARAU] |131| 
         00000003 0000 
    1939                      .dwpsn  file "../Term_defs.c",line 134,column 1,is_stmt,isa 0
    1940 00000004 2803-         MOV       @_len_error_descriptor,#270 ; [CPU_ALU] |134| 
         00000005 010E 
    1941                      .dwpsn  file "../Term_defs.c",line 135,column 1,is_stmt,isa 0
    1942 00000006 56BF-         MOVB      @_len_mainsm_descriptor,#90,UNC ; [CPU_ALU] |135| 
         00000007 5A04 
    1943                      .dwpsn  file "../Term_defs.c",line 131,column 1,is_stmt,isa 0
    1944 00000008 28C4          MOV       *+XAR4[0],#420        ; [CPU_ALU] |131| 
         00000009 01A4 
    1945                      .dwpsn  file "../Term_defs.c",line 132,column 1,is_stmt,isa 0
    1946 0000000a 56BF          MOVB      *+XAR4[1],#20,UNC     ; [CPU_ALU] |132| 
         0000000b 14CC 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C4FAC29-1686-4DDF-BE2B-8424816DCE93} PAGE   38

    1947              $C$DW$43        .dwtag  DW_TAG_TI_branch
    1948                      .dwattr $C$DW$43, DW_AT_low_pc(0x00)
    1949                      .dwattr $C$DW$43, DW_AT_TI_return
    1950              
    1951 0000000c 0006          LRETR     ; [CPU_ALU] 
    1952                      ; return occurs ; [] 
    1953                      .dwattr $C$DW$42, DW_AT_TI_end_file("../Term_defs.c")
    1954                      .dwattr $C$DW$42, DW_AT_TI_end_line(0x89)
    1955                      .dwattr $C$DW$42, DW_AT_TI_end_column(0x01)
    1956                      .dwendentry
    1957                      .dwendtag $C$DW$42
    1958              
    1959              ;**************************************************************
    1960              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1961              ;**************************************************************
    1962                      .global _MUCI_RecorderLength
    1963                      .global _BackgndCounter
    1964                      .global _MUCI_RecorderParameter
    1965              
    1966              ;***************************************************************
    1967              ;* TYPE INFORMATION                                            *
    1968              ;***************************************************************
    1969              
    1970              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1971                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
    1972              $C$DW$44        .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$21)
    1974                      .dwattr $C$DW$44, DW_AT_name("val_addr")
    1975                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_val_addr")
    1976                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1978              
    1979              $C$DW$45        .dwtag  DW_TAG_member
    1980                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$20)
    1981                      .dwattr $C$DW$45, DW_AT_name("sampled_date")
    1982                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_sampled_date")
    1983                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1984                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1985              
    1986              $C$DW$46        .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
    1988                      .dwattr $C$DW$46, DW_AT_name("sampled_time")
    1989                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_sampled_time")
    1990                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1991                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1992              
    1993              $C$DW$47        .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
    1995                      .dwattr $C$DW$47, DW_AT_name("sample_time")
    1996                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_sample_time")
    1997                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1998                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1999              
    2000              $C$DW$48        .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C4FAC29-1686-4DDF-BE2B-8424816DCE93} PAGE   39

    2002                      .dwattr $C$DW$48, DW_AT_name("trig_level")
    2003                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_trig_level")
    2004                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2005                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    2006              
    2007              $C$DW$49        .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$25)
    2009                      .dwattr $C$DW$49, DW_AT_name("state")
    2010                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_state")
    2011                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2012                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    2013              
    2014              $C$DW$50        .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$25)
    2016                      .dwattr $C$DW$50, DW_AT_name("start_idx")
    2017                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_start_idx")
    2018                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2019                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$51        .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$25)
    2023                      .dwattr $C$DW$51, DW_AT_name("trigger_ch")
    2024                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_trigger_ch")
    2025                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2026                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    2027              
    2028              $C$DW$52        .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$25)
    2030                      .dwattr $C$DW$52, DW_AT_name("pretrigger")
    2031                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_pretrigger")
    2032                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2033                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    2034              
    2035              $C$DW$53        .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$25)
    2037                      .dwattr $C$DW$53, DW_AT_name("trig_slope")
    2038                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_trig_slope")
    2039                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2040                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    2041              
    2042              $C$DW$54        .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$25)
    2044                      .dwattr $C$DW$54, DW_AT_name("tnow")
    2045                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_tnow")
    2046                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2047                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    2048              
    2049              $C$DW$55        .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$25)
    2051                      .dwattr $C$DW$55, DW_AT_name("tlevel_type")
    2052                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_tlevel_type")
    2053                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2054                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    2055              
    2056              $C$DW$56        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C4FAC29-1686-4DDF-BE2B-8424816DCE93} PAGE   40

    2057                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$25)
    2058                      .dwattr $C$DW$56, DW_AT_name("idx")
    2059                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_idx")
    2060                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2061                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    2062              
    2063              $C$DW$57        .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
    2065                      .dwattr $C$DW$57, DW_AT_name("div")
    2066                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_div")
    2067                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2068                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    2069              
    2070              $C$DW$58        .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$23)
    2072                      .dwattr $C$DW$58, DW_AT_name("trig_ch_val_old")
    2073                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_trig_ch_val_old")
    2074                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2075                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    2076              
    2077              $C$DW$59        .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$23)
    2079                      .dwattr $C$DW$59, DW_AT_name("trig_ch_val")
    2080                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_trig_ch_val")
    2081                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2082                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    2083              
    2084              $C$DW$60        .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$25)
    2086                      .dwattr $C$DW$60, DW_AT_name("trig_delay")
    2087                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_trig_delay")
    2088                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2089                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    2090              
    2091              $C$DW$61        .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$25)
    2093                      .dwattr $C$DW$61, DW_AT_name("end_idx")
    2094                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_end_idx")
    2095                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2096                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098                      .dwendtag $C$DW$T$26
    2099              
    2100              $C$DW$T$33      .dwtag  DW_TAG_typedef
    2101                      .dwattr $C$DW$T$33, DW_AT_name("MUCI_RecorderParameter_t")
    2102                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$26)
    2103                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2104              
    2105              
    2106              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2107                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x14)
    2108              $C$DW$62        .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$29)
    2110                      .dwattr $C$DW$62, DW_AT_name("name")
    2111                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_name")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C4FAC29-1686-4DDF-BE2B-8424816DCE93} PAGE   41

    2112                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    2114              
    2115              $C$DW$63        .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$25)
    2117                      .dwattr $C$DW$63, DW_AT_name("unit")
    2118                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_unit")
    2119                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2120                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    2121              
    2122              $C$DW$64        .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$25)
    2124                      .dwattr $C$DW$64, DW_AT_name("type")
    2125                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_type")
    2126                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2127                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    2128              
    2129              $C$DW$65        .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
    2131                      .dwattr $C$DW$65, DW_AT_name("ptr")
    2132                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_ptr")
    2133                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2134                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    2135              
    2136              $C$DW$66        .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
    2138                      .dwattr $C$DW$66, DW_AT_name("pmax")
    2139                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_pmax")
    2140                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2141                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    2142              
    2143              $C$DW$67        .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    2145                      .dwattr $C$DW$67, DW_AT_name("pmin")
    2146                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_pmin")
    2147                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2148                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    2149              
    2150                      .dwendtag $C$DW$T$30
    2151              
    2152              $C$DW$T$35      .dwtag  DW_TAG_typedef
    2153                      .dwattr $C$DW$T$35, DW_AT_name("var_type")
    2154                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$30)
    2155                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2156              
    2157              $C$DW$68        .dwtag  DW_TAG_TI_far_type
    2158                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$35)
    2159              
    2160              $C$DW$T$36      .dwtag  DW_TAG_const_type
    2161                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$68)
    2162              
    2163              
    2164              $C$DW$T$37      .dwtag  DW_TAG_array_type
    2165                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2166                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C4FAC29-1686-4DDF-BE2B-8424816DCE93} PAGE   42

    2167                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x1a4)
    2168              $C$DW$69        .dwtag  DW_TAG_subrange_type
    2169                      .dwattr $C$DW$69, DW_AT_upper_bound(0x14)
    2170              
    2171                      .dwendtag $C$DW$T$37
    2172              
    2173              
    2174              $C$DW$T$38      .dwtag  DW_TAG_array_type
    2175                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$36)
    2176                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2177                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    2178              $C$DW$70        .dwtag  DW_TAG_subrange_type
    2179                      .dwattr $C$DW$70, DW_AT_upper_bound(0x00)
    2180              
    2181                      .dwendtag $C$DW$T$38
    2182              
    2183              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    2184                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    2185                      .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    2186              
    2187              
    2188              $C$DW$T$40      .dwtag  DW_TAG_array_type
    2189                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2190                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2191                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2192              $C$DW$71        .dwtag  DW_TAG_subrange_type
    2193                      .dwattr $C$DW$71, DW_AT_upper_bound(0x01)
    2194              
    2195                      .dwendtag $C$DW$T$40
    2196              
    2197              
    2198              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2199                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
    2200              $C$DW$72        .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$28)
    2202                      .dwattr $C$DW$72, DW_AT_name("desc_number")
    2203                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_desc_number")
    2204                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    2206              
    2207              $C$DW$73        .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$31)
    2209                      .dwattr $C$DW$73, DW_AT_name("desc_text")
    2210                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_desc_text")
    2211                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2212                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    2213              
    2214                      .dwendtag $C$DW$T$32
    2215              
    2216              $C$DW$T$41      .dwtag  DW_TAG_typedef
    2217                      .dwattr $C$DW$T$41, DW_AT_name("desc_type")
    2218                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$32)
    2219                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2220              
    2221              $C$DW$74        .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:54 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C4FAC29-1686-4DDF-BE2B-8424816DCE93} PAGE   43

    2222                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$41)
    2223              
    2224              $C$DW$T$42      .dwtag  DW_TAG_const_type
    2225                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$74)
    2226              
    2227              
    2228              $C$DW$T$43      .dwtag  DW_TAG_array_type
    2229                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2230                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2231                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x10e)
    2232              $C$DW$75        .dwtag  DW_TAG_subrange_type
    2233                      .dwattr $C$DW$75, DW_AT_upper_bound(0x0e)
    2234              
    2235                      .dwendtag $C$DW$T$43
    2236              
    2237              
    2238              $C$DW$T$45      .dwtag  DW_TAG_array_type
    2239                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$42)
    2240                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2241                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x5a)
    2242              $C$DW$76        .dwtag  DW_TAG_subrange_type
    2243                      .dwattr $C$DW$76, DW_AT_upper_bound(0x04)
    2244              
    2245                      .dwendtag $C$DW$T$45
    2246              
    2247              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2248                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2249              
    2250              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2251                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2252                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2253                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2254              
    2255              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2256                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2257                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2258                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2259              
    2260              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2261                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2262                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2263                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2264              
    2265              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2266                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2267                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2268                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2269              
    2270              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2271                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2272                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2273                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2274              
