TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{DAEEB130-A44D-41D5-9916-12FF67A44E23} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:56 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../device/driverlib/dma.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__error__")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___error__")

    1896                      .dwattr $C$DW$145, DW_AT_const_value(0x7e)
    1897              
    1898              $C$DW$146       .dwtag  DW_TAG_enumerator
    1899                      .dwattr $C$DW$146, DW_AT_name("DMA_TRIGGER_CLB1INT")
    1900                      .dwattr $C$DW$146, DW_AT_const_value(0x7f)
    1901              
    1902              $C$DW$147       .dwtag  DW_TAG_enumerator
    1903                      .dwattr $C$DW$147, DW_AT_name("DMA_TRIGGER_CLB2INT")
    1904                      .dwattr $C$DW$147, DW_AT_const_value(0x80)
    1905              
    1906              $C$DW$148       .dwtag  DW_TAG_enumerator
    1907                      .dwattr $C$DW$148, DW_AT_name("DMA_TRIGGER_CLB3INT")
    1908                      .dwattr $C$DW$148, DW_AT_const_value(0x81)
    1909              
    1910              $C$DW$149       .dwtag  DW_TAG_enumerator
    1911                      .dwattr $C$DW$149, DW_AT_name("DMA_TRIGGER_CLB4INT")
    1912                      .dwattr $C$DW$149, DW_AT_const_value(0x82)
    1913              
    1914              $C$DW$150       .dwtag  DW_TAG_enumerator
    1915                      .dwattr $C$DW$150, DW_AT_name("DMA_TRIGGER_CANAIF1")
    1916                      .dwattr $C$DW$150, DW_AT_const_value(0xa7)
    1917              
    1918              $C$DW$151       .dwtag  DW_TAG_enumerator
    1919                      .dwattr $C$DW$151, DW_AT_name("DMA_TRIGGER_CANAIF2")
    1920                      .dwattr $C$DW$151, DW_AT_const_value(0xa8)
    1921              
    1922              $C$DW$152       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{DAEEB130-A44D-41D5-9916-12FF67A44E23} PAGE   40

    1923                      .dwattr $C$DW$152, DW_AT_name("DMA_TRIGGER_CANAIF3")
    1924                      .dwattr $C$DW$152, DW_AT_const_value(0xa9)
    1925              
    1926              $C$DW$153       .dwtag  DW_TAG_enumerator
    1927                      .dwattr $C$DW$153, DW_AT_name("DMA_TRIGGER_HICA")
    1928                      .dwattr $C$DW$153, DW_AT_const_value(0xb3)
    1929              
    1930              $C$DW$154       .dwtag  DW_TAG_enumerator
    1931                      .dwattr $C$DW$154, DW_AT_name("DMA_TRIGGER_AESA_CONTEXTIN")
    1932                      .dwattr $C$DW$154, DW_AT_const_value(0xb4)
    1933              
    1934              $C$DW$155       .dwtag  DW_TAG_enumerator
    1935                      .dwattr $C$DW$155, DW_AT_name("DMA_TRIGGER_AESA_DATAIN")
    1936                      .dwattr $C$DW$155, DW_AT_const_value(0xb5)
    1937              
    1938              $C$DW$156       .dwtag  DW_TAG_enumerator
    1939                      .dwattr $C$DW$156, DW_AT_name("DMA_TRIGGER_AESA_CONTEXTOUT")
    1940                      .dwattr $C$DW$156, DW_AT_const_value(0xb6)
    1941              
    1942              $C$DW$157       .dwtag  DW_TAG_enumerator
    1943                      .dwattr $C$DW$157, DW_AT_name("DMA_TRIGGER_AESA_DATAOUT")
    1944                      .dwattr $C$DW$157, DW_AT_const_value(0xb7)
    1945              
    1946              $C$DW$158       .dwtag  DW_TAG_enumerator
    1947                      .dwattr $C$DW$158, DW_AT_name("DMA_TRIGGER_EPG1")
    1948                      .dwattr $C$DW$158, DW_AT_const_value(0xb8)
    1949              
    1950                      .dwendtag $C$DW$T$19
    1951              
    1952              $C$DW$T$20      .dwtag  DW_TAG_typedef
    1953                      .dwattr $C$DW$T$20, DW_AT_name("DMA_Trigger")
    1954                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    1955                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1956              
    1957              $C$DW$159       .dwtag  DW_TAG_TI_far_type
    1958                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    1959              
    1960              $C$DW$T$29      .dwtag  DW_TAG_const_type
    1961                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$159)
    1962              
    1963              
    1964              $C$DW$T$21      .dwtag  DW_TAG_enumeration_type
    1965                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1966              $C$DW$160       .dwtag  DW_TAG_enumerator
    1967                      .dwattr $C$DW$160, DW_AT_name("DMA_INT_AT_BEGINNING")
    1968                      .dwattr $C$DW$160, DW_AT_const_value(0x00)
    1969              
    1970              $C$DW$161       .dwtag  DW_TAG_enumerator
    1971                      .dwattr $C$DW$161, DW_AT_name("DMA_INT_AT_END")
    1972                      .dwattr $C$DW$161, DW_AT_const_value(0x01)
    1973              
    1974                      .dwendtag $C$DW$T$21
    1975              
    1976              $C$DW$T$22      .dwtag  DW_TAG_typedef
    1977                      .dwattr $C$DW$T$22, DW_AT_name("DMA_InterruptMode")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{DAEEB130-A44D-41D5-9916-12FF67A44E23} PAGE   41

    1978                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    1979                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1980              
    1981              
    1982              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1983                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1c)
    1984              $C$DW$162       .dwtag  DW_TAG_member
    1985                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1986                      .dwattr $C$DW$162, DW_AT_name("transferTrigger")
    1987                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_transferTrigger")
    1988                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1989                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1990              
    1991              $C$DW$163       .dwtag  DW_TAG_member
    1992                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
    1993                      .dwattr $C$DW$163, DW_AT_name("interruptMode")
    1994                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_interruptMode")
    1995                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1996                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1997              
    1998              $C$DW$164       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    2000                      .dwattr $C$DW$164, DW_AT_name("enableInterrupt")
    2001                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_enableInterrupt")
    2002                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2003                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2004              
    2005              $C$DW$165       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$25)
    2007                      .dwattr $C$DW$165, DW_AT_name("configSize")
    2008                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_configSize")
    2009                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2010                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$166       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$25)
    2014                      .dwattr $C$DW$166, DW_AT_name("transferMode")
    2015                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_transferMode")
    2016                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2017                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2018              
    2019              $C$DW$167       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$25)
    2021                      .dwattr $C$DW$167, DW_AT_name("reinitMode")
    2022                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_reinitMode")
    2023                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2024                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2025              
    2026              $C$DW$168       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$25)
    2028                      .dwattr $C$DW$168, DW_AT_name("burstSize")
    2029                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_burstSize")
    2030                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2031                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2032              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{DAEEB130-A44D-41D5-9916-12FF67A44E23} PAGE   42

    2033              $C$DW$169       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$25)
    2035                      .dwattr $C$DW$169, DW_AT_name("transferSize")
    2036                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_transferSize")
    2037                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2038                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2039              
    2040              $C$DW$170       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$25)
    2042                      .dwattr $C$DW$170, DW_AT_name("srcWrapSize")
    2043                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_srcWrapSize")
    2044                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2045                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2046              
    2047              $C$DW$171       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$25)
    2049                      .dwattr $C$DW$171, DW_AT_name("destWrapSize")
    2050                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_destWrapSize")
    2051                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2052                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2053              
    2054              $C$DW$172       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$25)
    2056                      .dwattr $C$DW$172, DW_AT_name("destAddr")
    2057                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_destAddr")
    2058                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2059                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2060              
    2061              $C$DW$173       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$25)
    2063                      .dwattr $C$DW$173, DW_AT_name("srcAddr")
    2064                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_srcAddr")
    2065                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2066                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2067              
    2068              $C$DW$174       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$27)
    2070                      .dwattr $C$DW$174, DW_AT_name("srcBurstStep")
    2071                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_srcBurstStep")
    2072                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2073                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2074              
    2075              $C$DW$175       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$27)
    2077                      .dwattr $C$DW$175, DW_AT_name("destBurstStep")
    2078                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_destBurstStep")
    2079                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2080                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2081              
    2082              $C$DW$176       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    2084                      .dwattr $C$DW$176, DW_AT_name("srcTransferStep")
    2085                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_srcTransferStep")
    2086                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2087                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{DAEEB130-A44D-41D5-9916-12FF67A44E23} PAGE   43

    2088              
    2089              $C$DW$177       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    2091                      .dwattr $C$DW$177, DW_AT_name("destTransferStep")
    2092                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_destTransferStep")
    2093                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2094                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2095              
    2096              $C$DW$178       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    2098                      .dwattr $C$DW$178, DW_AT_name("srcWrapStep")
    2099                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_srcWrapStep")
    2100                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2101                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2102              
    2103              $C$DW$179       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$27)
    2105                      .dwattr $C$DW$179, DW_AT_name("destWrapStep")
    2106                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_destWrapStep")
    2107                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2108                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110                      .dwendtag $C$DW$T$28
    2111              
    2112              $C$DW$T$33      .dwtag  DW_TAG_typedef
    2113                      .dwattr $C$DW$T$33, DW_AT_name("DMA_ConfigParams")
    2114                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$28)
    2115                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2116              
    2117              $C$DW$180       .dwtag  DW_TAG_TI_far_type
    2118                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$33)
    2119              
    2120              $C$DW$T$34      .dwtag  DW_TAG_const_type
    2121                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$180)
    2122              
    2123              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2124                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2125                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    2126              
    2127              $C$DW$181       .dwtag  DW_TAG_TI_far_type
    2128                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$35)
    2129              
    2130              $C$DW$T$36      .dwtag  DW_TAG_const_type
    2131                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$181)
    2132              
    2133              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2134                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2135              
    2136              $C$DW$182       .dwtag  DW_TAG_TI_far_type
    2137                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$2)
    2138              
    2139              $C$DW$T$45      .dwtag  DW_TAG_const_type
    2140                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$182)
    2141              
    2142              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{DAEEB130-A44D-41D5-9916-12FF67A44E23} PAGE   44

    2143                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2144                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    2145              
    2146              $C$DW$183       .dwtag  DW_TAG_TI_far_type
    2147                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$46)
    2148              
    2149              $C$DW$T$47      .dwtag  DW_TAG_const_type
    2150                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$183)
    2151              
    2152              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2153                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2154                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2155                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2156              
    2157              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2158                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2159                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2160                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2161              
    2162              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2163                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2164                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2165                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2166              
    2167              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2168                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2169                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2170                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2171              
