TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FF3B037A-87FB-4E37-8A05-A230264B4C77} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:56 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../device/driverlib/epwm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__error__")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___error__")

    1824              $C$DW$T$37      .dwtag  DW_TAG_const_type
    1825                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$107)
    1826              
    1827              
    1828              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1829                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1830              $C$DW$108       .dwtag  DW_TAG_enumerator
    1831                      .dwattr $C$DW$108, DW_AT_name("EPWM_AQ_OUTPUT_ON_TIMEBASE_ZERO")
    1832                      .dwattr $C$DW$108, DW_AT_const_value(0x00)
    1833              
    1834              $C$DW$109       .dwtag  DW_TAG_enumerator
    1835                      .dwattr $C$DW$109, DW_AT_name("EPWM_AQ_OUTPUT_ON_TIMEBASE_PERIOD")
    1836                      .dwattr $C$DW$109, DW_AT_const_value(0x02)
    1837              
    1838              $C$DW$110       .dwtag  DW_TAG_enumerator
    1839                      .dwattr $C$DW$110, DW_AT_name("EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPA")
    1840                      .dwattr $C$DW$110, DW_AT_const_value(0x04)
    1841              
    1842              $C$DW$111       .dwtag  DW_TAG_enumerator
    1843                      .dwattr $C$DW$111, DW_AT_name("EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPA")
    1844                      .dwattr $C$DW$111, DW_AT_const_value(0x06)
    1845              
    1846              $C$DW$112       .dwtag  DW_TAG_enumerator
    1847                      .dwattr $C$DW$112, DW_AT_name("EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPB")
    1848                      .dwattr $C$DW$112, DW_AT_const_value(0x08)
    1849              
    1850              $C$DW$113       .dwtag  DW_TAG_enumerator
    1851                      .dwattr $C$DW$113, DW_AT_name("EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPB")
    1852                      .dwattr $C$DW$113, DW_AT_const_value(0x0a)
    1853              
    1854              $C$DW$114       .dwtag  DW_TAG_enumerator
    1855                      .dwattr $C$DW$114, DW_AT_name("EPWM_AQ_OUTPUT_ON_T1_COUNT_UP")
    1856                      .dwattr $C$DW$114, DW_AT_const_value(0x01)
    1857              
    1858              $C$DW$115       .dwtag  DW_TAG_enumerator
    1859                      .dwattr $C$DW$115, DW_AT_name("EPWM_AQ_OUTPUT_ON_T1_COUNT_DOWN")
    1860                      .dwattr $C$DW$115, DW_AT_const_value(0x03)
    1861              
    1862              $C$DW$116       .dwtag  DW_TAG_enumerator
    1863                      .dwattr $C$DW$116, DW_AT_name("EPWM_AQ_OUTPUT_ON_T2_COUNT_UP")
    1864                      .dwattr $C$DW$116, DW_AT_const_value(0x05)
    1865              
    1866              $C$DW$117       .dwtag  DW_TAG_enumerator
    1867                      .dwattr $C$DW$117, DW_AT_name("EPWM_AQ_OUTPUT_ON_T2_COUNT_DOWN")
    1868                      .dwattr $C$DW$117, DW_AT_const_value(0x07)
    1869              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FF3B037A-87FB-4E37-8A05-A230264B4C77} PAGE   40

    1870                      .dwendtag $C$DW$T$38
    1871              
    1872              $C$DW$T$39      .dwtag  DW_TAG_typedef
    1873                      .dwattr $C$DW$T$39, DW_AT_name("EPWM_ActionQualifierOutputEvent")
    1874                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1875                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1876              
    1877              $C$DW$118       .dwtag  DW_TAG_TI_far_type
    1878                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$39)
    1879              
    1880              $C$DW$T$40      .dwtag  DW_TAG_const_type
    1881                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$118)
    1882              
    1883              
    1884              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1885                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1886              $C$DW$119       .dwtag  DW_TAG_enumerator
    1887                      .dwattr $C$DW$119, DW_AT_name("EPWM_EMULATION_STOP_AFTER_NEXT_TB")
    1888                      .dwattr $C$DW$119, DW_AT_const_value(0x00)
    1889              
    1890              $C$DW$120       .dwtag  DW_TAG_enumerator
    1891                      .dwattr $C$DW$120, DW_AT_name("EPWM_EMULATION_STOP_AFTER_FULL_CYCLE")
    1892                      .dwattr $C$DW$120, DW_AT_const_value(0x01)
    1893              
    1894              $C$DW$121       .dwtag  DW_TAG_enumerator
    1895                      .dwattr $C$DW$121, DW_AT_name("EPWM_EMULATION_FREE_RUN")
    1896                      .dwattr $C$DW$121, DW_AT_const_value(0x02)
    1897              
    1898                      .dwendtag $C$DW$T$41
    1899              
    1900              $C$DW$T$42      .dwtag  DW_TAG_typedef
    1901                      .dwattr $C$DW$T$42, DW_AT_name("EPWM_EmulationMode")
    1902                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1903                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1904              
    1905              $C$DW$122       .dwtag  DW_TAG_TI_far_type
    1906                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$42)
    1907              
    1908              $C$DW$T$43      .dwtag  DW_TAG_const_type
    1909                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$122)
    1910              
    1911              
    1912              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1913                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    1914              $C$DW$123       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1916                      .dwattr $C$DW$123, DW_AT_name("freqInHz")
    1917                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_freqInHz")
    1918                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1920              
    1921              $C$DW$124       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1923                      .dwattr $C$DW$124, DW_AT_name("dutyValA")
    1924                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_dutyValA")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FF3B037A-87FB-4E37-8A05-A230264B4C77} PAGE   41

    1925                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1926                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1927              
    1928              $C$DW$125       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1930                      .dwattr $C$DW$125, DW_AT_name("dutyValB")
    1931                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_dutyValB")
    1932                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1933                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1934              
    1935              $C$DW$126       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1937                      .dwattr $C$DW$126, DW_AT_name("invertSignalB")
    1938                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_invertSignalB")
    1939                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1940                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1941              
    1942              $C$DW$127       .dwtag  DW_TAG_member
    1943                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1944                      .dwattr $C$DW$127, DW_AT_name("sysClkInHz")
    1945                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_sysClkInHz")
    1946                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1947                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$128       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$22)
    1951                      .dwattr $C$DW$128, DW_AT_name("tbCtrMode")
    1952                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_tbCtrMode")
    1953                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1954                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1955              
    1956              $C$DW$129       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$24)
    1958                      .dwattr $C$DW$129, DW_AT_name("tbClkDiv")
    1959                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_tbClkDiv")
    1960                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1961                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1962              
    1963              $C$DW$130       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$26)
    1965                      .dwattr $C$DW$130, DW_AT_name("tbHSClkDiv")
    1966                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_tbHSClkDiv")
    1967                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1968                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1969              
    1970                      .dwendtag $C$DW$T$27
    1971              
    1972              $C$DW$T$47      .dwtag  DW_TAG_typedef
    1973                      .dwattr $C$DW$T$47, DW_AT_name("EPWM_SignalParams")
    1974                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$27)
    1975                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1976              
    1977              $C$DW$131       .dwtag  DW_TAG_TI_far_type
    1978                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$47)
    1979              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{FF3B037A-87FB-4E37-8A05-A230264B4C77} PAGE   42

    1980              $C$DW$T$48      .dwtag  DW_TAG_const_type
    1981                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$131)
    1982              
    1983              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    1984                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1985                      .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    1986              
    1987              $C$DW$132       .dwtag  DW_TAG_TI_far_type
    1988                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$49)
    1989              
    1990              $C$DW$T$50      .dwtag  DW_TAG_const_type
    1991                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$132)
    1992              
    1993              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1994                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1995              
    1996              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1997                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1998                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1999                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2000              
    2001              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2002                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2003                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2004                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2005              
    2006              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2007                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2008                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2009                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2010              
    2011              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2012                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2013                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2014                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2015              
    2016              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2017                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2018                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2019                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2020              
    2021              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2022                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2023                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2024                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2025              
    2026              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2027                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2028                      .dwattr $C$DW$T$10, DW_AT_name("int")
