TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E0E47400-FEB3-4EB3-B16A-1753E3822A5D} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:56 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../device/driverlib/erad.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__error__")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___error__")

    3070                      .dwattr $C$DW$250, DW_AT_const_value(0x00)
    3071              
    3072              $C$DW$251       .dwtag  DW_TAG_enumerator
    3073                      .dwattr $C$DW$251, DW_AT_name("ERAD_OWNER_APPLICATION")
    3074                      .dwattr $C$DW$251, DW_AT_const_value(0x01)
    3075              
    3076              $C$DW$252       .dwtag  DW_TAG_enumerator
    3077                      .dwattr $C$DW$252, DW_AT_name("ERAD_OWNER_DEBUGGER")
    3078                      .dwattr $C$DW$252, DW_AT_const_value(0x02)
    3079              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E0E47400-FEB3-4EB3-B16A-1753E3822A5D} PAGE   62

    3080                      .dwendtag $C$DW$T$38
    3081              
    3082              $C$DW$T$39      .dwtag  DW_TAG_typedef
    3083                      .dwattr $C$DW$T$39, DW_AT_name("ERAD_Owner")
    3084                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3085                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3086              
    3087              
    3088              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    3089                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3090              $C$DW$253       .dwtag  DW_TAG_enumerator
    3091                      .dwattr $C$DW$253, DW_AT_name("ERAD_STATE_IDLE")
    3092                      .dwattr $C$DW$253, DW_AT_const_value(0x00)
    3093              
    3094              $C$DW$254       .dwtag  DW_TAG_enumerator
    3095                      .dwattr $C$DW$254, DW_AT_name("ERAD_STATE_ENABLED")
    3096                      .dwattr $C$DW$254, DW_AT_const_value(0x02)
    3097              
    3098              $C$DW$255       .dwtag  DW_TAG_enumerator
    3099                      .dwattr $C$DW$255, DW_AT_name("ERAD_STATE_COMPLETED")
    3100                      .dwattr $C$DW$255, DW_AT_const_value(0x03)
    3101              
    3102                      .dwendtag $C$DW$T$41
    3103              
    3104              $C$DW$T$42      .dwtag  DW_TAG_typedef
    3105                      .dwattr $C$DW$T$42, DW_AT_name("ERAD_Status")
    3106                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3107                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3108              
    3109              
    3110              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
    3111                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    3112              $C$DW$256       .dwtag  DW_TAG_enumerator
    3113                      .dwattr $C$DW$256, DW_AT_name("ERAD_AND_MASK1")
    3114                      .dwattr $C$DW$256, DW_AT_const_value(0x00)
    3115              
    3116              $C$DW$257       .dwtag  DW_TAG_enumerator
    3117                      .dwattr $C$DW$257, DW_AT_name("ERAD_AND_MASK2")
    3118                      .dwattr $C$DW$257, DW_AT_const_value(0x01)
    3119              
    3120              $C$DW$258       .dwtag  DW_TAG_enumerator
    3121                      .dwattr $C$DW$258, DW_AT_name("ERAD_AND_MASK3")
    3122                      .dwattr $C$DW$258, DW_AT_const_value(0x02)
    3123              
    3124              $C$DW$259       .dwtag  DW_TAG_enumerator
    3125                      .dwattr $C$DW$259, DW_AT_name("ERAD_AND_MASK4")
    3126                      .dwattr $C$DW$259, DW_AT_const_value(0x03)
    3127              
    3128              $C$DW$260       .dwtag  DW_TAG_enumerator
    3129                      .dwattr $C$DW$260, DW_AT_name("ERAD_OR_MASK1")
    3130                      .dwattr $C$DW$260, DW_AT_const_value(0x04)
    3131              
    3132              $C$DW$261       .dwtag  DW_TAG_enumerator
    3133                      .dwattr $C$DW$261, DW_AT_name("ERAD_OR_MASK2")
    3134                      .dwattr $C$DW$261, DW_AT_const_value(0x05)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E0E47400-FEB3-4EB3-B16A-1753E3822A5D} PAGE   63

    3135              
    3136              $C$DW$262       .dwtag  DW_TAG_enumerator
    3137                      .dwattr $C$DW$262, DW_AT_name("ERAD_OR_MASK3")
    3138                      .dwattr $C$DW$262, DW_AT_const_value(0x06)
    3139              
    3140              $C$DW$263       .dwtag  DW_TAG_enumerator
    3141                      .dwattr $C$DW$263, DW_AT_name("ERAD_OR_MASK4")
    3142                      .dwattr $C$DW$263, DW_AT_const_value(0x07)
    3143              
    3144                      .dwendtag $C$DW$T$44
    3145              
    3146              $C$DW$T$45      .dwtag  DW_TAG_typedef
    3147                      .dwattr $C$DW$T$45, DW_AT_name("ERAD_Mask")
    3148                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3149                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3150              
    3151              $C$DW$264       .dwtag  DW_TAG_TI_far_type
    3152                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$45)
    3153              
    3154              $C$DW$T$46      .dwtag  DW_TAG_const_type
    3155                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$264)
    3156              
    3157              
    3158              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3159                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    3160              $C$DW$265       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    3162                      .dwattr $C$DW$265, DW_AT_name("mask")
    3163                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_mask")
    3164                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3165                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3166              
    3167              $C$DW$266       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    3169                      .dwattr $C$DW$266, DW_AT_name("reference")
    3170                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_reference")
    3171                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3172                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3173              
    3174              $C$DW$267       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$22)
    3176                      .dwattr $C$DW$267, DW_AT_name("comp_mode")
    3177                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_comp_mode")
    3178                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3179                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3180              
    3181              $C$DW$268       .dwtag  DW_TAG_member
    3182                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$23)
    3183                      .dwattr $C$DW$268, DW_AT_name("enable_int")
    3184                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_enable_int")
    3185                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3186                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3187              
    3188              $C$DW$269       .dwtag  DW_TAG_member
    3189                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E0E47400-FEB3-4EB3-B16A-1753E3822A5D} PAGE   64

    3190                      .dwattr $C$DW$269, DW_AT_name("enable_stop")
    3191                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_enable_stop")
    3192                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3193                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3194              
    3195              $C$DW$270       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$25)
    3197                      .dwattr $C$DW$270, DW_AT_name("bus_sel")
    3198                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_bus_sel")
    3199                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3200                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3201              
    3202                      .dwendtag $C$DW$T$26
    3203              
    3204              $C$DW$T$47      .dwtag  DW_TAG_typedef
    3205                      .dwattr $C$DW$T$47, DW_AT_name("ERAD_BusComp_Config")
    3206                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$26)
    3207                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3208              
    3209              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    3210                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3211                      .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    3212              
    3213              $C$DW$271       .dwtag  DW_TAG_TI_far_type
    3214                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$48)
    3215              
    3216              $C$DW$T$49      .dwtag  DW_TAG_const_type
    3217                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$271)
    3218              
    3219              
    3220              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3221                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    3222              $C$DW$272       .dwtag  DW_TAG_member
    3223                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$28)
    3224                      .dwattr $C$DW$272, DW_AT_name("event")
    3225                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_event")
    3226                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3227                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3228              
    3229              $C$DW$273       .dwtag  DW_TAG_member
    3230                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$30)
    3231                      .dwattr $C$DW$273, DW_AT_name("event_mode")
    3232                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_event_mode")
    3233                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3234                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3235              
    3236              $C$DW$274       .dwtag  DW_TAG_member
    3237                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    3238                      .dwattr $C$DW$274, DW_AT_name("reference")
    3239                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_reference")
    3240                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3241                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3242              
    3243              $C$DW$275       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E0E47400-FEB3-4EB3-B16A-1753E3822A5D} PAGE   65

    3245                      .dwattr $C$DW$275, DW_AT_name("rst_on_match")
    3246                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_rst_on_match")
    3247                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3248                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3249              
    3250              $C$DW$276       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$23)
    3252                      .dwattr $C$DW$276, DW_AT_name("enable_int")
    3253                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_enable_int")
    3254                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3255                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3256              
    3257              $C$DW$277       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$23)
    3259                      .dwattr $C$DW$277, DW_AT_name("enable_stop")
    3260                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_enable_stop")
    3261                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3262                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3263              
    3264                      .dwendtag $C$DW$T$31
    3265              
    3266              $C$DW$T$52      .dwtag  DW_TAG_typedef
    3267                      .dwattr $C$DW$T$52, DW_AT_name("ERAD_Counter_Config")
    3268                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$31)
    3269                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3270              
    3271              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    3272                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    3273                      .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    3274              
    3275              $C$DW$278       .dwtag  DW_TAG_TI_far_type
    3276                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$53)
    3277              
    3278              $C$DW$T$54      .dwtag  DW_TAG_const_type
    3279                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$278)
    3280              
    3281              
    3282              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3283                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0c)
    3284              $C$DW$279       .dwtag  DW_TAG_member
    3285                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    3286                      .dwattr $C$DW$279, DW_AT_name("start_address")
    3287                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_start_address")
    3288                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3289                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3290              
    3291              $C$DW$280       .dwtag  DW_TAG_member
    3292                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    3293                      .dwattr $C$DW$280, DW_AT_name("end_address")
    3294                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_end_address")
    3295                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3296                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3297              
    3298              $C$DW$281       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E0E47400-FEB3-4EB3-B16A-1753E3822A5D} PAGE   66

    3300                      .dwattr $C$DW$281, DW_AT_name("bus_sel")
    3301                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_bus_sel")
    3302                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3303                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3304              
    3305              $C$DW$282       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    3307                      .dwattr $C$DW$282, DW_AT_name("busComp_base1")
    3308                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_busComp_base1")
    3309                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3310                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3311              
    3312              $C$DW$283       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    3314                      .dwattr $C$DW$283, DW_AT_name("busComp_base2")
    3315                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_busComp_base2")
    3316                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3317                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3318              
    3319              $C$DW$284       .dwtag  DW_TAG_member
    3320                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    3321                      .dwattr $C$DW$284, DW_AT_name("counter_base")
    3322                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_counter_base")
    3323                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3324                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3325              
    3326                      .dwendtag $C$DW$T$32
    3327              
    3328              $C$DW$T$57      .dwtag  DW_TAG_typedef
    3329                      .dwattr $C$DW$T$57, DW_AT_name("ERAD_Profile_Params")
    3330                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$32)
    3331                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3332              
    3333              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    3334                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3335                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    3336              
    3337              $C$DW$285       .dwtag  DW_TAG_TI_far_type
    3338                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$58)
    3339              
    3340              $C$DW$T$59      .dwtag  DW_TAG_const_type
    3341                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$285)
    3342              
    3343              
    3344              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3345                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    3346              $C$DW$286       .dwtag  DW_TAG_member
    3347                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    3348                      .dwattr $C$DW$286, DW_AT_name("address")
    3349                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_address")
    3350                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3351                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3352              
    3353              $C$DW$287       .dwtag  DW_TAG_member
    3354                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E0E47400-FEB3-4EB3-B16A-1753E3822A5D} PAGE   67

    3355                      .dwattr $C$DW$287, DW_AT_name("mask")
    3356                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_mask")
    3357                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3358                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3359              
    3360              $C$DW$288       .dwtag  DW_TAG_member
    3361                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$25)
    3362                      .dwattr $C$DW$288, DW_AT_name("bus_sel")
    3363                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_bus_sel")
    3364                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3365                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3366              
    3367                      .dwendtag $C$DW$T$33
    3368              
    3369              $C$DW$T$62      .dwtag  DW_TAG_typedef
    3370                      .dwattr $C$DW$T$62, DW_AT_name("ERAD_AddressHit_Params")
    3371                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$33)
    3372                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3373              
    3374              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    3375                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3376                      .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    3377              
    3378              $C$DW$289       .dwtag  DW_TAG_TI_far_type
    3379                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$63)
    3380              
    3381              $C$DW$T$64      .dwtag  DW_TAG_const_type
    3382                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$289)
    3383              
    3384              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3385                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3386              
    3387              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3388                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3389                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3390                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3391              
    3392              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3393                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3394                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3395                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3396              
    3397              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3398                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3399                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3400                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3401              
    3402              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3403                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3404                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3405                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3406              
    3407              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3408                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3409                      .dwattr $C$DW$T$8, DW_AT_name("short")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:56 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{E0E47400-FEB3-4EB3-B16A-1753E3822A5D} PAGE   68

    3410                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3411              
    3412              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3413                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3414                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3415                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3416              
    3417              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3418                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3419                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3420                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3421              
    3422              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3423                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3424                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
