TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Wed May 21 09:51:57 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../device/driverlib/mcan.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Daniel\CodeComposer\UPS_MUCI\CPU1_FLASH")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

   13366                      ; branch occurs ; [] |1553| 
   13367 00000018       $C$L179:    
   13368                      .dwpsn  file "..\device\driverlib\inc/hw_types_mcan.h",line 424,column 21,is_stmt,isa 0
   13369 00000018 8D00          MOVL      XAR0,#17944           ; [CPU_ALU] |424| 
         00000019 4618 
   13370 0000001a 0691          MOVL      ACC,*+XAR1[AR0]       ; [CPU_ALU] |424| 
   13371                      .dwpsn  file "..\device\driverlib\inc/hw_types_mcan.h",line 430,column 5,is_stmt,isa 0
   13372 0000001b 5010          ORB       AL,#0x10              ; [CPU_ALU] |430| 
   13373 0000001c       $C$L180:    
   13374 0000001c 1E91          MOVL      *+XAR1[AR0],ACC       ; [CPU_ALU] |430| 
   13375 0000001d 86BE          MOVL      XAR2,*--SP            ; [CPU_ALU] 
   13376                      .dwcfi  cfa_offset, -4
   13377                      .dwcfi  restore_reg, 9
   13378 0000001e 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
   13379                      .dwcfi  cfa_offset, -2
   13380                      .dwcfi  restore_reg, 7
   13381              $C$DW$795       .dwtag  DW_TAG_TI_branch
   13382                      .dwattr $C$DW$795, DW_AT_low_pc(0x00)
   13383                      .dwattr $C$DW$795, DW_AT_TI_return
   13384              
   13385 0000001f 0006          LRETR     ; [CPU_ALU] 
   13386                      ; return occurs ; [] 
   13387                      .dwattr $C$DW$787, DW_AT_TI_end_file("../device/driverlib/mcan.c")
   13388                      .dwattr $C$DW$787, DW_AT_TI_end_line(0x613)
   13389                      .dwattr $C$DW$787, DW_AT_TI_end_column(0x01)
   13390                      .dwendentry
   13391                      .dwendtag $C$DW$787
   13392              
   13393              ;***************************************************************
   13394              ;* FAR STRINGS                                                 *
   13395              ;***************************************************************
   13396 00000000               .sect   ".econst:.string"
   13397                      .align  2
   13398 00000000 002E  $C$FSL1:        .string "../device/driverlib/mcan.c",0
         00000001 002E 
         00000002 002F 
         00000003 0064 
         00000004 0065 
         00000005 0076 
         00000006 0069 
         00000007 0063 
         00000008 0065 
         00000009 002F 
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  259

         0000000a 0064 
         0000000b 0072 
         0000000c 0069 
         0000000d 0076 
         0000000e 0065 
         0000000f 0072 
         00000010 006C 
         00000011 0069 
         00000012 0062 
         00000013 002F 
         00000014 006D 
         00000015 0063 
         00000016 0061 
         00000017 006E 
         00000018 002E 
         00000019 0063 
         0000001a 0000 
   13399              ;**************************************************************
   13400              ;* UNDEFINED EXTERNAL REFERENCES                              *
   13401              ;**************************************************************
   13402                      .global ___error__
   13403              
   13404              ;***************************************************************
   13405              ;* TYPE INFORMATION                                            *
   13406              ;***************************************************************
   13407              
   13408              $C$DW$T$50      .dwtag  DW_TAG_enumeration_type
   13409                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
   13410              $C$DW$796       .dwtag  DW_TAG_enumerator
   13411                      .dwattr $C$DW$796, DW_AT_name("MCAN_CLOCK_SOURCE_SYS")
   13412                      .dwattr $C$DW$796, DW_AT_const_value(0x00)
   13413              
   13414              $C$DW$797       .dwtag  DW_TAG_enumerator
   13415                      .dwattr $C$DW$797, DW_AT_name("MCAN_CLOCK_SOURCE_AUXIN")
   13416                      .dwattr $C$DW$797, DW_AT_const_value(0x02)
   13417              
   13418              $C$DW$798       .dwtag  DW_TAG_enumerator
   13419                      .dwattr $C$DW$798, DW_AT_name("MCAN_CLOCK_SOURCE_PLLRAW")
   13420                      .dwattr $C$DW$798, DW_AT_const_value(0x03)
   13421              
   13422                      .dwendtag $C$DW$T$50
   13423              
   13424              $C$DW$T$51      .dwtag  DW_TAG_typedef
   13425                      .dwattr $C$DW$T$51, DW_AT_name("MCAN_ClockSource")
   13426                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   13427                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   13428              
   13429              $C$DW$799       .dwtag  DW_TAG_TI_far_type
   13430                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$51)
   13431              
   13432              $C$DW$T$52      .dwtag  DW_TAG_const_type
   13433                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$799)
   13434              
   13435              
   13436              $C$DW$T$21      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  260

   13437                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
   13438              $C$DW$800       .dwtag  DW_TAG_member
   13439                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$20)
   13440                      .dwattr $C$DW$800, DW_AT_name("tdcf")
   13441                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_tdcf")
   13442                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13443                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
   13444              
   13445              $C$DW$801       .dwtag  DW_TAG_member
   13446                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$20)
   13447                      .dwattr $C$DW$801, DW_AT_name("tdco")
   13448                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_tdco")
   13449                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13450                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
   13451              
   13452                      .dwendtag $C$DW$T$21
   13453              
   13454              $C$DW$T$22      .dwtag  DW_TAG_typedef
   13455                      .dwattr $C$DW$T$22, DW_AT_name("MCAN_TDCConfig")
   13456                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
   13457                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
   13458              
   13459              
   13460              $C$DW$T$23      .dwtag  DW_TAG_structure_type
   13461                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1a)
   13462              $C$DW$802       .dwtag  DW_TAG_member
   13463                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
   13464                      .dwattr $C$DW$802, DW_AT_name("fdMode")
   13465                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_fdMode")
   13466                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13467                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
   13468              
   13469              $C$DW$803       .dwtag  DW_TAG_member
   13470                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$20)
   13471                      .dwattr $C$DW$803, DW_AT_name("brsEnable")
   13472                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_brsEnable")
   13473                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13474                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
   13475              
   13476              $C$DW$804       .dwtag  DW_TAG_member
   13477                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$20)
   13478                      .dwattr $C$DW$804, DW_AT_name("txpEnable")
   13479                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_txpEnable")
   13480                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13481                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
   13482              
   13483              $C$DW$805       .dwtag  DW_TAG_member
   13484                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$20)
   13485                      .dwattr $C$DW$805, DW_AT_name("efbi")
   13486                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_efbi")
   13487                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13488                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
   13489              
   13490              $C$DW$806       .dwtag  DW_TAG_member
   13491                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  261

   13492                      .dwattr $C$DW$806, DW_AT_name("pxhddisable")
   13493                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_pxhddisable")
   13494                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13495                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
   13496              
   13497              $C$DW$807       .dwtag  DW_TAG_member
   13498                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$20)
   13499                      .dwattr $C$DW$807, DW_AT_name("darEnable")
   13500                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_darEnable")
   13501                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13502                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
   13503              
   13504              $C$DW$808       .dwtag  DW_TAG_member
   13505                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$20)
   13506                      .dwattr $C$DW$808, DW_AT_name("wkupReqEnable")
   13507                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_wkupReqEnable")
   13508                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13509                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
   13510              
   13511              $C$DW$809       .dwtag  DW_TAG_member
   13512                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$20)
   13513                      .dwattr $C$DW$809, DW_AT_name("autoWkupEnable")
   13514                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_autoWkupEnable")
   13515                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13516                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
   13517              
   13518              $C$DW$810       .dwtag  DW_TAG_member
   13519                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$20)
   13520                      .dwattr $C$DW$810, DW_AT_name("emulationEnable")
   13521                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_emulationEnable")
   13522                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13523                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
   13524              
   13525              $C$DW$811       .dwtag  DW_TAG_member
   13526                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
   13527                      .dwattr $C$DW$811, DW_AT_name("wdcPreload")
   13528                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_wdcPreload")
   13529                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13530                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
   13531              
   13532              $C$DW$812       .dwtag  DW_TAG_member
   13533                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$22)
   13534                      .dwattr $C$DW$812, DW_AT_name("tdcConfig")
   13535                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_tdcConfig")
   13536                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13537                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
   13538              
   13539              $C$DW$813       .dwtag  DW_TAG_member
   13540                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$20)
   13541                      .dwattr $C$DW$813, DW_AT_name("tdcEnable")
   13542                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_tdcEnable")
   13543                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13544                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
   13545              
   13546                      .dwendtag $C$DW$T$23
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  262

   13547              
   13548              $C$DW$T$57      .dwtag  DW_TAG_typedef
   13549                      .dwattr $C$DW$T$57, DW_AT_name("MCAN_InitParams")
   13550                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$23)
   13551                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   13552              
   13553              $C$DW$814       .dwtag  DW_TAG_TI_far_type
   13554                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$57)
   13555              
   13556              $C$DW$T$58      .dwtag  DW_TAG_const_type
   13557                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$814)
   13558              
   13559              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
   13560                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   13561                      .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
   13562              
   13563              $C$DW$815       .dwtag  DW_TAG_TI_far_type
   13564                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$59)
   13565              
   13566              $C$DW$T$60      .dwtag  DW_TAG_const_type
   13567                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$815)
   13568              
   13569              
   13570              $C$DW$T$24      .dwtag  DW_TAG_structure_type
   13571                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
   13572              $C$DW$816       .dwtag  DW_TAG_member
   13573                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$20)
   13574                      .dwattr $C$DW$816, DW_AT_name("rrfe")
   13575                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_rrfe")
   13576                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13577                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
   13578              
   13579              $C$DW$817       .dwtag  DW_TAG_member
   13580                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$20)
   13581                      .dwattr $C$DW$817, DW_AT_name("rrfs")
   13582                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_rrfs")
   13583                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13584                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
   13585              
   13586              $C$DW$818       .dwtag  DW_TAG_member
   13587                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$20)
   13588                      .dwattr $C$DW$818, DW_AT_name("anfe")
   13589                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_anfe")
   13590                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13591                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
   13592              
   13593              $C$DW$819       .dwtag  DW_TAG_member
   13594                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$20)
   13595                      .dwattr $C$DW$819, DW_AT_name("anfs")
   13596                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_anfs")
   13597                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13598                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
   13599              
   13600                      .dwendtag $C$DW$T$24
   13601              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  263

   13602              $C$DW$T$25      .dwtag  DW_TAG_typedef
   13603                      .dwattr $C$DW$T$25, DW_AT_name("MCAN_GlobalFiltConfig")
   13604                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
   13605                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
   13606              
   13607              
   13608              $C$DW$T$26      .dwtag  DW_TAG_structure_type
   13609                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x16)
   13610              $C$DW$820       .dwtag  DW_TAG_member
   13611                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$20)
   13612                      .dwattr $C$DW$820, DW_AT_name("monEnable")
   13613                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_monEnable")
   13614                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13615                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
   13616              
   13617              $C$DW$821       .dwtag  DW_TAG_member
   13618                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$20)
   13619                      .dwattr $C$DW$821, DW_AT_name("asmEnable")
   13620                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_asmEnable")
   13621                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13622                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
   13623              
   13624              $C$DW$822       .dwtag  DW_TAG_member
   13625                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$20)
   13626                      .dwattr $C$DW$822, DW_AT_name("tsPrescalar")
   13627                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_tsPrescalar")
   13628                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13629                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
   13630              
   13631              $C$DW$823       .dwtag  DW_TAG_member
   13632                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$20)
   13633                      .dwattr $C$DW$823, DW_AT_name("tsSelect")
   13634                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_tsSelect")
   13635                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13636                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
   13637              
   13638              $C$DW$824       .dwtag  DW_TAG_member
   13639                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$20)
   13640                      .dwattr $C$DW$824, DW_AT_name("timeoutSelect")
   13641                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_timeoutSelect")
   13642                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13643                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
   13644              
   13645              $C$DW$825       .dwtag  DW_TAG_member
   13646                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$20)
   13647                      .dwattr $C$DW$825, DW_AT_name("timeoutPreload")
   13648                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_timeoutPreload")
   13649                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13650                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
   13651              
   13652              $C$DW$826       .dwtag  DW_TAG_member
   13653                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$20)
   13654                      .dwattr $C$DW$826, DW_AT_name("timeoutCntEnable")
   13655                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_timeoutCntEnable")
   13656                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  264

   13657                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
   13658              
   13659              $C$DW$827       .dwtag  DW_TAG_member
   13660                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$25)
   13661                      .dwattr $C$DW$827, DW_AT_name("filterConfig")
   13662                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_filterConfig")
   13663                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13664                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
   13665              
   13666                      .dwendtag $C$DW$T$26
   13667              
   13668              $C$DW$T$66      .dwtag  DW_TAG_typedef
   13669                      .dwattr $C$DW$T$66, DW_AT_name("MCAN_ConfigParams")
   13670                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$26)
   13671                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   13672              
   13673              $C$DW$828       .dwtag  DW_TAG_TI_far_type
   13674                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$66)
   13675              
   13676              $C$DW$T$67      .dwtag  DW_TAG_const_type
   13677                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$828)
   13678              
   13679              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
   13680                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
   13681                      .dwattr $C$DW$T$68, DW_AT_address_class(0x20)
   13682              
   13683              $C$DW$829       .dwtag  DW_TAG_TI_far_type
   13684                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$68)
   13685              
   13686              $C$DW$T$69      .dwtag  DW_TAG_const_type
   13687                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$829)
   13688              
   13689              
   13690              $C$DW$T$27      .dwtag  DW_TAG_structure_type
   13691                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
   13692              $C$DW$830       .dwtag  DW_TAG_member
   13693                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$20)
   13694                      .dwattr $C$DW$830, DW_AT_name("enable")
   13695                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_enable")
   13696                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13697                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
   13698              
   13699              $C$DW$831       .dwtag  DW_TAG_member
   13700                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$20)
   13701                      .dwattr $C$DW$831, DW_AT_name("enableChk")
   13702                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_enableChk")
   13703                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13704                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
   13705              
   13706              $C$DW$832       .dwtag  DW_TAG_member
   13707                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$20)
   13708                      .dwattr $C$DW$832, DW_AT_name("enableRdModWr")
   13709                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_enableRdModWr")
   13710                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13711                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  265

   13712              
   13713                      .dwendtag $C$DW$T$27
   13714              
   13715              $C$DW$T$74      .dwtag  DW_TAG_typedef
   13716                      .dwattr $C$DW$T$74, DW_AT_name("MCAN_ECCConfigParams")
   13717                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$27)
   13718                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
   13719              
   13720              $C$DW$833       .dwtag  DW_TAG_TI_far_type
   13721                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$74)
   13722              
   13723              $C$DW$T$75      .dwtag  DW_TAG_const_type
   13724                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$833)
   13725              
   13726              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
   13727                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
   13728                      .dwattr $C$DW$T$76, DW_AT_address_class(0x20)
   13729              
   13730              $C$DW$834       .dwtag  DW_TAG_TI_far_type
   13731                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$76)
   13732              
   13733              $C$DW$T$77      .dwtag  DW_TAG_const_type
   13734                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$834)
   13735              
   13736              
   13737              $C$DW$T$28      .dwtag  DW_TAG_structure_type
   13738                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x10)
   13739              $C$DW$835       .dwtag  DW_TAG_member
   13740                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$20)
   13741                      .dwattr $C$DW$835, DW_AT_name("nomRatePrescalar")
   13742                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_nomRatePrescalar")
   13743                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13744                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
   13745              
   13746              $C$DW$836       .dwtag  DW_TAG_member
   13747                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$20)
   13748                      .dwattr $C$DW$836, DW_AT_name("nomTimeSeg1")
   13749                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_nomTimeSeg1")
   13750                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13751                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
   13752              
   13753              $C$DW$837       .dwtag  DW_TAG_member
   13754                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$20)
   13755                      .dwattr $C$DW$837, DW_AT_name("nomTimeSeg2")
   13756                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_nomTimeSeg2")
   13757                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13758                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
   13759              
   13760              $C$DW$838       .dwtag  DW_TAG_member
   13761                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$20)
   13762                      .dwattr $C$DW$838, DW_AT_name("nomSynchJumpWidth")
   13763                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_nomSynchJumpWidth")
   13764                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13765                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
   13766              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  266

   13767              $C$DW$839       .dwtag  DW_TAG_member
   13768                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$20)
   13769                      .dwattr $C$DW$839, DW_AT_name("dataRatePrescalar")
   13770                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_dataRatePrescalar")
   13771                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13772                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
   13773              
   13774              $C$DW$840       .dwtag  DW_TAG_member
   13775                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$20)
   13776                      .dwattr $C$DW$840, DW_AT_name("dataTimeSeg1")
   13777                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_dataTimeSeg1")
   13778                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13779                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
   13780              
   13781              $C$DW$841       .dwtag  DW_TAG_member
   13782                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$20)
   13783                      .dwattr $C$DW$841, DW_AT_name("dataTimeSeg2")
   13784                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_dataTimeSeg2")
   13785                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13786                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
   13787              
   13788              $C$DW$842       .dwtag  DW_TAG_member
   13789                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$20)
   13790                      .dwattr $C$DW$842, DW_AT_name("dataSynchJumpWidth")
   13791                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_dataSynchJumpWidth")
   13792                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13793                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
   13794              
   13795                      .dwendtag $C$DW$T$28
   13796              
   13797              $C$DW$T$82      .dwtag  DW_TAG_typedef
   13798                      .dwattr $C$DW$T$82, DW_AT_name("MCAN_BitTimingParams")
   13799                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$28)
   13800                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   13801              
   13802              $C$DW$843       .dwtag  DW_TAG_TI_far_type
   13803                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$82)
   13804              
   13805              $C$DW$T$83      .dwtag  DW_TAG_const_type
   13806                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$843)
   13807              
   13808              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
   13809                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   13810                      .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
   13811              
   13812              $C$DW$844       .dwtag  DW_TAG_TI_far_type
   13813                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$84)
   13814              
   13815              $C$DW$T$85      .dwtag  DW_TAG_const_type
   13816                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$844)
   13817              
   13818              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
   13819                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$82)
   13820                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
   13821              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  267

   13822              $C$DW$845       .dwtag  DW_TAG_TI_far_type
   13823                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$86)
   13824              
   13825              $C$DW$T$87      .dwtag  DW_TAG_const_type
   13826                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$845)
   13827              
   13828              
   13829              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   13830                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x30)
   13831              $C$DW$846       .dwtag  DW_TAG_member
   13832                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$20)
   13833                      .dwattr $C$DW$846, DW_AT_name("flssa")
   13834                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_flssa")
   13835                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13836                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
   13837              
   13838              $C$DW$847       .dwtag  DW_TAG_member
   13839                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$20)
   13840                      .dwattr $C$DW$847, DW_AT_name("lss")
   13841                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_lss")
   13842                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13843                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
   13844              
   13845              $C$DW$848       .dwtag  DW_TAG_member
   13846                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$20)
   13847                      .dwattr $C$DW$848, DW_AT_name("flesa")
   13848                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_flesa")
   13849                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13850                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
   13851              
   13852              $C$DW$849       .dwtag  DW_TAG_member
   13853                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$20)
   13854                      .dwattr $C$DW$849, DW_AT_name("lse")
   13855                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_lse")
   13856                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13857                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
   13858              
   13859              $C$DW$850       .dwtag  DW_TAG_member
   13860                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$20)
   13861                      .dwattr $C$DW$850, DW_AT_name("txStartAddr")
   13862                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_txStartAddr")
   13863                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13864                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
   13865              
   13866              $C$DW$851       .dwtag  DW_TAG_member
   13867                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$20)
   13868                      .dwattr $C$DW$851, DW_AT_name("txBufNum")
   13869                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_txBufNum")
   13870                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13871                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
   13872              
   13873              $C$DW$852       .dwtag  DW_TAG_member
   13874                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$20)
   13875                      .dwattr $C$DW$852, DW_AT_name("txFIFOSize")
   13876                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_txFIFOSize")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  268

   13877                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13878                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
   13879              
   13880              $C$DW$853       .dwtag  DW_TAG_member
   13881                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$20)
   13882                      .dwattr $C$DW$853, DW_AT_name("txBufMode")
   13883                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_txBufMode")
   13884                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13885                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
   13886              
   13887              $C$DW$854       .dwtag  DW_TAG_member
   13888                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$20)
   13889                      .dwattr $C$DW$854, DW_AT_name("txBufElemSize")
   13890                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_txBufElemSize")
   13891                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13892                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
   13893              
   13894              $C$DW$855       .dwtag  DW_TAG_member
   13895                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$20)
   13896                      .dwattr $C$DW$855, DW_AT_name("txEventFIFOStartAddr")
   13897                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_txEventFIFOStartAddr")
   13898                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13899                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
   13900              
   13901              $C$DW$856       .dwtag  DW_TAG_member
   13902                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$20)
   13903                      .dwattr $C$DW$856, DW_AT_name("txEventFIFOSize")
   13904                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_txEventFIFOSize")
   13905                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13906                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
   13907              
   13908              $C$DW$857       .dwtag  DW_TAG_member
   13909                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$20)
   13910                      .dwattr $C$DW$857, DW_AT_name("txEventFIFOWaterMark")
   13911                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_txEventFIFOWaterMark")
   13912                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13913                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
   13914              
   13915              $C$DW$858       .dwtag  DW_TAG_member
   13916                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$20)
   13917                      .dwattr $C$DW$858, DW_AT_name("rxFIFO0startAddr")
   13918                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_rxFIFO0startAddr")
   13919                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13920                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
   13921              
   13922              $C$DW$859       .dwtag  DW_TAG_member
   13923                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$20)
   13924                      .dwattr $C$DW$859, DW_AT_name("rxFIFO0size")
   13925                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_rxFIFO0size")
   13926                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13927                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
   13928              
   13929              $C$DW$860       .dwtag  DW_TAG_member
   13930                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$20)
   13931                      .dwattr $C$DW$860, DW_AT_name("rxFIFO0waterMark")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  269

   13932                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_rxFIFO0waterMark")
   13933                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13934                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
   13935              
   13936              $C$DW$861       .dwtag  DW_TAG_member
   13937                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$20)
   13938                      .dwattr $C$DW$861, DW_AT_name("rxFIFO0OpMode")
   13939                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_rxFIFO0OpMode")
   13940                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   13941                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
   13942              
   13943              $C$DW$862       .dwtag  DW_TAG_member
   13944                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$20)
   13945                      .dwattr $C$DW$862, DW_AT_name("rxFIFO1startAddr")
   13946                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_rxFIFO1startAddr")
   13947                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   13948                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
   13949              
   13950              $C$DW$863       .dwtag  DW_TAG_member
   13951                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$20)
   13952                      .dwattr $C$DW$863, DW_AT_name("rxFIFO1size")
   13953                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_rxFIFO1size")
   13954                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   13955                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
   13956              
   13957              $C$DW$864       .dwtag  DW_TAG_member
   13958                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$20)
   13959                      .dwattr $C$DW$864, DW_AT_name("rxFIFO1waterMark")
   13960                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_rxFIFO1waterMark")
   13961                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   13962                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
   13963              
   13964              $C$DW$865       .dwtag  DW_TAG_member
   13965                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$20)
   13966                      .dwattr $C$DW$865, DW_AT_name("rxFIFO1OpMode")
   13967                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_rxFIFO1OpMode")
   13968                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   13969                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
   13970              
   13971              $C$DW$866       .dwtag  DW_TAG_member
   13972                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$20)
   13973                      .dwattr $C$DW$866, DW_AT_name("rxBufStartAddr")
   13974                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_rxBufStartAddr")
   13975                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   13976                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
   13977              
   13978              $C$DW$867       .dwtag  DW_TAG_member
   13979                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$20)
   13980                      .dwattr $C$DW$867, DW_AT_name("rxBufElemSize")
   13981                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_rxBufElemSize")
   13982                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   13983                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
   13984              
   13985              $C$DW$868       .dwtag  DW_TAG_member
   13986                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  270

   13987                      .dwattr $C$DW$868, DW_AT_name("rxFIFO0ElemSize")
   13988                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_rxFIFO0ElemSize")
   13989                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   13990                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
   13991              
   13992              $C$DW$869       .dwtag  DW_TAG_member
   13993                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$20)
   13994                      .dwattr $C$DW$869, DW_AT_name("rxFIFO1ElemSize")
   13995                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_rxFIFO1ElemSize")
   13996                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   13997                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
   13998              
   13999                      .dwendtag $C$DW$T$29
   14000              
   14001              $C$DW$T$93      .dwtag  DW_TAG_typedef
   14002                      .dwattr $C$DW$T$93, DW_AT_name("MCAN_MsgRAMConfigParams")
   14003                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$29)
   14004                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   14005              
   14006              $C$DW$870       .dwtag  DW_TAG_TI_far_type
   14007                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$93)
   14008              
   14009              $C$DW$T$94      .dwtag  DW_TAG_const_type
   14010                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$870)
   14011              
   14012              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
   14013                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   14014                      .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
   14015              
   14016              $C$DW$871       .dwtag  DW_TAG_TI_far_type
   14017                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$95)
   14018              
   14019              $C$DW$T$96      .dwtag  DW_TAG_const_type
   14020                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$871)
   14021              
   14022              
   14023              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   14024                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x52)
   14025              $C$DW$872       .dwtag  DW_TAG_member
   14026                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$20)
   14027                      .dwattr $C$DW$872, DW_AT_name("id")
   14028                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_id")
   14029                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14030                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
   14031              
   14032              $C$DW$873       .dwtag  DW_TAG_member
   14033                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$20)
   14034                      .dwattr $C$DW$873, DW_AT_name("rtr")
   14035                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_rtr")
   14036                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14037                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
   14038              
   14039              $C$DW$874       .dwtag  DW_TAG_member
   14040                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$20)
   14041                      .dwattr $C$DW$874, DW_AT_name("xtd")
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  271

   14042                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_xtd")
   14043                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14044                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
   14045              
   14046              $C$DW$875       .dwtag  DW_TAG_member
   14047                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$20)
   14048                      .dwattr $C$DW$875, DW_AT_name("esi")
   14049                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_esi")
   14050                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14051                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
   14052              
   14053              $C$DW$876       .dwtag  DW_TAG_member
   14054                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$20)
   14055                      .dwattr $C$DW$876, DW_AT_name("dlc")
   14056                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_dlc")
   14057                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14058                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
   14059              
   14060              $C$DW$877       .dwtag  DW_TAG_member
   14061                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$20)
   14062                      .dwattr $C$DW$877, DW_AT_name("brs")
   14063                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_brs")
   14064                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14065                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
   14066              
   14067              $C$DW$878       .dwtag  DW_TAG_member
   14068                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$20)
   14069                      .dwattr $C$DW$878, DW_AT_name("fdf")
   14070                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_fdf")
   14071                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14072                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
   14073              
   14074              $C$DW$879       .dwtag  DW_TAG_member
   14075                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$20)
   14076                      .dwattr $C$DW$879, DW_AT_name("efc")
   14077                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_efc")
   14078                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14079                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
   14080              
   14081              $C$DW$880       .dwtag  DW_TAG_member
   14082                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$20)
   14083                      .dwattr $C$DW$880, DW_AT_name("mm")
   14084                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_mm")
   14085                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14086                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
   14087              
   14088              $C$DW$881       .dwtag  DW_TAG_member
   14089                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$32)
   14090                      .dwattr $C$DW$881, DW_AT_name("data")
   14091                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_data")
   14092                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14093                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
   14094              
   14095                      .dwendtag $C$DW$T$33
   14096              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  272

   14097              $C$DW$T$101     .dwtag  DW_TAG_typedef
   14098                      .dwattr $C$DW$T$101, DW_AT_name("MCAN_TxBufElement")
   14099                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$33)
   14100                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
   14101              
   14102              $C$DW$882       .dwtag  DW_TAG_TI_far_type
   14103                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$101)
   14104              
   14105              $C$DW$T$102     .dwtag  DW_TAG_const_type
   14106                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$882)
   14107              
   14108              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
   14109                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
   14110                      .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
   14111              
   14112              $C$DW$883       .dwtag  DW_TAG_TI_far_type
   14113                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$103)
   14114              
   14115              $C$DW$T$104     .dwtag  DW_TAG_const_type
   14116                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$883)
   14117              
   14118              
   14119              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   14120                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
   14121              $C$DW$884       .dwtag  DW_TAG_member
   14122                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$20)
   14123                      .dwattr $C$DW$884, DW_AT_name("statusLow")
   14124                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_statusLow")
   14125                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14126                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
   14127              
   14128              $C$DW$885       .dwtag  DW_TAG_member
   14129                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$20)
   14130                      .dwattr $C$DW$885, DW_AT_name("statusHigh")
   14131                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_statusHigh")
   14132                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14133                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
   14134              
   14135                      .dwendtag $C$DW$T$34
   14136              
   14137              $C$DW$T$109     .dwtag  DW_TAG_typedef
   14138                      .dwattr $C$DW$T$109, DW_AT_name("MCAN_RxNewDataStatus")
   14139                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$34)
   14140                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
   14141              
   14142              $C$DW$886       .dwtag  DW_TAG_TI_far_type
   14143                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$109)
   14144              
   14145              $C$DW$T$110     .dwtag  DW_TAG_const_type
   14146                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$886)
   14147              
   14148              $C$DW$T$111     .dwtag  DW_TAG_pointer_type
   14149                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
   14150                      .dwattr $C$DW$T$111, DW_AT_address_class(0x20)
   14151              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  273

   14152              $C$DW$887       .dwtag  DW_TAG_TI_far_type
   14153                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$111)
   14154              
   14155              $C$DW$T$112     .dwtag  DW_TAG_const_type
   14156                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$887)
   14157              
   14158              $C$DW$T$113     .dwtag  DW_TAG_pointer_type
   14159                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$109)
   14160                      .dwattr $C$DW$T$113, DW_AT_address_class(0x20)
   14161              
   14162              $C$DW$888       .dwtag  DW_TAG_TI_far_type
   14163                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$113)
   14164              
   14165              $C$DW$T$114     .dwtag  DW_TAG_const_type
   14166                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$888)
   14167              
   14168              
   14169              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   14170                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x54)
   14171              $C$DW$889       .dwtag  DW_TAG_member
   14172                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$20)
   14173                      .dwattr $C$DW$889, DW_AT_name("id")
   14174                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_id")
   14175                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14176                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
   14177              
   14178              $C$DW$890       .dwtag  DW_TAG_member
   14179                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$20)
   14180                      .dwattr $C$DW$890, DW_AT_name("rtr")
   14181                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_rtr")
   14182                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14183                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
   14184              
   14185              $C$DW$891       .dwtag  DW_TAG_member
   14186                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$20)
   14187                      .dwattr $C$DW$891, DW_AT_name("xtd")
   14188                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_xtd")
   14189                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14190                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
   14191              
   14192              $C$DW$892       .dwtag  DW_TAG_member
   14193                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$20)
   14194                      .dwattr $C$DW$892, DW_AT_name("esi")
   14195                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_esi")
   14196                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14197                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
   14198              
   14199              $C$DW$893       .dwtag  DW_TAG_member
   14200                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$20)
   14201                      .dwattr $C$DW$893, DW_AT_name("rxts")
   14202                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_rxts")
   14203                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14204                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
   14205              
   14206              $C$DW$894       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  274

   14207                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$20)
   14208                      .dwattr $C$DW$894, DW_AT_name("dlc")
   14209                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_dlc")
   14210                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14211                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
   14212              
   14213              $C$DW$895       .dwtag  DW_TAG_member
   14214                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$20)
   14215                      .dwattr $C$DW$895, DW_AT_name("brs")
   14216                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_brs")
   14217                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14218                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
   14219              
   14220              $C$DW$896       .dwtag  DW_TAG_member
   14221                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$20)
   14222                      .dwattr $C$DW$896, DW_AT_name("fdf")
   14223                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_fdf")
   14224                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14225                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
   14226              
   14227              $C$DW$897       .dwtag  DW_TAG_member
   14228                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$20)
   14229                      .dwattr $C$DW$897, DW_AT_name("fidx")
   14230                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_fidx")
   14231                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14232                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
   14233              
   14234              $C$DW$898       .dwtag  DW_TAG_member
   14235                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$20)
   14236                      .dwattr $C$DW$898, DW_AT_name("anmf")
   14237                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_anmf")
   14238                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14239                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
   14240              
   14241              $C$DW$899       .dwtag  DW_TAG_member
   14242                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$32)
   14243                      .dwattr $C$DW$899, DW_AT_name("data")
   14244                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_data")
   14245                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14246                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
   14247              
   14248                      .dwendtag $C$DW$T$35
   14249              
   14250              $C$DW$T$117     .dwtag  DW_TAG_typedef
   14251                      .dwattr $C$DW$T$117, DW_AT_name("MCAN_RxBufElement")
   14252                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$35)
   14253                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   14254              
   14255              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
   14256                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
   14257                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
   14258              
   14259              $C$DW$900       .dwtag  DW_TAG_TI_far_type
   14260                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$118)
   14261              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  275

   14262              $C$DW$T$119     .dwtag  DW_TAG_const_type
   14263                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$900)
   14264              
   14265              
   14266              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   14267                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x14)
   14268              $C$DW$901       .dwtag  DW_TAG_member
   14269                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$20)
   14270                      .dwattr $C$DW$901, DW_AT_name("id")
   14271                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_id")
   14272                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14273                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
   14274              
   14275              $C$DW$902       .dwtag  DW_TAG_member
   14276                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$20)
   14277                      .dwattr $C$DW$902, DW_AT_name("rtr")
   14278                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_rtr")
   14279                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14280                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
   14281              
   14282              $C$DW$903       .dwtag  DW_TAG_member
   14283                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$20)
   14284                      .dwattr $C$DW$903, DW_AT_name("xtd")
   14285                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_xtd")
   14286                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14287                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
   14288              
   14289              $C$DW$904       .dwtag  DW_TAG_member
   14290                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$20)
   14291                      .dwattr $C$DW$904, DW_AT_name("esi")
   14292                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_esi")
   14293                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14294                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
   14295              
   14296              $C$DW$905       .dwtag  DW_TAG_member
   14297                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$20)
   14298                      .dwattr $C$DW$905, DW_AT_name("txts")
   14299                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_txts")
   14300                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14301                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
   14302              
   14303              $C$DW$906       .dwtag  DW_TAG_member
   14304                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$20)
   14305                      .dwattr $C$DW$906, DW_AT_name("dlc")
   14306                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_dlc")
   14307                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14308                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
   14309              
   14310              $C$DW$907       .dwtag  DW_TAG_member
   14311                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$20)
   14312                      .dwattr $C$DW$907, DW_AT_name("brs")
   14313                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_brs")
   14314                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14315                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
   14316              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  276

   14317              $C$DW$908       .dwtag  DW_TAG_member
   14318                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$20)
   14319                      .dwattr $C$DW$908, DW_AT_name("fdf")
   14320                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_fdf")
   14321                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14322                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
   14323              
   14324              $C$DW$909       .dwtag  DW_TAG_member
   14325                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$20)
   14326                      .dwattr $C$DW$909, DW_AT_name("et")
   14327                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_et")
   14328                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14329                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
   14330              
   14331              $C$DW$910       .dwtag  DW_TAG_member
   14332                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$20)
   14333                      .dwattr $C$DW$910, DW_AT_name("mm")
   14334                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_mm")
   14335                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14336                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
   14337              
   14338                      .dwendtag $C$DW$T$36
   14339              
   14340              $C$DW$T$122     .dwtag  DW_TAG_typedef
   14341                      .dwattr $C$DW$T$122, DW_AT_name("MCAN_TxEventFIFOElement")
   14342                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$36)
   14343                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
   14344              
   14345              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
   14346                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
   14347                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
   14348              
   14349              $C$DW$911       .dwtag  DW_TAG_TI_far_type
   14350                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$123)
   14351              
   14352              $C$DW$T$124     .dwtag  DW_TAG_const_type
   14353                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$911)
   14354              
   14355              
   14356              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   14357                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   14358              $C$DW$912       .dwtag  DW_TAG_member
   14359                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$20)
   14360                      .dwattr $C$DW$912, DW_AT_name("sfid2")
   14361                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_sfid2")
   14362                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14363                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
   14364              
   14365              $C$DW$913       .dwtag  DW_TAG_member
   14366                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$20)
   14367                      .dwattr $C$DW$913, DW_AT_name("sfid1")
   14368                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_sfid1")
   14369                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14370                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
   14371              
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  277

   14372              $C$DW$914       .dwtag  DW_TAG_member
   14373                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$20)
   14374                      .dwattr $C$DW$914, DW_AT_name("sfec")
   14375                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_sfec")
   14376                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14377                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
   14378              
   14379              $C$DW$915       .dwtag  DW_TAG_member
   14380                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$20)
   14381                      .dwattr $C$DW$915, DW_AT_name("sft")
   14382                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_sft")
   14383                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14384                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
   14385              
   14386                      .dwendtag $C$DW$T$37
   14387              
   14388              $C$DW$T$130     .dwtag  DW_TAG_typedef
   14389                      .dwattr $C$DW$T$130, DW_AT_name("MCAN_StdMsgIDFilterElement")
   14390                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$37)
   14391                      .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
   14392              
   14393              $C$DW$916       .dwtag  DW_TAG_TI_far_type
   14394                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$130)
   14395              
   14396              $C$DW$T$131     .dwtag  DW_TAG_const_type
   14397                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$916)
   14398              
   14399              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
   14400                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
   14401                      .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
   14402              
   14403              $C$DW$917       .dwtag  DW_TAG_TI_far_type
   14404                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$132)
   14405              
   14406              $C$DW$T$133     .dwtag  DW_TAG_const_type
   14407                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$917)
   14408              
   14409              
   14410              $C$DW$T$38      .dwtag  DW_TAG_structure_type
   14411                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
   14412              $C$DW$918       .dwtag  DW_TAG_member
   14413                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$20)
   14414                      .dwattr $C$DW$918, DW_AT_name("efid1")
   14415                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_efid1")
   14416                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14417                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
   14418              
   14419              $C$DW$919       .dwtag  DW_TAG_member
   14420                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$20)
   14421                      .dwattr $C$DW$919, DW_AT_name("efec")
   14422                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_efec")
   14423                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14424                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
   14425              
   14426              $C$DW$920       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  278

   14427                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$20)
   14428                      .dwattr $C$DW$920, DW_AT_name("efid2")
   14429                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_efid2")
   14430                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14431                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
   14432              
   14433              $C$DW$921       .dwtag  DW_TAG_member
   14434                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$20)
   14435                      .dwattr $C$DW$921, DW_AT_name("eft")
   14436                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_eft")
   14437                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14438                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
   14439              
   14440                      .dwendtag $C$DW$T$38
   14441              
   14442              $C$DW$T$138     .dwtag  DW_TAG_typedef
   14443                      .dwattr $C$DW$T$138, DW_AT_name("MCAN_ExtMsgIDFilterElement")
   14444                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$38)
   14445                      .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
   14446              
   14447              $C$DW$922       .dwtag  DW_TAG_TI_far_type
   14448                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$138)
   14449              
   14450              $C$DW$T$139     .dwtag  DW_TAG_const_type
   14451                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$922)
   14452              
   14453              $C$DW$T$140     .dwtag  DW_TAG_pointer_type
   14454                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$139)
   14455                      .dwattr $C$DW$T$140, DW_AT_address_class(0x20)
   14456              
   14457              $C$DW$923       .dwtag  DW_TAG_TI_far_type
   14458                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$140)
   14459              
   14460              $C$DW$T$141     .dwtag  DW_TAG_const_type
   14461                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$923)
   14462              
   14463              
   14464              $C$DW$T$39      .dwtag  DW_TAG_structure_type
   14465                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
   14466              $C$DW$924       .dwtag  DW_TAG_member
   14467                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$20)
   14468                      .dwattr $C$DW$924, DW_AT_name("transErrLogCnt")
   14469                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_transErrLogCnt")
   14470                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14471                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
   14472              
   14473              $C$DW$925       .dwtag  DW_TAG_member
   14474                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$20)
   14475                      .dwattr $C$DW$925, DW_AT_name("recErrCnt")
   14476                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_recErrCnt")
   14477                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14478                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
   14479              
   14480              $C$DW$926       .dwtag  DW_TAG_member
   14481                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  279

   14482                      .dwattr $C$DW$926, DW_AT_name("rpStatus")
   14483                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_rpStatus")
   14484                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14485                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
   14486              
   14487              $C$DW$927       .dwtag  DW_TAG_member
   14488                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$20)
   14489                      .dwattr $C$DW$927, DW_AT_name("canErrLogCnt")
   14490                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_canErrLogCnt")
   14491                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14492                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
   14493              
   14494                      .dwendtag $C$DW$T$39
   14495              
   14496              $C$DW$T$143     .dwtag  DW_TAG_typedef
   14497                      .dwattr $C$DW$T$143, DW_AT_name("MCAN_ErrCntStatus")
   14498                      .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$39)
   14499                      .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
   14500              
   14501              $C$DW$T$144     .dwtag  DW_TAG_pointer_type
   14502                      .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$143)
   14503                      .dwattr $C$DW$T$144, DW_AT_address_class(0x20)
   14504              
   14505              $C$DW$928       .dwtag  DW_TAG_TI_far_type
   14506                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$144)
   14507              
   14508              $C$DW$T$145     .dwtag  DW_TAG_const_type
   14509                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$928)
   14510              
   14511              
   14512              $C$DW$T$40      .dwtag  DW_TAG_structure_type
   14513                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x16)
   14514              $C$DW$929       .dwtag  DW_TAG_member
   14515                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$20)
   14516                      .dwattr $C$DW$929, DW_AT_name("lastErrCode")
   14517                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_lastErrCode")
   14518                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14519                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
   14520              
   14521              $C$DW$930       .dwtag  DW_TAG_member
   14522                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$20)
   14523                      .dwattr $C$DW$930, DW_AT_name("act")
   14524                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_act")
   14525                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14526                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
   14527              
   14528              $C$DW$931       .dwtag  DW_TAG_member
   14529                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$20)
   14530                      .dwattr $C$DW$931, DW_AT_name("errPassive")
   14531                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_errPassive")
   14532                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14533                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
   14534              
   14535              $C$DW$932       .dwtag  DW_TAG_member
   14536                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  280

   14537                      .dwattr $C$DW$932, DW_AT_name("warningStatus")
   14538                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_warningStatus")
   14539                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14540                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
   14541              
   14542              $C$DW$933       .dwtag  DW_TAG_member
   14543                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$20)
   14544                      .dwattr $C$DW$933, DW_AT_name("busOffStatus")
   14545                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_busOffStatus")
   14546                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14547                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
   14548              
   14549              $C$DW$934       .dwtag  DW_TAG_member
   14550                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$20)
   14551                      .dwattr $C$DW$934, DW_AT_name("dlec")
   14552                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_dlec")
   14553                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14554                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
   14555              
   14556              $C$DW$935       .dwtag  DW_TAG_member
   14557                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$20)
   14558                      .dwattr $C$DW$935, DW_AT_name("resi")
   14559                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_resi")
   14560                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14561                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
   14562              
   14563              $C$DW$936       .dwtag  DW_TAG_member
   14564                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$20)
   14565                      .dwattr $C$DW$936, DW_AT_name("rbrs")
   14566                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_rbrs")
   14567                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14568                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
   14569              
   14570              $C$DW$937       .dwtag  DW_TAG_member
   14571                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$20)
   14572                      .dwattr $C$DW$937, DW_AT_name("rfdf")
   14573                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_rfdf")
   14574                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14575                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
   14576              
   14577              $C$DW$938       .dwtag  DW_TAG_member
   14578                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$20)
   14579                      .dwattr $C$DW$938, DW_AT_name("pxe")
   14580                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_pxe")
   14581                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14582                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
   14583              
   14584              $C$DW$939       .dwtag  DW_TAG_member
   14585                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$20)
   14586                      .dwattr $C$DW$939, DW_AT_name("tdcv")
   14587                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_tdcv")
   14588                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14589                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
   14590              
   14591                      .dwendtag $C$DW$T$40
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  281

   14592              
   14593              $C$DW$T$148     .dwtag  DW_TAG_typedef
   14594                      .dwattr $C$DW$T$148, DW_AT_name("MCAN_ProtocolStatus")
   14595                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$40)
   14596                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
   14597              
   14598              $C$DW$T$149     .dwtag  DW_TAG_pointer_type
   14599                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
   14600                      .dwattr $C$DW$T$149, DW_AT_address_class(0x20)
   14601              
   14602              $C$DW$940       .dwtag  DW_TAG_TI_far_type
   14603                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$149)
   14604              
   14605              $C$DW$T$150     .dwtag  DW_TAG_const_type
   14606                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$940)
   14607              
   14608              
   14609              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   14610                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   14611              $C$DW$941       .dwtag  DW_TAG_member
   14612                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$20)
   14613                      .dwattr $C$DW$941, DW_AT_name("bufIdx")
   14614                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_bufIdx")
   14615                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14616                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
   14617              
   14618              $C$DW$942       .dwtag  DW_TAG_member
   14619                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$20)
   14620                      .dwattr $C$DW$942, DW_AT_name("msi")
   14621                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_msi")
   14622                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14623                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
   14624              
   14625              $C$DW$943       .dwtag  DW_TAG_member
   14626                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$20)
   14627                      .dwattr $C$DW$943, DW_AT_name("filterIdx")
   14628                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_filterIdx")
   14629                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14630                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
   14631              
   14632              $C$DW$944       .dwtag  DW_TAG_member
   14633                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$20)
   14634                      .dwattr $C$DW$944, DW_AT_name("filterList")
   14635                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_filterList")
   14636                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14637                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
   14638              
   14639                      .dwendtag $C$DW$T$41
   14640              
   14641              $C$DW$T$153     .dwtag  DW_TAG_typedef
   14642                      .dwattr $C$DW$T$153, DW_AT_name("MCAN_HighPriorityMsgInfo")
   14643                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$41)
   14644                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
   14645              
   14646              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  282

   14647                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)
   14648                      .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
   14649              
   14650              $C$DW$945       .dwtag  DW_TAG_TI_far_type
   14651                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$154)
   14652              
   14653              $C$DW$T$155     .dwtag  DW_TAG_const_type
   14654                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$945)
   14655              
   14656              
   14657              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   14658                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
   14659              $C$DW$946       .dwtag  DW_TAG_member
   14660                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$20)
   14661                      .dwattr $C$DW$946, DW_AT_name("num")
   14662                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_num")
   14663                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14664                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
   14665              
   14666              $C$DW$947       .dwtag  DW_TAG_member
   14667                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$20)
   14668                      .dwattr $C$DW$947, DW_AT_name("fillLvl")
   14669                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_fillLvl")
   14670                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14671                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
   14672              
   14673              $C$DW$948       .dwtag  DW_TAG_member
   14674                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$20)
   14675                      .dwattr $C$DW$948, DW_AT_name("getIdx")
   14676                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_getIdx")
   14677                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14678                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
   14679              
   14680              $C$DW$949       .dwtag  DW_TAG_member
   14681                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$20)
   14682                      .dwattr $C$DW$949, DW_AT_name("putIdx")
   14683                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_putIdx")
   14684                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14685                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
   14686              
   14687              $C$DW$950       .dwtag  DW_TAG_member
   14688                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$20)
   14689                      .dwattr $C$DW$950, DW_AT_name("fifoFull")
   14690                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_fifoFull")
   14691                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14692                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
   14693              
   14694              $C$DW$951       .dwtag  DW_TAG_member
   14695                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$20)
   14696                      .dwattr $C$DW$951, DW_AT_name("msgLost")
   14697                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_msgLost")
   14698                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14699                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
   14700              
   14701                      .dwendtag $C$DW$T$42
TMS320C2000 Assembler PC v22.6.1 Wed May 21 09:51:58 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\Daniel\AppData\Local\Temp\{2C0A4961-1358-435F-9775-EBAA64ED3F39} PAGE  283

   14702              
   14703              $C$DW$T$158     .dwtag  DW_TAG_typedef
   14704                      .dwattr $C$DW$T$158, DW_AT_name("MCAN_RxFIFOStatus")
   14705                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$42)
   14706                      .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
   14707              
   14708              $C$DW$T$159     .dwtag  DW_TAG_pointer_type
   14709                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$158)
   14710                      .dwattr $C$DW$T$159, DW_AT_address_class(0x20)
   14711              
   14712              $C$DW$952       .dwtag  DW_TAG_TI_far_type
   14713                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$159)
   14714              
   14715              $C$DW$T$160     .dwtag  DW_TAG_const_type
   14716                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$952)
   14717              
   14718              
   14719              $C$DW$T$43      .dwtag  DW_TAG_structure_type
   14720                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
   14721              $C$DW$953       .dwtag  DW_TAG_member
   14722                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$20)
   14723                      .dwattr $C$DW$953, DW_AT_name("freeLvl")
   14724                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_freeLvl")
   14725                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14726                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
   14727              
   14728              $C$DW$954       .dwtag  DW_TAG_member
   14729                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$20)
   14730                      .dwattr $C$DW$954, DW_AT_name("getIdx")
   14731                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_getIdx")
   14732                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14733                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
   14734              
   14735              $C$DW$955       .dwtag  DW_TAG_member
   14736                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$20)
   14737                      .dwattr $C$DW$955, DW_AT_name("putIdx")
   14738                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_putIdx")
   14739                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14740                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
   14741              
   14742              $C$DW$956       .dwtag  DW_TAG_member
   14743                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$20)
   14744                      .dwattr $C$DW$956, DW_AT_name("fifoFull")
   14745                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_fifoFull")
